{"0": "Collection: Re-charge Black Pepper Collection; Description: Re-Charge Black Pepper:\n\nKey Information - Our bestselling spicy blend will keep you refreshed and fragrant with notes of black pepper, coriander and vetiver. Re-charge Black Pepper is a true masculine icon. \n\nLaunched in 2002 and the result of one of our early and most iconic partnerships with Master Perfumer, Jacques Chabert, our Re-charge Black Pepper Collection is Adventurous, Energising and Confident.\n\nGrown in Madagascar, Black Peppercorns unveil powerful spicy and fruity flavours - it is a pepper that provides an outstanding finish, both sharp and refined.• The pepper plant is a vine with small green flowers grouped in long clusters, which give way to fleshy fruits of varying colours,\n\nRe-charge Black Pepper has come  to achieve iconic status because of its distinctive clash between bright citrus and deep woody notes.\n\nWhen Jacques revisited our original Re-charge Black Pepper collection in 2019, to begin the creation of our Eaux de Parfum, it was the characteristic spiciness of the Black Peppercorn that really drew him to an ingredient that would amplify and enhance this\nbold warmth. \n\nThe ingredient Jacques selected for the Eaux de Parfum was Myrtle Pepper. Myrtle Pepper, otherwise know as Allspice or Pimento, comes from the unripened berries of the evergreen Pimenta tree. Robust and complex, with hints of cinnamon and nutmeg, it’s a spicy accent that adds a rich dimension to the overall fragrance. depending on maturity.\n\nBlack Pepper, as we recognise it, is the full, mature peppercorn, picked when tinged with red.", "1": "Collection: Heavenly Gingerlily Collection; Description: Blended with tamanu nut oil, warming ginger and white lily extract, Heavenly Gingerlily leaves a delicate, tropical scent. \n\nGive them the gift of the Tahitian shore breeze with our exquisite Eaux de Toilette or Eaux de parfum. \n\nBlack sandy shorelines, luscious forests and a spicy perfumed breeze...The perfect setting for our beautifully white floral icon, Heavenly Gingerlily.\n\nHeavenly Gingerlily is a warming, timeless fragrance which epitomises the exotic escapism of Polynesia. Blooming floral notes of Tuberose, Lily and Rose are accompanied by warming Ginger.\n\nThe Gingerlily flower, known as the ‘Tahitian flame’ inspired the collections colour.\n\nOur Heavenly Gingerlily collection is the creation of Master Perfumer Jacques Chabert. A Master Perfumer in every sense, Jacques Chabert has an exhaustive and encyclopaedic knowledge of fragrance.\n\nHis approach is instinctive and wildly creative. Jacques is passionate about the reconstruction of natural ingredients. Using a combination\nof Ginger, Lily and Musk, Jacques began crafting an elegant yet alluring fragrance which quickly became an icon.\n\n18 years after its initial launch in • 2001, Heavenly Gingerlily was revisited by Jacques - and this time, this Master of Perfumery embarked on a new journey of discovery to find a unique signature note which would • enrich and magnify the floral heart\nof our icon. \n\nExotic, Alluring and Escapist. \n\nHyacinth was the perfect addition to the Eaux de Parfum. Hyacinth is fresh and aquatic, yet opulent with its sweet floral notes and green undertones.\n\nIt wraps around the aquatic spicy character of the original scent to give it a more sensuous and distinct signature.", "2": "Collection: Fiery Pink Pepper Collection; Description: Sultry. Humid. Spicy. Wrap yourself in a seductively spiced scent with pink pepper, warm ginger and rich patchouli. Entice your senses with a fragrance, indulge in pampering with our shower gel, body lotion, exfoliating body scrub, and hand care collections. • Inspired by the ‘grains of paradise’ our Fiery Pink Pepper collection is a sultry, warming fragrance which embodies the very spirit of the flamboyant Pink Peppercorn.\n\nPink Peppercorn’s are also known as the ‘Pink Gold of Reunion’ and these tiny little seeds are prized for their similarity in taste to Black Pepper yet they have many floral attributes and aromas.\n\nTheir amazingly complex flavour is that of Pepper, Coriander, Ginger & Cardamom with a hint of citrus.\n\nOur Fiery Pink Pepper collection • is the creation of Senior Perfumer Carla Chabert. The daughter of world-renowned Master Perfumer Jacques Chabert, Carla has experimented with notes and accords since a young age. \n\nUsing Pink Peppercorns, Carla began crafting a spicy, rich fragrance which would soon become the perfect companion to our Re-charge Black Pepper collection.\n\n9 years on from the launch of our Fiery Pink Pepper collection in 2010, we once again requested the expertise of Carla, as we began the journey to creating our very first Fiery Pink Pepper Eaux de Parfum. Through experimentation and vibrant pink inspiration, Carla sort an ingredient that was as bold and striking in its natural form as Pink Peppercorns. Osmanthus was the perfect addition. Bright, dramatic and eccentric \n\nOsmanthus shares a rich, natural synergy and gives an apricot sweetness to Pink Pepper.\n\nCarla shares her thoughts on how Osmanthus and Pink Pepper interact as she says “Osmanthus is a sweet floral with a leathery kick that echoes that piquancy of the Pink Pepper”. Smouldering, Sultry and Stirring.", "3": "Collection: Delicious Rhubard & Rose Collection; Description: A temptingly sweet recipe of rose, rhubarb and yuzu fruit to tantalise the senses. From scented candles and aroma reed diffusers to body lotions and hand creams, delight in the delicate harmony of vivacious fruity aromas, softened with gentle pink rose that our Delicious Rhubarb & Rose collection offers.\n\nInspired by the sweetness of a • Our Delicious Rhubarb & Rose • crisp summer tart our Delicious collection is the creation of Senior Rhubarb & Rose collection is a Perfumer Vanessa Prudent. Born in fizzy, tempting fragrance which Normandy, Vanessa discovered an symbolises the very essence of early passion for fragrance through sharp Yorkshire Rhubarb. nature.\n\nRhubarb is so beloved of northern • Vanessa has had the pleasure of • gardeners because the cool, damp travelling across the world, and this conditions produce the sweetest, is where she has found her biggest most succulent stalks. Whether inspiration. Discovering new places baked into a mouth watering evokes a curiosity and emotion she dessert or simply dipped in sugar, uses in her perfumery.\n\nRhubarb has a distinctively cheerful appearance and taste.\n\nUsing Rhubarb sourced from the luscious gardens of the Yorkshire Triangle, Vanessa began crafting an irresistible, gourmand fragrance which would soon become a favourite of all who experience it. An intriguing combination of natural and synthetic ingredients, our Delicious Rhubarb & Rose Collection is a true floral, fruity gourmand collection. Rhubarb spikes a bitter top note as zesty fruits fizz with a citrus twist.\n\nThe Eaux de Parfum opens with freshly-picked Lychee and delicate Peony, sprinkled with a spicy kick of Pink Pepper.\n\nA signature note of Raspberry brings out its juicy and joyful style. Perfect for those who love the sweet things in life – indulge in a beautiful spring afternoon all year round. Vivacious, Fizzy and Tempting.", "4": "Collection: Coastal Cypress & Sea Fennel Key Information; Description: Drench your senses in a collision of Australian sea fennel, cypress and earthy cedarwood with our Coastal Cypress & Sea Fennel collection. From our award-winning Bath & Shower Gel and Fine Liquid Hand Wash to refreshing Deodorant and Bath Salts, lose yourself in this invigorating fragrance. • A rich interpretation of Azure Blue, our Coastal Cypress & Sea Fennel collection is a bracing, marine inspired fragrance which expresses the very essence of the rugged, ever-changing coastline.\n\nMarine notes are accompanied by striking, naturally blue Cypress Oil. Blue Cypress Oil, sometimes referred to as Blue Gold, is similar to Sandalwood oil and Vetiver oil, with long-lasting, warm, woody base notes and earthy tones.\n\nOur Coastal Cypress & Sea Fennel • collection is the creation of Senior Perfumer Carla Chabert. The daughter of world-renowned Master Perfumer Jacques Chabert. \n\nHer personal love affair with fragrance kicked off after she • attended a client’s house with her mother. This hugely resonated with her; remembering the scents, textures and perfume bottles of that particular meeting with deep affection.\nUsing a combination of Blue • Cypress Oil, Marine Notes and Cardamom to name but a few,\n\nCarla began crafting an uplifting, compelling fragrance which would • soon gain iconic status.\n\nJust 2 years on from the launch of our Coastal Cypress & Sea Fennel collection, we once again requested Carla’s expert nose, as we began the • journey to creating our very first\n\nCoastal Cypress & Sea Fennel Eaux de Parfum. Coastal, Venturesome and Unchartered\n\nFor Carla, the ingredient that was going to truly elevate our Coastal Cypress & Sea Fennel Eaux de Parfum was the noble Cardamom. Whilst Cardamom is not a new addition to this collection, a heavy overdose enhances the depth of the fragrance, highlighting the freshness on top to add strength and vibrancy. For Carla this overdose of Cardamom was an instinctive choice and one which truly elevates our Eaux de Parfum to a salt-sprayed collision of ingredients.", "5": "Collection: Orange & Bergamot Key Information; Description: Formally known as Orange Grove, Orange & Bergamot has been with us since our early days. Bask your senses in a warm Andalusian courtyard with our radiant citrus scent, filled with uplifting bergamot, blossoming neroli and warm musk. • Inspired by the spirit of Seville, this radiant fragrance uses every element of the city’s famous orange tree. From the bright citrus fruit, to the delicate Neroli flowers, and even the woody Petitgrain.\n\nMore than 14,000 bitter orange trees decorate the spanish streets and infuse Seville with the scent of their blossoms every spring.\n\nThese ornamental, bitter orange trees outnumber every other species of tree in the city.\n\nOriginally known as Orange • Grove, this collection has been at the heart of our portfolio since it was created by Michael Pickthall in 1984.\n\nOriginally launched as one of the • first luxury hand washes, Orange Grove saw instant success in hotels across the world.\n\nThe launch of our unforgettable • citrus fragrance was the true beginning of our hotel partnerships which, until this day, sees our products in 5* hotels across the globe.\n\nIn 2018 we partnered with Master Perfumer Beverley Bayne, a close friend of Michael Pickthall, to reinvent our Orange & Bergamot collection.\n\nOur aim was to modernise this fragrance with contemporary ingredients, whilst remaining true to Michael’s original vision.\n\nIn 2019 we once again sort Beverley’s creative expertise as we launched our very first collection of Eaux de Parfum.\n\nA courtyard of orange trees in dappled shade. Lively citrus airs dancing the flamenco at dawn. Azure blue skies above awaken your spirits with our modern classic, plucked from the naranja grove. Signature, Radiant and Unmistakable.", "6": "Collection: Signature Candle Category Sheet; Description: Our Scented Candles are made with high fragrance concentrations for an exceptional scent experience. Set the scene for an elegant ambience with out Signature Scented Candles.\n\nOur Signature Candles weigh 190g with a burn time of 30-40 hours.\n\nThey contain 10% fragrance oil which is blended within the wax when it is molten.\n\nThis ensures a steady aroma and a strong throw is released.\n\nOur Candles are made from a mineral wax called Paraffi n.\n\nThis wax is used as it holds colour and scent exceptionally well and ensures we are able to off er our candles as 100% Vegetarian.\n\nOur glass vessels take inspiration from our original glass amber bottles used in the Molton Brown Salon in 1971. The new vessel design in Mayfair Ebony, with a band of distinguishing colour, is timelessly chic.\n\nOur Siganture Candles are available in some of our most iconic collections: Orange & Bergamot, Delicious Rhubarb & Rose, Re-charge Black Pepper, Mesmerising Oudh Accord & Gold, Coastal Cypress & Sea Fennel, Intoxicating Davana Blossom and Lemon & Mandarin. ", "7": "Collection: Luxury Candle Category Sheet; Description: Our Scented Candles are made with high fragrance concentrations for an exceptional scent experience. Set the scene for an elegant ambience with out Luxury Scented Candles.\n\nOur Luxury Candles weigh 600g with a burn time of 60-70 hours.\n\nThey contain 10% fragrance oil which is blended throughout the wax rather than dipped. This ensures the fragrance is released throughout the entire burn time.\n\nBoth our Signature and Luxury Candles can be accompanied by a candle lid and wick trimmer to preserve the candle and ensure a clean, dust-free burn every time\n\nOur Ebony Mayfair Glass Vessels are timelessly chic and compliment any home décor.\n\nDesigned to be reused and recylced, our Candles are a forever keepsake.\n\nOur Luxury Candles are available in some of our most iconic collections: Orange & Bergamot, Recharge Black Pepper and Mesmerising Oudh Accord & Gold.", "8": "Collection: Hand Sanitiser Category Sheet; Description: Keep hands reassuringly cleansed on-the-go with luxury Hand Sanitiser Gels. Our non-drying gel formula kills 99.9% of bacteria and enveloped viruses. Made with 64.7% alcohol, they leave hands elegantly scented in our iconic fragrances.\n\nSimply apply 3ml (size of a\npea) to hands and massage\nin for 60 seconds for\nperfectly clean and sanitised\nhands.\n\nOur quick drying formular\nleaves hands feeling clean\nand refreshed with a\ndelicately scented aroma\nfrom 3 of our iconic\ncollections.\n\nSuitable for all skin types and\navailable in a handy 100ml\non the go size or choose a\n300ml for your bathroom or\nkitchen.\n\nThe perfect complementary\non the go sanitiser to\nmatch our other hand care\nproducts.\nAvailable in Orange &\nBergamot, Delicious\nRhubarb & Rose and\nCoastal Cypress & Sea\nFennel.", "9": "Collection: Hand Lotion Category Sheet; Description: Cleanse your hands with our decadent collection of hand washes before proceeding to nourish your skin with our revered hand lotion, packed with enriching ingredients to hydrate, soothe and protect.\n\nFirst harnessed in Ancient\nEgypt, Shea Butter is\nenriching yet light and is\na key ingredient in all our\nHand Lotions\n\nMoisturise, soothe and\nnourish, with the decadent\ncollection of delicately\nscented Hand Lotions.\n\nApply generously and\nexperience the lotion melting\ninto your hands for a silky\nsoft feel.\n", "10": "Collection: Hand Cream Category Sheet; Description: Graced with a symphony of exquisite notes, our creams deeply moisturise and scent hands. Discover our Alba White Truffl e hand treatment and exfoliator enriched with skin-boosting ingredients for long-lasting hydration.\n\nA sumptuously hydrating\nhand cream perfectly sized\nfor on- the-go use. Treat\nhands to an extra seal of\nmoisture and leave them\ndelicately fragranced.\n\nEach of our hand creams\nis enriched with White\nTruffl e Extract and provides\nmoisturisation, conditioning\nprotection and leave skin\nfeeling nourished.\n\nOur enriching hand creams\nare perfectly blended to\ninstantly moisturise and\ndelicately scent your skin.\n\nSubtly scented with our\niconic fragrances, our hand\ncreams add another layer\nto your fragrance, helping it\nlast longer", "11": "Collection: Fine Liquid Hand Wash Category Sheet; Description: Deeply cleanse and protect your hands with our decadent hand wash. Made in England with the fi nest ingredients, our liquid soaps scent hands with uplifting, refreshing and unmistakeably indulgent notes.\n\nOur hand washes and bath\n& shower gels are formulated\ndiff erently. Bath & shower\ngels are formulated with\nincreased lather ability\n\nOur hand washes contain\nfragrance oils of up to 3%.\nThey also contain skin\nconditioning ingredients\nlike Glycerine to keep hands\nfeeling moisturised.\n\nOur hand washes deeply\ncleanse and nourish and\nprotect your skin whilst\nleaving them smelling divine.", "12": "Collection: Eau de Toilette Category Sheet; Description: Open the doors to a world of fragrance with our Eaux de Toilette Collection, which includes woody, citrus, chypre, ambery, fl oral and aromatic scents for him and her.\n\nWe blend our Eaux de\nToilette with a combination\nof naturally extracted oils\nand synthetics. It can take\nseveral years and hundreds\nof ingredients before the\ndesired formula is created by\nthe perfumer through their\nexpertise. The overarching\ningredient can be found\nin the both the Eaux de\nToilette, Eaux de Parfum\nand other products in each\ncollection.\n\nOur Eaux de Toilette\ncollections contain up to\n10% fragrance oil.\n\nDesigned to be re-spritzed\nand refreshed throughout the\ncourse of the day or evening,\nour Eaux de Toilette last for\nup to 4 hours on the skin.\n\nDesigned by Vincent\nVilleger, our bottles are\ninspired by our heritage.\nEach Eaux de Toilette bottle\nhas a hue of colour at the\nbase to represent its unique\ncollection", "13": "Collection: Eau de Parfum Category Sheet; Description: Step inside an illuminating world of fragrance with citrus, woody, aromatic, ambery, fl oral and chypre Eaux de Parfum to truly suit your unique self.\n\nComposed by the world’s\nmost renowned perfumers.\nOur Eaux de Parfums\ncontain 20% fragrance oils\nwhich means they last up to\n8 hours on the skin.\n\nIn order to set each Eaux\nde Parfum apart from its\nEaux de Toilette & enrich its\nolfactive experience, every\nEaux de Parfum features a\n‘signature’ key note, which\nis either an overdose of the\none of the EDT ingredients\nor a completely new twist.\n\nEach new Eaux de Parfum\nbottle is topped by its own\nexquisite spherical stopper.\nCrafted in resin and inspired\nby glass marble, each\nfragrance is typifi ed by its\nown colourway. The domed\nform is a subtle nod to our\niconic Molton Brown Lens, a\nlong-standing design feature\non our bottles through the\nyears.\n\nDesigned by Vincent\nVilleger, our bottles are\ninspired by our heritage.\nThere is a nod to the 1970s,\nthe decade we were born\nwith the Mayfair Ebony\nglass – a direct reference to\nthe fi rst bottles used in the\nSouth Molton Street salon.\nThey exude confi dence,\nmake a statement and stand\nout from the crowd", "14": "Collection: Body Polisher Category Sheet; Description: Reveal your skin’s luminous radiance with our luxurious body scrubs\n\nEach of our body polishers\ncontain a unique exfoliating\ngrain that removes dead\nskin.\nPink Pepper uses bamboo\nstem particles, Eucalyptus\nuses sugar and Orange\n& Bergamot uses apricot\nkernel.\n\nExfoliation is an essential\npart of a skin care regime\nfor healthy looking skin.\nExfoliating 2-3 times a week\nensures you remove dead\nskin cells.\n\nRemoving dead skin cells\nhelps lotions and oils to be\nabsorbed fully into the skin\nand achieve that healthy\nlooking glow.\n\nBy adding one of our\nindulgent body polishers to\nyour pampering ritual you\nwill have exceptionally soft\nand beautifully scented skin.", "15": "Collection: Body Oil Category Sheet; Description: Infused with rich notes and the fi nest ingredients sourced from across the globe, our body and massage oils uncover divinely soft, moisturised skin with a luminous glow.\n\nOur Body Oils leave skin\nsatiny and luminous,\nwhereas our lotion delivers\na more matte moisturized\nlook.\nOur Body Oils allow for\nsensuous application and\nmassage, whereas our lotions\ndeliver quicker absorption\npost application.\n\nWe use Argan Oil in some\nof our Body Oils. Argan Oil\nis high in vitamin E and\nessential fatty acids that are\nknown to provide multiple\nconditioning and\nmoisturising benefi ts for the\nbody\n\nIndian Moringa Oil found\nin our Mesmerising Oudh\nAccord & Gold Body Oil is\nan essential oil. Moringa oil\nhelps in softening dry skin\nand maintaining moisture.\nArgan Oil can be found\nin our Flora Luminare\nBody Oil. It leaves skin\nfeeling touchably smooth\nand iridescently aglow.\nantimicrobial and antiinfl ammatory eff ects.\n\nWe use the Eaux de Toilette\nstructure to create the\nfragrances used within our\nluxurious Body Lotion. A\nharmonized blend of top,\nheart and base notes.", "16": "Collection: Body Lotion Category Sheet; Description: Our luxury body lotions leave your skin feeling nourished and moisturised following a relaxing bath or a quick yet luxurious shower.\n\nEnriched with fast-absorbing\noils, our lotions envelop\npost-bathing skin with\nsoft hydration, intensive\nnourishment and captivating\naromas.\n\nEach body lotion contains\nAbyssinian oil - Abyssinian\noil provides moisture to the\nskin. It can be applied to\nthe skin easily without the\nfeeling of greasiness.\n\nBy moisturising your skin\nwith a Body Lotion, prior to\nfragrance application, can\nhelp to intensify the scent\nand make it last longer.\n\nWe use the Eaux de Toilette\nstructure to create the\nfragrances used within our\nluxurious Body Lotion. A\nharmonized blend of top,\nheart and base notes.", "17": "Collection: Bathing Oil Category Sheet; Description: Unwind with our luxury bath oils, the perfect way to replenish skin, add a seal of extra moisture and relax the body and mind.\n\nOur voluptuously scented\nbath oils transform your\nbath into a milky elixir for\nan intensely pampered\nexperience.\n\nSignature essential oil to\nleave skin feeling silky-soft\nand delicately perfumed.\nOrange & Bergamot uses\nenergising neroli oil while\nHeavenly Gingerlily uses\nconditioning Argan Oil.\n\nNeroli Oil found within\nour Orange & Bergamot\nBathing oil is an essential\noil that helps to repair and\nrejuvenate skin.\nConditioning Argan Oil\nfound in our Heavenly\nGingerlily Bathing Oil\nleaves skin feeling beautifully\nnourished. \n\nWe use the Eaux de Toilette\nstructure to create the\nfragrances used within our\nluxurious Body Lotion. A\nharmonized blend of top,\nheart and base notes.", "18": "Collection: Bath & Shower Gel Category Sheet; Description: Made in England from the fi nest ingredients sourced from around the world.\n\nWe use the Eaux de Toilette\nstructure to create the\nfragrances used within our\nluxurious Bath & Shower\nGels. A harmonized blend of\ntop, heart and base notes.\n\nAll our Bath & Shower Gels\nare 100% Vegetarian.\nOur Bath & Shower Gels\nare paraben free. Parabens\nare preservatives that can be\nused in cosmetic products to\nprolong shelf-life.\n\nAt the luxury end ofthe\nmarket, the average\nfragrance oil level included\nin a Bath & Shower Gel is\njust 1%, however at Molton\nBrown, we triple that by\nadding 3% fragrance oil to\nour Bath & Shower Gels.", "19": "Collection: Aroma Reed Refill Category Sheet; Description: A number of our Aroma Reed Diff users are also available in a refi ll option to ensure we replenish and reuse time and time again.\n\nOur Aroma Reed Refi lls\ncome with 150ml of refi llable\noil and 8 new rattan reeds to\nensure the refi lled fragrance\nis being dispersed correctly.\nBy adding more reeds to the\ndiff user, the fragrance can be\nintensifi ed\n\nPositive luxury and\nsustainable practices have\nalways been at the heart of\neverything Molton Brown\ndo and our Aroma Reed\nRefi lls are an excellent way\nto continue this message.\n\nOur Aroma Reed Refi lls\nare available in our Iconic:\nOrange & Bergamot,\nDelicious Rhubarb & Rose\nand Re-charge Black Pepper.", "20": "Collection: Aroma Reed Category Sheet; Description: Envelop your home in a symphony of inviting scents with our Aroma Reed Diff users. A sophisticated décor statement, our carefully crafted aroma reeds fully absorb scented oils and provide a constant fl ow of elegant fragrance.\n\nOur Aroma Reed\ndiffi suers contain 150ml of\nwonderfully blended oils\nthat diff use perfectly around\na room.\nWe use up to 15% fragrance\noil that is based on the\nmatching Eau de Toilette\nstructure to ensure a subtle\nfragrance is emitted for up\nto 5 months.\n\nWe use rattan reeds to\nsoak up the scent and emit\nour iconic aromas. They\ndisperse the scent into the\nair naturally and due to its\nporous strucute, they help to\nprovide a controlled rate of\nfragrance release.\n\nOur Aroma Reed packaging\nis more sustainable than\never before. We use 50%\nrecycled paper materials to\ncraft the boxes that hold our\nDiff users.\nOur iconic glass vessel is also\nendlessly reusable, whether it\nbe through reusing as a small\nvase or refi lling with our\nrefi ll option. \n\nOur Aroma Reed Diff users\ncome in the iconic: Orange\n& Bergamot, Delicious\nRhubarb & Rose, Re-charge\nBlack Pepper, Intoxicating\nDavana Blossom and\nLemon & Mandarin", "21": "Collection: Vetiver & Grapefruit Collection Sheet; Description: Vetiver & Grapefruit Reinvigorating. Debonair. Timeless.\n\nThis award-winning scent conveys the tense collision of woody and\ncitrus notes. The contradiction of warm, Haitian vetiver and piercing\ngrapefruit makes a sophisticated and invigorating pairing, appealing\nto both masculine and feminine tastes. The Eau de Parfum was\ncreated by New Generation Perfumer Julie Pluchet, who chose dry\ncedarwood as the signature note for an intense woody sensation.\nCollection Launch – 2018\nEau de Parfum Launch – 2020\n\nFragrance Construction\nEau de Parfum\n\nSharp citrus top notes confront a spicy heart of nutmeg and uplifting lavender.\nEarthy Haitian vetiver and patchouli descend into a rich base.\n\nSIGNATURE\nCedarwood - Dry\nTOP\nGrapefruit - Sharp\nMandarin\nBlack Pepper\nCardamom\nHEART\nNutmeg - Spicy\nLavender\nGeranium\nSaffron\nBASE\nVetiver - Earthy\nPatchouli\nMoss\nAmber\n\nSIGNATURE NOTE Cedarwood\nWarm and dry cedarwood adds an extra, intense woody element\nto the fragrance, layering vetiver’s clean and earthy tones.\n\nFragrance Construction\nEau de Toilette\n\nPiercing grapefruit at the top is softened by a fresh rose and neroli heart. It fi nishes\nwith an earthy, enveloping base of vetiver, patchouli and cedarwood\n\nTOP \nGrapefruit - Piercing\nCardamom\nWhite Pepper\nHEART\nRose - Fresh\nNeroli\nLychee\nBASE \nVetiver - Earthy\nCedarwood\nAmber\n\nOVERARCHING NOTE Vetiver\nHaitian vetiver is lauded as the world’s most precious incarnation of this oil. Not only is it used for its elegant\naroma in perfumery, but its deep roots are harvested by local farmers to thatch roofs and prevent land erosion\n\nWhat Products Are Available In This Collection? \nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nDeodorant\n\nThe Ritual\n\nCLEANSE\nAwake your senses with a stimulating Bath & Shower Gel\nin the morning.\nHYDRATE\nFollow up with the complementing Body Lotion to keep\nskin moisturised for an active day.\nTREAT\nEnjoy a few spritzes of the Eau de Toilette for a refreshing yet classic\nfinish or choose the Eau de Parfum for a woodier accent. Pop the\nDeodorant spray in your bag to rejuvenate on-the-go.\n\nFragrance Family\n\nPRIMARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance\nfamilies in the world, citrus contains essential oils extracted\nfrom cold expression of fruit zest, such as lemon, bergamot,\norange and grapefruit.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\nPERSONALITY PROFILER - Discerning and smart\nVetiver & Grapefruit fans have a perceptive attitude that\nsets them apart. They have an active lifestyle that benefits\nbody and mind with a fondness for fresh fragrances.", "22": "Collection: Rosa Absolute Collection Sheet; Description: ROSA ABSOLUTE Voluptuous. Dramatic. Impassioned.\n\nA private dressing chamber, draped in deepest ruby velvet. Hushed,\ndark whispers unmasked sub rosa. The theatre of nightfall, a\npromise full of mystery. Devote your senses to an intoxicating secret.\nFRAGRANCE FAMILY - FLORAL ROSE\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Rose\nThe king of flowers, lemony fresh with various nuances of powder,\nwood notes or fruit, feminine, clean, intensely romantic.\n\nFragrance Construction\nBath & Body Collection\n\nBlackcurrant intermingles with raspberry, whilst pink peppercorn adds a hint of spice\nand its fl oral nuances pave the way to rose absolute.Geranium oil is fl oral and aromatic\nand is complemented by powdery notes of violet leaf. The base is deepened by indulgent\npatchouli, warm amber and incense hues from labdanum\n\nTOP\nBlackcurrant\nPink Pepper\nRaspberry\nHEART\nRose\nViolet Leaf\nGeranium\nBASE\nPatchouli\nLabdanum\nVanilla\n\nLONDON VIA LOMBARDIA\nThe lead ingredient, Italian rose oil, comes from Lombardia. The oil is taken from\nan intriguingly voluptuous, classic Italian red rose, extracted in its purest, most\nconcentrated form. Rosa Absolute is inspired by the ancient Italian tradition of sub\nrosa. Signifying secrecy, roses were painted on the ceilings of banquet rooms as a\nreminder that words spoken in the room should remain confidential.\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nFRAGRANCE\nEau de Parfum\nEau de Toilette\nEau de Toilette 50ml\n\nCore Alternative\nFRAGRANCE\nEau de Parfum\nEau de Toilette\nEau de Toilette 50ml\nDELICIOUS RHUBARB & ROSE\nRhubarb, grapefruit essential oil and citrusy litsea cubea have metallic\ntop notes.\nRose in the heart also has metallic accents; the coolness is tinged with the\ntartness of rhubarb in the top note.\nSweet vanilla and candy fl oss soften the tart coolness for a sweet,\ncomforting ending.", "23": "Collection: Inspiring Wild Indigo Collection Sheet; Description: WILD INDIGO Botanical. Inspiring. Restorative.\n\nA glimpse of ancient spires through tall trees. Hidden in nature’s\nsanctuary, hazy watercolours of flora bloom. Wild indigo bows\nbeneath a meditative monsoon. Discover a bouquet of warm aromas\nblossoming in south Indian woods.\nFRAGRANCE FAMILY - FLORAL FRUITY\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily, lily of\nthe valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Fruity\nDelicious, fruity notes such as raspberry, peach, lychee,\napple and strawberries.\n\nFragrance Construction\nBath & Body Collection\n\nBlended with clary sage, gardenia and wild indigo seed for a\nrejuvenating, fl oral scent\n\nTOP\nCardamom\nPassion Fruit\nPeach\n\nHEART\nGardenia\nLily of the Valley\nRose\n\nBASE\nMusk\nOrris\nOudh\n\nLONDON VIA TAMIL NADU\nTehphrosia purpurea is commonly known as ‘Wild Indigo’. Wild Indigo is native\nto India and is known to grow in the state of Tamil Nadu.\nWild Indigo has been described as one of the most important herbs in Ayurveda,\nthe Indian traditional system of medicine, as it is considered to be able to heal all\ntypes of wounds.\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nCore Alternative\nDELICIOUS RHUBARB & ROSE\nRhubarb, grapefruit essential oil and citrusy litsea cubea have metallic\ntop notes.\nRose in the heart also has metallic accents; the coolness is tinged with the\ntartness of rhubarb in the top note.\nSweet vanilla and candy fl oss soften the tart coolness for a sweet,\ncomforting ending.", "24": "Collection: Invigorating Suma Ginseng Collection Sheet; Description: SUMA GINSENG Energetic. Intrepid. Invigorative.\nThe heart of the Paraná jungle, alive with the resounding calls of\nwildlife. A wooden canoe tied to the rushing river bank. Bushels of\ntwisted, light-golden ginseng roots in woven baskets. Embark on an\nexpedition into a rare, untouched world.\nFRAGRANCE FAMILY - AROMATIC WOODY\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\n\nFragrance Construction\nBath & Body Collection\nStimulating Brazilian suma ginseng is joined by juniper berry, cinnamon, oakmoss,\narmoise and geranium to revitalise the senses, leaving you refreshed and full of\nenergy\n\nTOP\nLemon\nBergamot\nGalbanum\n\nHEART\nJuniper Berry\nCinnamon\nGeranium\n\nBASE\nPatchouli\nCedar Leaf\nAmber\n\nLONDON VIA BRAZIL\nSuma (Hebanthe eriantha,) commonly referred to as Brazilian ginseng, is a species\nof plant in the Amaranthaceae family. The root of the suma plant is commonly\nused to make medicine.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Toilette 50ml\nEau de Toilette 100ml (Old Pack)\n\nBATH\nBath & Shower Gel\nBody Lotion\n\nCore Alternative\nDELICIOUS RHUBARB & ROSE\nRhubarb, grapefruit essential oil and citrusy litsea cubea have metallic\ntop notes.\nRose in the heart also has metallic accents; the coolness is tinged with the\ntartness of rhubarb in the top note.\nSweet vanilla and candy fl oss soften the tart coolness for a sweet,\ncomforting ending.", "25": "Collection: Sensual Hanaleni Collection Sheet; Description: SENSUAL HANALENI Sensual. Blooming. Paradisal\nThe secluded crescent of creamy sands sweeps into magnificent jade\nmountains. Deeply flushed pink blooms lavish the quilted valley.\nCascading waterfalls pour into a bountiful paradise. Sensually sway\nin the perfumed sunset of the Orchid Isles.\nFRAGRANCE FAMILY - AMBERY FLORAL\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances are\noriginally built around raw materials such as ambergris and musk,\ncombined with woody, tobacco, spicy and marine facets. With access\nto synthetic ingredients, contemporary ambery perfumes are softer,\nusually featuring vanilla, labdanum, cinnamon, pepper or oudh\naccord.\nSECONDARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\n\nFragrance Construction\nBath & Body Collection\nA refreshing and enchanting aroma to awaken the senses. Wear a\nwonderfully delicate scent on the skin and start your day with a smile on \n\nTOP\nMandarin\nBergamot\nCinnamon\n\nHEART\nRose\nLily of the Valley\nOrange Blossom\n\nBASE\nIncense\nPatchouli\nSandalwood\n\nLONDON VIA TAMIL NADU\nInspired by the Hanalei orchid, a hybrid created in Hawaii, “Hanalei“, meaning\n‘crescent shaped’, is the name of the northern part of the island of Kauai, and a\nvalley in this area which is the home of the Hanalei National Wildlife Refuge.\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nCore Alternative\nHEAVENLY GINGERLILY\nA transparent aquatic opening is intensifi ed with spicy cardamom and\nginger.\nIn the heart, tagete reinforces the fruit facet of tuberose, entwining the\nfl oral elements of white lily and jasmine.\nThe soft creaminess of the white fl ower radiates in the base with\nsandalwood and musks. \n\n", "26": "Collection: Puritas Collection Sheet; Description: Puritas Bracing. Ethereal. Pure.\nLava cliffs loom over endless pillowy heaths of delicate, springgreen Icelandic moss. A curtain of emerald light ripples across\nnortherly expansive skies. Roiling clouds of steam erupt over\nthe cyan Blue Lagoon. Purely awaken your skin with the surreal\nmists of the Reykjanes peninsula.\nFRAGRANCE FAMILY - GREEN FLORAL\nPRIMARY FRAGRANCE FAMILY - Green\nScents with fresh, leafy facets typically found in green floral\nnotes such as lily of the valley or fig leaves.\nSECONDARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume\nhistory. As its name implies, flowers take centre stage to create\na fragrant bouquet with blossoms such as rose, jasmine, violet,\niris, lily, lily of the valley, narcissus or tuberose.\n\nFragrance Construction\nFine Liquid Hand Wash\n\nPurifying Icelandic moss extract with refreshing citrus notes and embracing herby aromas\nadds a revitalising touch.\nTOP\nNarcissus\nJuniper Berry\nGalbanum\n\nHEART\nLily of the Valley\nJasmine\nGeen Bouquet Leaves\n\nBASE\nLilac\nCyclamen\nCypress\n\nLONDON VIA REYKJANES\nIceland moss is a lichen whose erect or upright, leaf-like habit gives it the appearance of\na moss. The Blue Lagoon geothermal spa is one of the most visited attractions in Iceland.\nThe spa is located in a lava fi eld in Grindavík on the Reykjanes Peninsula, south western\nIceland.\n\nWhat Products Are Available In This Collection?\nHAND\nFine Liquid Hand Wash\n\nCore Alternative\nHEAVENLY GINGERLILY\nA transparent aquatic opening is intensifi ed with spicy cardamom\nand ginger. In the heart, tagete reinforces the fruit facet of tuberose,\nentwining the fl oral elements of white lily and jasmine.\nThe soft creaminess of the white fl ower radiates in the base with\nsandalwood and musks. ", "27": "Collection: Pettigree Dew Collection Sheet; Description: PETTIGREE DEW Crisp. Delicate. Uplifting.\nEarly spring freshly awakens dew-capped, grassy glades. Droplets\nof light rain fall on a flourishing collage of roaming shrubs. Fluted\nstems of spine-tipped shoots curve tiny pastel-green petals. Amble\nthrough the lush, budding acreage of the New Forest.\nFRAGRANCE FAMILY - GREEN WOODY\nPRIMARY FRAGRANCE FAMILY - Green\nScents with fresh, leafy facets typically found in green floral notes\nsuch as lily of the valley or fig leaves.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\n\nFragrance Construction\nThe Hand Collection\nBlended with cleansing pettigree extract, sunny lemon oil and fresh lily\nof the valley and vetiver for an uplifting, fresh but green scent. \n\nTOP\nPetitgrain\nLemon\nLentisque\n\nHEART\nPeach\nLily of the Valley\nJasmine\n\nBASE\nMusk\nAmbergris\nCedarwoodLONDON VIA HAMPSHIRE\nAlso know as butcher’s broom, Pettigree is found in woodland area and is a\nmember of the lily family. Even its “leaves” are not leaves at all. The true leaves\nare just papery scales on the stem. What appear to be leaves are really flattened\nside shoots that broaden out to look like them, and it’s from the middle of these\nthat a single, greenish flower forms, not much bigger than a match head. \n\nWhat Products Are Available In This Collection?\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nCore Alternative\nREFINED WHITE MULBERRY\nGreen and aromatic facets take the lead with fresh basil.\nClary sage and green tea strengthen the green notes in the heart.\nThyme and musk fuse to enhance the aromatic elements, whilst leaving a\nlasting clean impression.", "28": "Collection: Lemon & Mandarin Collection Sheet; Description: Lemon & Mandarin Carefree. Sun-kissed. Sublime.\nStonewalled terraces cling to the cliffside stairs of sapphire sea.\nDimpled, sun-bleached lemons hang beneath a parasol of rustling\ngreen leaves. White yachts moored in the sparkling harbour. Let\nyour senses blithely trail on a warm Mediterranean breeze.\nFRAGRANCE FAMILY - CITRUS FRUITY\nPRIMARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance families\nin the world, citrus contains essential oils extracted from cold\nexpression of fruit zest, such as lemon, bergamot, orange and\ngrapefruit.\nSECONDARY FRAGRANCE FAMILY - Fruity\nDelicious, fruity notes such as raspberry, peach, lychee,\napple and strawberries.\n\nFragrance Construction\nThe Hand Collection\nBlended with bright mandarin and Italian lemon oils balanced with\nluscious fi g leaf and cedarwood for a natural sophisticated scent.\n\nTOP\nMandarin\nBergamot\nLemon\n\nHEART\nFig\nSage\nOrange Flower\n\nBASE\nVetiver\nMusk\nCedar\n\nLONDON VIA THE AMALFI COAST\nThe lemon cultivation of this area is the oldest in the whole of Italy.\nIt has a remarkable scenic value, and much of the tourist appeal is due to the evergreen\ncascades of trees that descend, terrace by terrace, to the sea. Limone Costa d’Amalfi PGI\nLemons are a product with very refi ned and renowned characteristics: the skin is of medium\nthickness, with a particularly pale yellow colour, and has an intense aroma and fragrance,\nthanks to its wealth of essential oils and terpenes. \n\nWhat Products Are Available In This Collection?\nHOME\nSignature Candle\nAroma Reeds\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nCore Alternative\nORANGE & BERGAMOT\nThe freshness of naturally sweet and bitter orange drifts into colognelike bergamot and mandarin. In the heart, neroli from orange blossoms\nradiate warmth.Soft musk and creamy ylang-ylang in the base add depth\nand smoothness.\n", "29": "Collection: Flame Tree & Pimento Collection Sheet; Description: FLAME TREE & PIMENTO Blazing. Deep. Impassioned.\nA coastal rainforest, dense with branches abundant in vivid, scarlet\nbells. Humid mist swells through the high place near the sea. The\ndistant echo of warm raindrops, bound for a pimento-spiced terrain.\nSet your spirits alight with the intense flame tree.\nFRAGRANCE FAMILY - WOODY AROMATIC\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family are\nusually sandalwood, cedarwood, patchouli and vetiver.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.\n\nFragrance Construction\nBath & Shower Gel\nInvigorating pimento, liquorice and tobacco captivate the senses whilst\nfl ame tree extract refreshes and revitalises.\n\nTOP\nPimento\nMandarin\nViolet Leaf\n\nHEART\nBlack Pepper\nLiquorice\nNutmeg\n\nBASE\nAustralian Flame Tree\nTobacco\nCedarwood\n\nLONDON VIA ILLAWARRA\nBrachychiton acerifolius is commonly known as the Illawarra Flame Tree. The\nFlame Tree is native to the east coast of Australia. The Illawarra Flame Tree is\nwidespread in subtropical rainforest on the coast to the escarpment, north from\nthe Shoalhaven River into Queensland. It is a popular street tree; it is famous for\nthe bright scarlet-red bell-shaped flowers that often cover the whole tree when it is\nleafless.\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\n\nCore Alternative\nTOBACCO ABSOLUTE\nCitrusy grapefruit lifts the fragrance in the top note.\nRosewood, with its dual citrus and woody character, ties together the\nfresh, zesty top and the rich, woody base.\nThe base is enriched by cedarwood, Peru balsam and smoky leather\naccord. ", "30": "Collection: Cardamom & Cedarwood Collection Sheet; Description: CARDAMOM & CEDARWOOD Spiced. Verdant. Seasoned.\nThe river valley vibrates with a current of freshly crushed\ncardamom. Resinous woods anchor the furrowed summits. A mound\nof freshly picked pods dry under a hot sun. Gather the harvest of\nGuatemala’s green gold.\nFRAGRANCE FAMILY - GREEN SPICY\nPRIMARY FRAGRANCE FAMILY - Green\nScents with fresh, leafy facets typically found in green floral notes\nsuch as lily of the valley or fig leaves.\nSECONDARY FRAGRANCE FAMILY - Spicy\nSpotlights spices such as cardamom, pink or black pepper,\nginger, nutmeg, cumin and clove to enhance the originality\nand character of the fragrance.\n\nFragrance Construction\nBath & Body Collection\nBlended with Guatemalan cardamon, fresh bergamot, black peppercorn and\nresinous cedarwood.\n\nTOP\nBergamot\nJuniper\nPink Pepper\n\nHEART\nCardamom\nCinnamon\nBlack Pepper\n\nBASE\nCedarwood\nSandalwood\nMusk\n\nLONDON VIA THE POLOCHIC VALLEY\nInspired by Guatemala, the world’s leading exporter of Cardamom.\nCardamom is a native of India and was introduced to Guatemala as a potential\nexport crop in 1914. Since then, Guatemala has become the world’s leading\nexporter of Cardamom. The spice is also known as the ‘Green Gold of\nGuatemala’.\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nCore Alternative\nRE-CHARGE BLACK PEPPER\nThe opening note of black pepper is enhanced by ginger, bringing spice\nand citrus to life, reinforced by lemon.\nThe heart strengthens the spice, thanks to coriander and basil displaying\nboth spicy anise and aromatic aspects, linking to the violet leaves’\ntonalities.\nVetiver intermingles with the citrus elements on top, along with the\naromatic heart, and adds an enduring trail of wood and earthy tones", "31": "Collection: Bushukan Collection Sheet; Description: BUSHUKAN Luminous. Inspiriting. Charismatic.\nA secluded mountain retreat of sun-warmed, earthen tǔlóu. Golden\nlight arcs across sparkling waters, bamboo rafts sailing leisurely by.\nA single brass gong resonates in the air. Embody the soul of infinite\noptimism.\nFRAGRANCE FAMILY - CITRUS AROMATIC\nPRIMARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance families\nin the world, citrus contains essential oils extracted from cold\nexpression of fruit zest, such as lemon, bergamot, orange and\ngrapefruit.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.\n\nFragrance Construction\nBath & Shower Gel\nA fresh, sparkling top note with bushukan and elemi. The aromatic freshness\non top is lifted by bergamot, clary sage and thyme. Woodiness in the body\nenhances vetiver and tolu with patchouli.\n\nTOP\nBushukan\nLemon\nBergamot\n\nHEART\nThyme\nCedarwood\nBlack Pepper\n\nBASE\nVetiver\nTolu\nPatchouli\n\nLONDON VIA FUJIAN\nEthereal, citrine light shards enliven the stone temples of Quanzhõu. Bamboo\nrafts float nonchalantly along the maritime silk road. Resinous, nutty aromas drift\nfrom the coveted cargo. Lose yourself in a haven of natural solace and spiritual\nenlightenment. \n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nDeodorant Stick\n\nFRAGRANCE\nEau de Parfum\nEau de Toilette\nEau de Toilette 50ml\n\nCore Alternative\nRE-CHARGE BLACK PEPPER\nThe opening note of black pepper is enhanced by ginger, bringing spice\nand citrus to life, reinforced by lemon.\nThe heart strengthens the spice, thanks to coriander and basil displaying\nboth spicy anise and aromatic aspects, linking to the violet leaves’\ntonalities.\nVetiver intermingles with the citrus elements on top, along with the\naromatic heart, and adds an enduring trail of wood and earthy tones.", "32": "Collection: Blue Maquis Collection Sheet; Description: Blue Maquis Wild. Herbaceous. Aromatic.\nBrilliant blue waves lap against The Scented Isle’s jagged shore. Young, eager\nroots twist and turn from sand to stone. A tapestry of wild herbs and flowers\nclimbs crooked peaks. Refresh your senses with the restorative scent of the\nmaquis shrub land.\nFRAGRANCE FAMILY - AROMATIC WOODY\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint, lavender,\nrosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\n\nFragrance Construction\nThe Hand Collection\nElegant and aromatic lavender with spicy, warm ginger,\njoins fresh, herby aromas of rosemary and oakmoss.\n\nTOP\nLavender\nCypress\nGinger\n\nHEART\nRosemary\nThyme\nJasmine\n\nBASE\nLabdanum\nSandalwood\nVanilla\n\nLONDON VIA CORSICA\nThe vegetation Corsica is best known for the maquis, a thick scrub of oak, juniper, thorn,\nheather and wild herbs and fl owers which grow up to 20 feet high in some places and covers\nnearly half of the island, lending to its distinct lemony, peppery, musky perfume.\n\n\nWhat Products Are Available In This Collection?\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nCore Alternative\nCOASTAL CYPRESS & SEA FENNEL\nThe fragrance opens with clean, invigorating notes of salty sea breeze,\ncomplemented by bergamot and cardamom.\nIn the heart, transparent jasmine and aromatic aspects mingle with\ncypress needles to create a strong signature.\nThe heart is intensifi ed by frankincense and the base’s woody nuances of\nblue cypress layered with cedarwood and vetiver.\n", "33": "Collection: Intoxicating Davana Blossom Collection Sheet; Description: DAVANA BLOSSOM Intoxicating. Dreamlike. Entrancing.\nThe silent Village of Lakes glistens under an Indian summer’s dusky,\npink skies. Clusters of heady davana rise above the edge of the\ncurved lake. A soft reflection moves across still water. Entrance your\nsenses in an intoxicating dreamscape.\nFRAGRANCE FAMILY - FLORAL FRUITY\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Fruity\nDelicious, fruity notes such as raspberry, peach, lychee, apple and\nstrawberries.\n\nFragrance Construction\nBath & Body Collection\nBlended with bergamot, zesty orange and neroli this captivating collection\nevokes a dreamlike trance.\n\nTOP\nDavana\nNeroli\nBergamot\n\nHEART\nJasmine\nBroom\nOrange Blossom\n\nBASE\nOrris\nTolu\nMusk\n\nLONDON VIA KARNATAKA\nDavana is an example of a short-duration plant grown during rabi, sown in winter\naround mid November and harvested in the spring (April).\nThere is a district in Karnataka called Davanagere, derived from ‘Davana-kere’\nmeaning ‘Village of Lakes’ in Kannada.\n\nWhat Products Are Available In This Collection?\nHOME\nSignature Candle\nAroma Reeds\n\nBATH\nBath & Shower Gel\nBody Lotion\n\nCore Alternative\nSUEDE ORRIS\nThe top opens with notes of mandarin and elemi for a subtle, fresh\ncitrus lift.\nSoft yet beautifully deep, precious, powdery orris absolute in the heart\nglides into fl oral jasmine and rose absolutes.\nCreamy cedarwood leads in the base. Labdanum and patchouli exude\nwoody-musk notes for a long-lasting fragrance.", "34": "Collection: Amber Cocoon Collection Sheet; Description: Amber Cocoon Warm. Golden. Cocooning\nThe northern shoreline, trimmed with an abundant forest of pines.\nShards of burnished, golden resin, nestled in glistening sands.\nSoft, glowing warmth from the evening setting sun.\nCocoon your senses with the rich treasures of the Amber Coast.\nFRAGRANCE FAMILY - AMBERY AROMATIC\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious,ambery fragrances\nare originally built around raw materials such as ambergris\nand musk, combined with woody, tobacco, spicy and marine\nfacets. With access to synthetic ingredients, contemporary\namberyperfumes are softer, usually featuring vanilla,\nlabdanum, cinnamon, pepper or oudh accord.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.\n\nFragrance Construction\nThe Hand Collection\nA cocooning, decadent scent, bringing the rich treasures\nof the Amber Coast to your master bathroom.\n\nTOP\nOrange\nLitsea Cubeba\nRosemary\n\nHEART\nOrris\nGuaiac Wood\nLavadin\n\nBASE\nVetiver\nPine\nCistus\n\nLONDON VIA THE BALTIC\nFormed over 45 million years ago, Baltic amber is an organic substance, a “fossil resin”,\nproduced by pine trees which grow in the southern regions of present day Scandinavia and\nthe nearby regions of the bed of the Baltic Sea. Throughout the past 5,000 years, most of\nthe amber in the world has come from the Baltic region.\n\nWhat Products Are Available In This Collection?\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nCore Alternative\nMESMERISING OUDH ACCORD & GOLD\nCitrusy bergamot notes weave between the spice of cinnamon and\nnutmeg. In the heart, the elemi extract is both citrusy and spicy, whilst\nmyrrh enhances the balsamic aspects and adds sweet vanilla like accents.\nTobacco intermingles with vetiver’s woody and earthy aspects, melting\ninto the honey accord.", "35": "Collection: Geranium Nefertum Collection Sheet; Description: Geranium Nefertum Androgynous. Unconventional. Mystifying\n\nCreated by Senior Perfumer Carla Chabert, Geranium Nefertum\ntakes its name from Nefertum, the androgynous Egyptian god of\nperfume. This fragrance is an unconventional and curious spin on\na chypre fragrance. We’ve sourced an unfamiliar type of geranium\nfrom the Nile Delta. Instead of the common rose-like geranium,\nthis is an extract with minty, green facets for a genderless note.\nMystifying and alluring, this sophisticated fragrance appeals to those\nwho dare to be their true selves.\nLaunched in 2019\n\nFragrance Construction\nEau de Parfum\nLuscious top notes of fi g leaf and zesty bergamot at the top wrap around a heart of\ngeranium extract and jasmine. It trails ambiguously with serene sandalwood in the base.\n\nSIGNATURE\nOakmoss - Sensual\n\nTOP\nFig Leaf Accord - Luscious\nBergamot\n\nHAERT\nGeranium Extract - Evocative\nJasmine\n\nBASE\nSandalwood - Serene\nLabdanum\nCedarwood\nOsmanthus\n\nSIGNATURE NOTE Oakmoss\nSynonymous with the chypre fragrance family, oakmoss has earthy, leathery accords that anchor\nthe scent beautifully. It brings hidden depth and a robust twist to the ambiguous fragrance.\n\nFragrance Construction\nEau de Toilette\nGreen notes of fi g leaf and bergamot at the top is crowned with minty geranium and\njasmine in the heart. Resinous labdanum and oakmoss trail mysteriously in the base.\n\nTOP\nFig Leaf Accord - Green\nBergamot\n\nHEART\nGeranium - Minty\nJasmine\n\nBASE\nLabdanum - Resinous\nOakmoss Accord\nSandalwood\n\nOVERARCHING NOTE Geranium\nSourced from the Nile Delta this unpredictable, minty rose\ngeranium blurs the lines between femininity and masculinity.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nDeodorant\n\nThe Ritual\nCLEANSE\nStart the day with a crisp, balanced shower with the Bath & Shower Gel.\nHYDRATE\nNurture skin and deepen the enigmatic scent trail with the matching\nBody Lotion.\nTREAT\nFinish with a few spritzes of the Eau de Toilette for mysterious allure\nor choose the Eau de Parfum for a more sophisticated complexity.\nKeep the Deodorant spray on hand to refresh and revive on-the-go.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Chypre\nTaking the name after Francois Coty’s iconic perfume in 1917,\nchypre fragrances are built around an accord of oakmoss, ciste\nlabdanum and bergamot. Complex and sophisticated, they’re\nreminiscent of undergrowth and the humidity often associated\nwith autumn.\nSECONDARY FRAGRANCE FAMILY - Green\nScents with fresh, leafy facets typically found in green\nfloral notes such as lily of the valley or fig leaves.\nPERSONALITY PROFILER - Insightful and organised\nGeranium Nefertum wearers are inventive clear thinkers\nwho admire minimalism and a broad outlook in life.\nThey love fragrances that are balanced, crisp and\nhave contemporary freshness.\n", "36": "Collection: Tobacco Absolute Collection Sheet; Description: Tobacco Absolute Profound. Earthy. Cultivated.\nCreated by New Generation Perfumer Elsa Chabert, Tobacco\nAbsolute is a smouldering collision of contemporary citrus, rich\nwoods and warming tobacco. This woody-ambery fragrance\nwas inspired by the pioneering British botanical discovery of the\ntobacco plant in eighteenth century South America. Exploring the\nrich nuances of cured, dry tobacco leaf, this classic has an assured\ntimeless quality that attracts refined personalities.\nCollection Launch – 2015\nEau de Parfum Launch – 2019\n\nFragrance Construction\nEau de Parfum\nEnlivening bergamot and ginger top notes meet a robust heart of smoky tobacco. Sensual\nPeruvian balsam wraps around woody patchouli in the intense, resinous base.\nSIGNATURE\nNutmeg - Distinguished \n\nTOP\nGinger - Enigmatic\nBergamot\nWine accords\n\nHEART\nTobacco - Cloudy\nCedarwood\nViolet\nOrris\n\nBASE\nPeruvian balsam - Intense\nPatchouli\n\nSIGNATURE NOTE Nutmeg\nNutmeg shares the same warm accords as the Eau de Toilette\nbut elevates it to decisively spicier, more piquant heights.\n\nFragrance Construction\nEau de Toilette\nSpicy-citrus elemi and grapefruit top notes are enriched with profound\ncedarwood. The base has a distinguished trail of tobacco and leather.\n\nTOP\nElemi - Spicy-citrus\nBergamot\nGrapefruit\n\nHEART\nCedarwood - Profound\nNutmeg\nRosewood\n\nBASE\nTobacco - Warming\nLeather\nPeruvian Balsam\n\nOVERARCHING NOTE Tobacco\nParaguayan tobacco intensifi es this mature infusion to evoke a feeling\nof warmth with nuances of elegance and refi nement.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nDeodorant\n\nThe Ritual\nCLEANSE\nStart your day with the Bath & Shower Gel to warm the senses.\nTREAT\nFinish with a few spritzes of the Eau de Toilette or choose the Eau\nde Parfum for richer, smouldering impact. Take the travel-friendly\nDeodorant for post-gym or on-the-go use\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\nSECONDARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances\nare originally built around raw materials such as ambergris and\nmusk, combined with woody, tobacco, spicy and marine facets.\nPERSONALITY PROFILER - Particular and resolute\nTobacco Absolute wearers are considered connoisseurs who\nvalue timeless quality. They’re drawn to fragrances that are\nwoody, earthy and express their intellectual complexity.", "37": "Collection: Seabourn Collection Sheet; Description: The Seabourn Collection\nThis exclusive collection is our collaboration with Seabourn, an awardwinning luxury cruise line. Seabourn is famed for their intimate small\nships that drop anchor at the most secluded ports beyond the reach of\nlarger vessels. Our two fragrances, Immersive Samphire & Eucalyptus\nand Inspiring Basil & Vetiver, are made with ingredients inspired by the\ncruise line’s very own signature destinations. Celebrated British coastbased illustrator Angela McKay has hand drawn the fragrance’s botanical\ningredients on the bottles, adding a tailored, elegant touch.\nLaunched in 2017\n\nThe Fragrance\nImmersive Samphire & Eucalyptus\nFresh samphire is uplifted by deeply enlivening eucalyptus. Sophisticated cardamom and\ncedarwood create a balancing base.\n\nTOP\nCardamom\nBergamot\nMint\nPetitgrain\n\nHEART\nEucalyptus\nFreesia\nViolet\nMarine Notes\n\nBASE\nSamphire\nCedarwood\nMusk\nLabdanum\n\nThe Fragrance\nInspiring Basil & Vetiver\nFresh mandarin is enriched with rejuvenating basil oil and cardamom. The base is refined\nwith vetiver and musky woods. \n\nTOP\nMandarin\nBergamot\nPetitgrain\n\nHEART\nBasil\nCardamom\nMace\n\nBASE\nVetiver\nCedarwood\nMusk\n\nWhat Products Are Available In This Collection?\nImmersive Samphire\n& Eucalyptus\nBath & Shower Gel\nBody Lotion\n\nInspiring Basil\n& Vetiver\nShampoo\nConditioner\n\nFragrance Family\nImmersive Samphire & Eucalyptus\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetivert.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually\nmint, lavender, rosemary, sage, eucalyptus or thyme.\n\nFragrance Family\nInspiring Basil & Vetiver\nPRIMARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance families\nin the world, citrus contains essential oils extracted from cold\nexpression of fruit zest, such as lemon, bergamot, orange and\ngrapefruit.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually\nmint, lavender, rosemary, sage, eucalyptus or thyme.", "38": "Collection: The 1971 Collection Sheet; Description: The 1971 Collection\nThis collection honours our founding year and proud legacy as smallscale English artisans curating the best natural ingredients. We delved into our archives to inspire its one-of-a-kind design. The monochromatic, apothecary-style bottles are a nod to our past practice of pouring mixtures into amber glass vessels for enhanced UV protection. We reinvented the ‘MB’ monogram from some of our earlier products, lending a strong visual presence and symbol of effortless unity to this collection. All finished with a twist of the distinctive, ribbed black cap. A beautifully simple design that honours our heritage with a sense of the minimalist contemporary.\n\nThe Fragrance\nMandarin & Clary Sage\nAn enlivening fragrance of refreshing mandarin peel extract and balancing clary sage fl ower to energise the senses and restore wellbeing.\n\nTOP\nMandarin\nBergamot\nLemon\n\nHEART\nFig\nSage\nOrange Flower\n\nBASE\nVetiver\nMusk\nCedar\n\nWhat Products Are Available In This Collection?\nHand & Body Wash\nHair & Body Wash\nHand & Body Lotion\nConditioner\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Citrus Fresh, zesty and sparkling. As one of the oldest fragrance families in the world, citrus contains essential oils extracted from cold expression of fruit zest, such as lemon, bergamot, orange and grapefruit. SECONDARY FRAGRANCE FAMILY - Green Scents with fresh, leafy facets typically found in green floral notes such as lily of the valley or fig leaves.", "39": "Collection: Suede Orris Collection Sheet; Description: Suede Orris Ethereal. Powdered. Sensuous.\nCreated by New Generation Perfumer Jérôme Di Marino,\nSuede Orris is a modern celebration of Florentine precious\nperfumery. Always one to put a modern twist on fragrance\nfrom the past, Jérôme was inspired by Italian noblewoman,\nCatherine de Medici, and her courtly fashion of scenting gloves\nwith orris. This soft yet standout powdery fragrance was part\nof his private collection with Tuscan orris, jasmine absolute\nand cedarwood – perfect for quietly confident personalities.\nLaunched in 2019\n\nFragrance Construction\nEau de Parfum\nVivid mandarin top notes give way to an intense fl oral heart of powdered orris, rose and\njasmine absolutes. The trail succumbs to a smoky-woody base of suede accord and benzoin.\n\nSIGNATURE\nVanilla - Smoky\n\nTOP\nMandarin - Vivid\nBlack Pepper\nOlibanum\n\nHEART\nOrris Absolute - Powdered\nRose Absolute\nJasmine Absolute\n\nBASE\nSuede Accord - Sumptuous\nBenzoin\nCistus Labdanum Absolute\n\nSIGNATURE NOTE Vanilla CO2\nAn extremely pure incarnation of the plant extract obtained via a highly effi cient and sophisticated\nextraction process, similar to the crafting of diamonds. Its smoky undertones amplify the warmth\nof suede yet at the same time, its amber facets enrich Tuscan orris.\n\nFragrance Construction\nEau de Toilette\nFresh citrus top notes are woven with an intimate bouquet of ethereal Tuscan orris,\nrose and jasmine absolutes. The base is deepened by a caressing cedarwood trail.\n\nTOP\nMandarin - Fresh\nOlibanum\nElemi \n\nHEART\nTuscan Orris - Powdery\nRose Absolute\nJasmine Absolute\n\nBASE\nCedarwood - Caressing\nCistus Labdanum\nPatchouli\n\nOVERARCHING NOTE Tuscan Orris\nOrris is the root of the sweet iris fl ower. The root is harvested\nand left to dry, giving an earthy, powdery eff ect to a fragrance.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\nHair Mist\n\nBODY\nBath & Shower Gel\nBody Lotion\nEnveloping Bathing Oil\nEnveloping Body Oil\n\nThe Ritual\nCLEANSE\nHave a morning shower or evening bath fit for royalty\nwith the Bath & Shower Gel; pour a few drops of the\nEnveloping Bathing Oil to leave skin feeling silky-soft.\nHYDRATE\nMoisturise with the Body Lotion or deeply hydrate\nwith the Enveloping Body Oil, enriched with argan\noil, for a luminous glow.\nTREAT\nFinish with a few spritzes of the Eau de Toilette for\nan ethereal trail or choose the Eau de Parfum for\ndarker, more sensuous evening wear. Veil hair with\nour Hair Mist for added graceful, powdery notes.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Chypre\nTaking the name after Francois Coty’s iconic perfume in 1917,\nchypre fragrances are built around an accord of oakmoss, ciste\nlabdanum and bergamot. Complex and sophisticated, they’re\nreminiscent of undergrowth and the humidity often associated\nwith autumn.\nSECONDARY FRAGRANCE FAMILY - Powdery\nScents that feature a floral powdery facet such as iris or mimosa.\nPERSONALITY PROFILER - Disciplined and self-aware\nSuede Orris lovers are quietly confident, considerate and\nsensitive. They adore fragrances that are reassuringly\nintimate and comforting.\n", "40": "Collection: Rose Dunes Collection Sheet; Description: Rose Dunes Iridescent. Mystifying. Hypnotic.\nCreated by Senior Perfumer Phillipe Paparella, Rose Dunes is a\nsophisticated layering of floral, ambery and woody notes. It’s a scented\nsymbol of the mystic ‘desert rose’ found in the Arabian Desert; this\nis not a true flower, but a unique rose-like formation of crystallised\nmineral clusters. This ambery-rose fragrance is an opulent ode to the\nmysterious beauty of the Arabian Desert with a universal appeal that\nreaches far beyond the Middle East. We designed our collection with\nevery detail in mind to capture a romantic, hazy desert at sunset; from\nthe spellbinding pearlescent texture of the Bath & Shower Gel and\nrose-gold lettering on the Body Lotion bottle to the glimmering\nswirl on the Eau de Parfum cap.\nLaunched in 2021\n\nFragrance Construction\nEau de Parfum\nFresh Madagascan pepper and ginger is wrapped by a dark bloom of rose. An addictive\noudh accord awaits in the lingering base of sandalwood, musk and vetiver..\n\n\nSIGNATURE        \nPatchouli Sulawesi - Dark\n\n\nTOP\nSaff ron - Spicy\nGreen Pepper\nCassis\nGinger\nViolet Leaf\nBergamot\n\nHEART\nRose - Velvety\nGeranium\nLily of the valley\nMagnolia\nRaspberry\n\nBASE\nOudh Accord - Opulent\nLeather\nSandalwood\nMusk\nVetiver\n\nFragrance Construction\nEau de Toilette\nRich cassis glistens at the top, softened by intimate saff ron and velvety rose.\nThe earthy-mossy base is deepened by patchouli and pulses of resinous amber.\n\nTOP\nCassis - Tart\nSaff ron\n\nHEART\nRose - Warm\nCinnamon\nGeranium\n\nBASE\nPatchouli Sulawesi - Earthy\nMoss\nAmber\n\nOVERARCHING NOTE Rose\nWarm, velvety rose intricately layers with the woody,\nambery facets of the fragrance for a sumptuous eff ect.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\n\nThe Ritual\nCLEANSE\nSlip into a bewitching soak with the Bath & Shower Gel\nand swathe yourself in the decadent shimmer.\nHYDRATE\nMove onto the Body Lotion and nourish warm,\ndamp skin while deepening the opulent scent trail.\nTREAT\nPerfect for your sumptuous night out, spritz\nthe sophisticated Eau de Toilette or indulge\nin the darker, more grandiose Eau de Parfum.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances are\noriginally built around raw materials such as ambergris and musk,\ncombined with woody, tobacco, spicy and marine facets.\nSECONDARY FRAGRANCE FAMILY - Rose\nFragrances where rose, peony or geranium play a lead role.\nPERSONALITY PROFILER - Authentic and discerning\nRose Dune wearers are luxury-loving, articulate characters.\nThey seek sumptuous, intricate fragrances that are full of depth.\n\n", "41": "Collection: Relaxing Ylang-Ylang Collection Sheet; Description: Relaxing Ylang-Ylang Rich. Relaxing. Hypnotic.\nCreated by Master Perfumer Jacques Chabert,\nthis floral fragrance spotlights the soothing\npower of ylang-ylang. Opulently floral at\nthe top, spicy in the heart and warm in the\nbase, ylang-ylang oil is typically cherished in\naromatherapy for its calming tones.\nLaunched in 1998\n\nFragrance Construction\nBath & Body Collection\nCitrus-spice top notes are enveloped in a rich heart of ylang-ylang and jasmine. A\ncomforting base welcomes with vanilla and musky woods. \n\nTOP\nTangerine - Cocooning\nCardamom\nGinger\n\nHEART\nYlang-ylang - Hypnotic\nJasmine\n\nBASE\nVanilla - Velvety\nCedarwood\nMusk\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nThe Ritual\nCLEANSE\nUnwind at the end of a long day\nwith the Bath & Shower Gel.\nTREAT\nTake care of skin with the nurturing Body Lotion\nand deepen the soothing scent trail.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, fl owers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily, lily\nof the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - White-Floral\nA heady presence of white fl owers such as lily, tuberose,\nhyacinth and jasmine.", "42": "Collection: Refined White Mulberry Collection Sheet; Description: Refined White Mulberry Fresh. Balanced. Elegant.\nCreated by Master Perfumer Jacques Chabert, this bestselling\nfragrance embodies fresh forestscapes and glorious green valleys.\nPerfect for renewing your senses, it’s an elegant union of herbaceous,\naromatic and green notes.\nLaunched in 2006\n\nFragrance Construction\nHand Collection\nVerdant top notes of basil and zesty bergamot is refreshed with clary sage\nat the heart. Aromatic thyme and musk create a balancing base.\n\nTOP\nBasil - Fresh\nBergamot\nElemi\n\nHEART\nClary Sage - Comforting\nGreen Tea\nRosemary\n\nBASE\nThyme - Aromatic\nMate\nMusk\n\nWhat Products Are Available In This Collection?\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually\nmint, lavender, rosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Green\nScents with fresh, leafy facets typically found in green\nfloral notes such as lily of the valley or fig leaves.\n\n", "43": "Collection: Neon Amber Collection Sheet; Description: Neon Amber Audacious. Intense. Passionate.\nThis intriguing ambery-vanilla fragrance began as a personal project\nfor New Gen Perfumer Jérôme Di Marino. Being a lover of deep,\nopulent scents, he worked on Neon Amber as a scent to wear himself.\nAlways one to put a new twist on classic notes, Jérôme has reinvented\none of the industry’s most iconic accords – Amber 83. Created in 1889\nby the legendary perfume house De Laire, Amber 83 is built around\nvanilla, cistus labdanum and patchouli. The accord became the\nsophisticated, groundbreaking base for warm, ambery fragrances.\nIn this exciting and never-before-seen creation, Jérôme replaced\nthe typical vanilla note with an overdose of tonka absolute\n– the ‘new vanilla’ – for a creamy and complex heart.\nLaunched in 2021\n\nFragrance Construction\nEau de Parfum\nFor inspiring infl uencers; sparkling bergamot and resinous cistus oil are amplifi ed\nby dark hay absolute, leading to a mysteriously warm base\n\nSIGNATURE\nHay absolute - Dark\n\nTOP\nBergamot - Sparkling\nCistus Oil\n\nHEART\nTonka Absolute - Sensuous\nCedar Leaf Oil\n\nBASE\nAmbroxan - Warm\nCistus Absolute\nPatchouli\n\nSIGNATURE NOTE Hay absolute\nThe warm, dry gust of hay absolute gives the fragrance a richer, darker and more full-bodied character.\n\nFragrance Construction\nEau de Toilette\nFor adventurous culture-seekers; sensuous, creamy tonka bean ignites\ndark ambery tones and musky-woody ambroxan.\n\nTOP\nMandarin Oil - Bright\nPink Peppercorn\nViolet Leaf\n\nHEART\nTonka Absolute - Sensuous\nCedar Leaf Oil\n\nBASE\nAmbroxan - Warm\nCistus Absolute\nCedarwood Oil\n\nOVERARCHING NOTE Tonka bean\nA dynamic overdose of creamy tonka bean lends a complex and contemporary twist to the fragrance.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nDeodorant\n\nThe Ritual\nCLEANSE\nFace a bold new day head-on with the Bath &\nShower Gel and freshen up with the Deodorant;\nideal for travelling and on-the-go activities.\nHYDRATE\nThe Body Lotion keeps skin feeling smooth,\nmoisturised and ready for your next challenge.\nTREAT\nDefine a long-lasting impression with the Eau de\nToilette or the daringly indulgent Eau de Parfum. \n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances\nare originally built around raw materials such as ambergris\nand musk, combined with woody, tobacco, spicy and marine\nfacets. With access to synthetic ingredients, contemporary\nambery perfumes are softer, usually featuring vanilla,\nlabdanum, cinnamon, pepper or oudh accord.\nSECONDARY FRAGRANCE FAMILY - Vanilla\nA significant presence of vanilla or tonka bean,\nas well as balms, incense and resins.\nPERSONALITY PROFILER - Passionate and curious\nNeon Amber is perfect for characters who are quietly refined,\nmature and comfortable in their own skin. They’re open to\nthe world, cultured and appreciate artistic talents. Naturally\ninquisitive and optimistic, these devotees are drawn to resinous\nand intense fragrances that express their happy nature.", "44": "Collection: Milk Musk Collection Sheet; Description: Milk Musk Pure. Gentle. Comforting..\nCreated by Maïa Lernout, Milk Musk is a deeply soothing scent\nthat enwraps you in a bubble of pure gentleness. This tender, floralmusky scent brings together luscious pear, soft musk and heartening\nwhite cedarwood. The Eau de Parfum cocoons the senses with an\nunexpected milk accord as the signature note, imparting nostalgic,\nintimate warmth.\nLaunched in 2020\n\nFragrance Construction\nEau de Parfum\nLemony elemi makes an enlivening debut, balanced by skin-soft musk and creamy\nambroxan. Sensual benzoin in the base is wrapped by cosseting tonka bean.\n\nSIGNATURE \nMilk Accord - Comforting\n\nTOP\nElemi - Animated\n\nHEART\nMusk - Soft\nAmbroxan\nVanilla\n\nBASE\nBenzoin - Sensual\nTonka Bean\n\nSIGNATURE NOTE Milk Accord\nMilk is a polarising yet prized note in perfumery. Rarely used, it evokes a deep emotional\nconnection, as one of the fi rst scents we universally remember as an infant.\n\nFragrance Construction\nEau de Toilette\nFresh, luscious pear at the top folds into a heart of musk and comforting vanilla.\nA creamy trail of sweet white cedarwood lingers in the rich base.\n\nTOP\nPear - Luscious\nPeach\n\nHEART\nMusk - Soft\nAmbroxan\nVanilla\nMilk\n\nBASE\nWhite Cedarwood - Heartening\nTonka Bean\n\nOVERARCHING NOTE Musk\nMusk is most often used as a base note to help prolong fragrances but for this perfume, we’ve added it as a heart note in small\ndoses to give a subtle, powdery and soft eff ect.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\n\nThe Ritual\nCLEANSE\nSlip into a soul-soothing soak with our Bath & Shower Gel.\nHYDRATE\nContinue the comforting ritual and nurture skin\nwith the comforting Body Lotion.\nTREAT\nEnjoy a few spritzes of the Eau de Toilette for an olfactory embrace\nor choose the Eau de Parfum for a more comforting touch.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily, lily\nof the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Musky\nThis describes fragrances that are based on a floral accord with\nan additional musky note; lending a richer, more contemporary\nstructure compared to a traditional floral perfume.\nPERSONALITY PROFILER - Astute and considered\nMilk Musk lovers have an observant and self-assured character.\nThey’re drawn to fragrances that have an aura of familiarity\nand represent their balanced approach to life.", "45": "Collection: Mesmerising Oudh Accord & Gold Collection Sheet; Description: Mesmerising Oudh Accord & Gold Precious. Heady. Mesmerising.\nThis ambery-vanilla collection is a refined exhibition of oudh;\na rare ingredient that has been ubiquitous in Middle Eastern fragrance\ntraditions for centuries. Senior Perfumer Philippe Bousseton created\nthe Eau de Toilette, inspired by oudh’s native birthplace in the dark,\nspiced forests of Assam, North India. Philippe introduced cinnamon\nleaf oil for a modern hook, refined with mysterious saffron.\nFor the Eau de Parfum, Senior Perfumer Sylvie Fischer was sparked\nby the Middle Eastern palaces of One Thousand And One Nights\nfolk tales, where gold reigns king. She encircles oudh with complex\nfacets to create a sophisticated balm that’s like ‘a well-kept secret’\n– deeply distinctive and mysterious.\nLaunched in 2014\n\nFragrance Construction\nEau de Parfum\nFor hedonistic extroverts; rose absolute, cardamom and davana enwrap oudh\nto create a complex, precious balm.\n\nSIGNATURE\nOlibanum Resin - Intense\n\nTOP\nDavana - Honeyed\nBergamot\nBlack Pepper\nCardamom\n\nHEART\nSaff ron - Balmy\nRose\nBlack Tea\nVanilla\n\nOudh - Spirited\nHoney\nTobacco\nStyrax Resin\n\nSIGNATURE NOTE Olibanum Resin\nOlibanum is a beautiful fusion of sweet, woody accords with a resinous intense aspect.\nIt’s made up of two different components; a resin and an oil. The oil adds brighter,\nenlivening top notes while the resin at the heart and base leave a more intense and sensual trail.\n\nFragrance Construction\nEau de Toilette\nFor indulgent head-turners; warm cinnamon leaf, a heart of black tea\nand heady oudh create a hypnotic exploration of a spiced forest.\n\nTOP\nCinnamon Leaf - Warm\nNutmeg\nBergamot\n\nHEART\nElemi - Spicy-citrus\nMyrrh\nBlack Tea\n\nBASE\nOudh - Heady\nVetiver\nHoney\n\nOVERARCHING NOTE Oudh\nOudh is the heartwood resin of the agar tree, originating in Assam, India; rare and difficult to harvest,\nit is around 1.5 times the value of gold, giving it the moniker ‘liquid gold’.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nPrecious Bathing Oil\nPrecious Body Oil\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nHOME\nSignature Candle\nLuxury Candle\n\nThe Ritual\nCLEANSE\nSwathe the senses in complete luxury with the\nBath & Shower Gel, infused with real, 23.5-carat\ngold flakes. Dial up the decadence with a few drops\nof the Precious Bathing Oil, enriched with radianceboosting Indian moringa oil and argan oil.\nHYDRATE\nMassage in the Body Lotion after bathing to keep\nskin feeling soft and divinely scented. Take it one,\nopulent step further with the Precious Body Oil\nto give skin a smooth, luminous finish.\nTREAT\nIntensify your ritual with a few spritzes of the Eau de\nToilette or Eau de Parfum for an intoxicating scent trail.\nHOME\nLight the Signature or Luxury Candle to lend\na majestically warm ambience to your sanctuary\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances\nare originally built around raw materials such as ambergris\nand musk, combined with woody, tobacco, spicy and marine\nfacets. With access to synthetic ingredients, contemporary\nambery perfumes are softer, usually featuring vanilla,\nlabdanum, cinnamon, pepper or oudh accord.\nSECONDARY FRAGRANCE FAMILY - Vanilla\nA significant presence of vanilla or tonka bean,\nas well as balms, incense and resins.\nPERSONALITY PROFILER - Extroverted and sensual\nMesmerising Oudh Accord & Gold wearers desire\nto be noticed, to impress and captivate the attention\nof others. They treasure loved ones but are unapologetic\nabout their self-indulgence. They love powerful,\nwarm fragrances and making a stand-out statement.", "46": "Collection: Lime & Patchouli Collection Sheet; Description: Lime & Patchouli Sparkling. Verdant. Enlivening\nCreated by Master Perfumer Jacques Chabert, this fragrance has\nbecome a popular Molton Brown classic. Verdant and uplifting, it\nspotlights makrut lime leaves, loved for its intense citrus aroma.\nLaunched in 2002\n\nFragrance Construction\nHand Collection\nVibrant lime and violet leaf are enlivened by a distinctively spicy heart.\nThe base is enriched with deep patchouli and musky woods.\n\nTOP\nLime – Vibrant\nViolet Leaf\nEucalyptus\n\nHEART\nCardamom – Distinctive\nCumin\nElemi\n\nBASE\nPatchouli – Deep\nCedarwood\nMusk\n\nWhat Products Are Available In This Collection?\nHAND\nFine Liquid Hand Wash\nHand Lotion\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually\nmint, lavender, rosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance\nfamilies in the world, citrus contains essential oils extracted\nfrom cold expression of fruit zest, such as lemon, bergamot,\norange and grapefruit.", "47": "Collection: Lily & Magnolia Blossom Collection Sheet; Description: Lily & Magnolia Blossom Delicate. Joyful. Blooming. \nThis delicate and joyful collection celebrates the beauty of\nbeginnings. Inspired by British woodlands and wildflowers, this\nwhite-floral fragrance blooms with bright magnolia, dewy lily of the\nvalley and warm sandalwood. We picked juicy pear as the signature\nnote for the Eau de Parfum. Its crispness brings out the watery side\nof the fragrance, adding a sweeter, longer-lasting trail.\nLaunched in 2021\n\nFragrance Construction\nEau de Parfum\nBright magnolia is surrounded by a delicate bouquet of lily of the valley\nand orange blossom. Sensual sandalwood and musk create a deep fi nale.\n\nSIGNATURE\nPear - Juicy\n\nTOP\nMagnolia - Delicate\nWhite Tea\nGreen Mandarin\n\nHEART\nLily of the Valley - Dewy\nPeony\nFreesia\n\nBASE\nSandalwood - Warm\nWhite Musk\nYlang-ylang\n\nSIGNATURE NOTE Pear\nThe crispness of the fruit brings out the top notes with an aromatic nuance,\nwhile its aquatic quality forms a luscious duet with dewy lily of the valley. \n\nFragrance Construction\nEau de Toilette\nCreamy magnolia is uplifted by soft peony and lemony freesia in the heart.\nA comforting base of sandalwood and white musk bring soothing depth.\n\nTOP\nMagnolia - Delicate\nWhite Tea\nGreen Mandarin\n\nHEART\nLily of the Valley - Dewy\nPeony\nFreesia\n\nBASE\nSandalwood - Warm\nWhite Musk\nYlang-ylang\n\nOVERARCHING NOTE Lily of the Valley\nSoft, elegant and verdant, lily of the valley is a scented symbol of spring\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\n\nThe Ritual\nCLEANSE\nEmbrace the day with the uplifting Bath & Shower Gel for a fresh start.\nHYDRATE\nMassage the Body Lotion into damp skin after\nbathing to deepen the blossoming scent trail.\nTREAT\nMist the reviving Eau de Toilette or sweeter\nEau de Parfum on pulse points and through hair\nwhile looking forward to new things.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - White-floral\nA heady presence of white flowers such as lily,\ntuberose, hyacinth and jasmine.", "48": "Collection: Labdanum Dusk Collection Sheet; Description: Labdanum Dusk Exceptional. Enigmatic. Treasurable.\nThis ambery-woody fragrance is a modern celebration of labdanum,\nalso known as ‘rock rose’ – an ancient ingredient used in incense\nand perfumery. Inspired by this lead raw material, Senior Perfumer\nNathalie Koobus introduces contemporary woody-earthy notes to the\nfragrance. She intensifies the different facets of labdanum with rare,\nsustainably sourced oudh as the signature note. This precious fragrance\nembodies Nathalie’s vision of ‘a Middle Eastern palace, where hazes\nof hookah incense drift into the sunset.’\nLaunched in 2021\n\nFragrance Construction\nEau de Parfum\nFor lovers of fi ve-star decadence; earthy cypriol and heady,\nresinous labdanum are enriched by the impressive depth of oudh\n\nSIGNATURE\nOudh - Intense\n\nTOP\nCedar Leaves - Verdant\nSaff ron\n\nHEART\nCypriol - Herbaceous\nCedarwood\nPatchouli\n\nBASE\nLabdanum - Resinous\nTonka Bean\nVanilla\n\nSIGNATURE NOTE Oudh\nAn oil extracted from dark agarwood, oudh is prized as the most expensive natural material in the world.\nOur oudh has been sustainably sourced from Dubai to make an undeniably rich and deep statement.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\n\nBODY\nBath & Shower Gel\nHair Mist\n\nThe Ritual\nCLEANSE\nThe Labdanum Dusk ritual is no ordinary one.\nThe Bath & Shower Gel elevates bathing to an art\nform with an extravagance that lingers in the air\nlong after it leaves your skin.\nTREAT\nA generous spritz of the Hair Mist dresses\nyour hair with a secretive, beautiful air.\nLAYER\nDeepen your scent trail with the Eau de Parfum,\nideal for an impressive night out. An intense\nsignature note of oudh creates a mesmerising aura.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances\nare originally built around raw materials such as ambergris\nand musk, combined with woody, tobacco, spicy and marine\nfacets. With access to synthetic ingredients, contemporary\nambery perfumes are softer, usually featuring vanilla,\nlabdanum, cinnamon, pepper or oudh accord.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\nPERSONALITY PROFILER - Rare and impressive\nLabdanum Dusk wearers are respected and powerful.\nThey have a passion for the finer things in life and are unashamed\nabout their self-indulgence. They prize fragrances that are made\nwith rarified ingredients for a hint of mystery, and fit for royalty", "49": "Collection: Jasmine & Sun Rose Collection Sheet; Description: Jasmine & Sun Rose\nPoised. Symphonic. Captivating.\nJasmine & Sun Rose has become an award-winning,\ninstant favourite. This chypre-fruity fragrance is a delicate\nyet powerful symphony of raspberry, jasmine and labdanum,\nalso known as ‘sun rose’. We sourced our jasmine from the\nbanks of the Nile Delta at dusk when the scent is the most\nintense. New Generation Perfumer Julie Pluchet created\nthe Eau de Parfum, bringing out the more complex floral,\nanimalic and leathery qualities of jasmine. She chose plumy\ndavana as the signature note for its ability to enrich classic\nand modern accords, calling it her ‘chameleon note’.\nLaunched in 2019 – 2020 (Eau de Parfum)\n\nFragrance Construction\nEau de Parfum\nSweet bergamot and cassis make a crisp entrance, wrapped by layers\nof sensual fl orals. Rich patchouli and musk languish in the warm base.\n\nSIGNATURE\nDavana - Peachy\n\nTOP\nBergamot - Sweet\nCassis\nRaspberry\n\nHEART\nJasmine - Sensual\nRose\nCistus Labdanum\n\nBASE\nPatchouli - Rich\nMusk\nTonka Bean\n\nSIGNATURE NOTE Davana\nDavana has many personalities; syrupy, plumy, spicy and sweet all at once.\nThis chameleon note can enhance and intensify a diverse selection of accords.\n\nFragrance Construction\nEau de Toilette\nYouthful raspberry is balanced with an elegant bouquet of jasmine and osmanthus.\nTrailing exquisitely with a base of precious labdanum and patchouli.\n\nTOP\nRaspberry - Youthful\nBergamot\nPeach\n\nHEART\nJasmine - Delicately Powerful\nOsmanthus\nRose\n\nBASE\nLabdanum - Precious\nPatchouli\nMusk\n\nOVERARCHING NOTE Jasmine\nThe symbol of elegance and beauty, it’s the perfect fl ower to plant\nin a lunar garden, so the night air is fi lled with its romantic essence. \n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nExquisite Bathing Oil\nExquisite Body Oil\n\nThe Ritual\nCLEANSE\nBegin with the Bath & Shower Gel for a captivating\nsoak; add a few drops of Exquisite Bathing Oil to\ndeepen the scent and leave skin with a lustrous glow.\nHYDRATE\nNourish skin with the Body Lotion and take it\none step further with the Exquisite Body Oil –\nenriched with Egyptian nigella seed and argan\noils for a silky-smooth touch.\nTREAT\nFinish with a few spritzes of the Eau de Toilette\nfor a romantic trail or choose the Eau de Parfum\nfor more magnetic eveningwear.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Chypre\nTaking the name after Francois Coty’s iconic perfume in 1917, chypre\nfragrances are built around an accord of oakmoss, ciste labdanum\nand bergamot. Complex and sophisticated, they’re reminiscent of\nundergrowth and the humidity often associated with autumn.\nSECONDARY FRAGRANCE FAMILY - Fruity\nLeading with delicious, fruity notes such as raspberry,\npeach, lychee, apple and strawberries.\nPERSONALITY PROFILER - Sociable and adventurous\nBest described as modern dreamers, Jasmine & Sun Rose\nfans are charming and playfully provocative. They love\nromantic fragrances with a youthful feel.", "50": "Collection: Infusing Eucalyptus Collection Sheet; Description: Infusing Eucalyptus\nPure. Bold. Stimulating.\nThis aromatic-woody fragrance is loved for its stimulating and\nrestorative power. It invites an energising bathing ritual with a bold\ninfusion of eucalyptus, mint and cedarwood.\nLaunched in 1999\n\nFragrance Construction\nBath & Body Collection\nReviving eucaplytus and lavandin is enriched by vivacious wild mint and clove.\nThe base is resinous with cedarwood and patchouli.\n\nTOP\nEucalyptus – Reviving\nLavandin\nRosemary\n\nHEART\nWild Mint – Vivacious\nClove\nThyme\n\nBASE\nCedarwood – Resinous\nPatchouli\nMusk\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Polisher\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually\nmint, lavender, rosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.", "51": "Collection: Flora Luminare Collection Sheet; Description: Flora Luminare Utopian. Luminous. Solar.\nCreated by Senior Perfumer Maïa Lernout, Flora Luminare\nis an exuberant celebration of tiare absolute, jasmine and rose.\nSunny citrus top notes balance beautifully with creamy vanilla\nand musk in the welcoming base. Maïa adores using only the\nfinest raw, natural ingredients. She chose the purest, most\nconcentrated form of the rare tiare flower, bringing\nout its exceptional radiance. This elegant, light-filled\ncreation is an instant favourite for those who express\ntheir warm and lively side.\nLaunched in 2020\n\nFragrance Construction\nEau de Parfum\nMilky bitter almond top notes soften into an intense bouquet of tiare absolute,\nneroli and jasmine. The base is a creamy trail of sandalwood and musk.\n\nSIGNATURE\nYlang-ylang - Exquisite\n\nTOP\nBitter Almond - Milky\nMandarin\nPetitgrain\nOlibanum\n\nHEART\nTiare Absolute - Intense\nNeroli\nJasmine Absolute\nRose Absolute\n\nBASE\nMate Absolute - Earthy\nSandalwood\nCedarwood\nMusk\n\nSIGNATURE NOTE Ylang-ylang\nGolden ylang-ylang accentuates the fragrance’s solar and textured fl oral facets.\nIt’s had a complete distillation to capture the fl ower’s full, exquisite power.\n\nFragrance Construction\nEau de Toilette\nZesty orange blossom and mandarin are blissfully balanced by a seductive core\nof white fl orals. Comforting notes of creamy vanilla and musk linger in the base.\n\nTOP\nOrange Blossom - Sensual\nMandarin\nYlang-ylang \n\nHEART\nTiare Absolute - Heady\nFrangipani\nJasmine Absolute\nRose Absolute\n\nBASE\nVanilla - Nostalgic\nCedarwood\nMusk \n\nOVERARCHING NOTE Tiare absolute\nIncredibly rare, the Tahitian tiare is sought after for its rich, sun-soaked warm tones. To harness\nits radiating power, the fl owers are picked at dusk when fully opened or at dawn as buds.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nGlowing Body Oil\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Cream\n\nThe Ritual\nCLEANSE\nIlluminate your senses with the\nBath & Shower Gel for a blissful soak.\nHYDRATE\nNourish skin with the Body Lotion or apply a few drops of\nGlowing Body Oil, enriched with argan oil, for silky soft skin.\nTREAT\nFinish with a few spritzes of the Eau de Toilette for\na brightly blooming trail or choose the Eau de Parfum\nfor more exuberance.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily, lily\nof the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - White-floral\nIndicates a heady presence of white flowers such as lily,\ntuberose, hyacinth and jasmine.\nPERSONALITY PROFILER - Warm and lively\nFlora Luminare devotees are social whirlwinds; bold, conscious\nand chatty personas who love scents that are full of volume.", "52": "Collection: Blissful Templetree Collection Sheet; Description: Blissful Templetree Peaceful. Reflective. Sacred\nCreated by Master Perfumer Jacques Chabert, this award-winning\nfragrance is a sacred fusion of floral, ambery and woody notes. Serene,\nsoft and rounded, it was inspired by a temple courtyard where gentle\nfloral beauty and greatness live in harmony.\nLaunched in 2002\n\nFragrance Construction\nBath & Body Collection\nA sacred medley of orange and fruity rose drift into a rich fl oral heart of\njasmine and lilac. Deep patchouli and sandalwood linger on in the base.\n\nTOP\nOrange - Exuberant\nFruity Rose\nGardenia\n\nHEART\nJasmine - Sensual\nLilac\nHoney\n\nBASE\nPatchouli - Rich\nSandalwood\nVanilla\n\nWhat Products Are Available In This Collection?\nBODY\nBath & Shower Gel\nBody Lotion\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances are\noriginally built around raw materials such as ambergris and musk,\ncombined with woody, tobacco, spicy and marine facets.\nSECONDARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family are\nusually sandalwood, cedarwood, patchouli and vetiver", "53": "Collection: \nHaircare Collection Sheet\n; Description: Hair Care\nWe have a proud heritage of creating natural hair care in our\noriginal 1970s Mayfair salon. Our pioneering founders had\na forward-thinking, holistic approach to hair styling with\na conscious care for the environment.\nOur fragrant formulas are targeted to suit all hair types\nand elevate a normal routine.\nOur new Botanical Hair Care (2021) contains sustainably sourced herbs:\nnettle, camomile, fennel and coriander. Paying homage to our home,\nLondon, we chose to grow our ingredients in once-abandoned underground\ntunnels, using remarkable hydroponic systems and LED technology.\nThis means they’re produced year-round in a controlled, pesticide-free\nenvironment, unaffected by weather and seasons. Using 70% less water\nthan a traditional farm, this method keeps all nutrients in a closed loop\nsystem to reduce agricultural runoff. Plus, our packaging is made\nfrom 100% post-consumer recycled plastic.\n\nVolumising Collection With Nettle\nFor Fine Hair\nGreen nettle helps boost hair, leaving it looking fuller with a smooth and shiny fi nish.\nStrands are beautifully perfumed with fresh violet leaf and comforting musk.\n\nTOP\nViolet leaf - Fresh\nEucalyptus\nPeppermint\n\nHEART\nNettle - Green\nGeranium\nJasmine\n\nBASE\nMusk - Comforting\nPatchouli\nSandalwood\n\nOVERARCHING NOTE Nettle\nNettle has a distinctively green character, like a blend of violet leaf and mint. It lends a natural green top note to the fragrance.\n\nHydrating Collection With Camomile\nFor Normal Hair\nSoothing camomile helps restore hair’s moisture balance, lending eff ortless shine and a smooth touch.\nFinished with a revitalising scent trail of fresh lemon zest and woody vetiver\n\nTOP\nLemon zest - Fresh\nMandarin\n\nHEART\nCamomile - Soothing\nLavender\nSage \n\nBASE\nVetiver - Woody\nPatchouli\nBlack pepper\n\nOVERARCHING NOTE Camomile\nWith herbaceous and fruity facets, camomile oil enhances the powdery, comforting aspect of the fragrance.\n\nRepairing Collection With Fennel\nFor Damaged Hair\n\nAromatic fennel leaves hair feeling deeply nourished and beautifully lustrous.\nComforting lavender and musk lend a soothing fragrant fi nish.\n\nTOP\nFennel – Aromatic\nMandarin\nCarrot seed \n\nHEART\nLavender – Soothing\nRose\nJasmine\n\nBASE\nMusk – Comforting\nSandalwood\nTonka bean\n\nBalancing Shampoo With Coriander\nFor Oily Hair\nCitrusy coriander leaves hair feeling thoroughly refreshed, rebalanced and serenely nurtured.\nUplifting bergamot and woody vetiver create an enlivening scent.\n\nTOP\nBergamot – Uplifting\nGrapefruit\nMandarin\n\nHEART\nCoriander leaf –\nCitrusy\nLavender\nRosemary\n\nBASE\nVetiver – Woody\nMusk\nSandalwood\n\nOVERARCHING NOTE Coriander\nGreen with a citrusy mandarin-like note, coriander helps bring a freshly clean note to the fragrance.\n\nWhat Products Are Available In This Collection?\nSHAMPOO\nNettle, Camomile, Fennel, Coriander, Ginger\nIndian Cress, Kumudu, Cloudberry, Papyrus Reed, Plum-kadu\n\n\nHAIR MASK\nFennel, Red Dulse Seaweed\n\nCONDITIONER\nNettle, Camomile, Fennel\nIndian Cress, Kumudu, Cloudberry, Papyrus Reed, Plum-kadu\n\nHAIR MIST\nSuede Orris, Labdanum Dusk\n*Ginger, Kumudu, Cloudberry, Papyrus Reed and Plum-kadu are being discontinued. \n\nThe Ritual\nOur Botanical Hair Care formulas target normal, fine, damaged and oily hair types.\nEach fragrance complements each other.\n\nCLEANSE\nFeaturing amino acids, all our\nshampoos thoroughly cleanse and\npurify the scalp, roots and strands.\nIndian Cress and Coriander helps\nrefresh greasy hair while Nettle\nleave it feeling volumised.\n\nCONDITION\nAll our conditioners richly replenish,\ndetangle and nourish locks. Camomile\nhelps deeply moisturise for an enviably\nsilky-soft touch.\nApply to the mid-lengths and ends\nto avoid build-up or switch-up your\nregime and try co-washing: using\nconditioner before shampoo.\n\nTREAT\nFor an extra level of conditioning,\napply our Hair Masks on clean,\ntowel-dried hair. Comb through and\nleave on for at least 15 minutes, then\nrinse. Our Intense Repairing Hair\nMask With Fennel works to revive hair\nto feel ultra-soft and healthy-looking.\n\nFRAGRANCE\nContinue the ritual with Suede\nOrris or Labdanum Dusk Hair\nMist, formulated to be kinder to hair\nwithout drying it out. Veil tresses in\nTuscan orris or resinous labdanum\nfor a long-lasting impression.", "54": "Collection: Outlet Icons; Description: BLUE MAQUIS\nBlue Maquis is an aromatic Molton Brown Icon.\n\nWild. Herbaceous. Aromatic.\n\nLet's discover the story and inspiration behind this collection...\n\nA beautifully untamed tapestry of herbs and flowers climbs crooked peaks.\nBotanical lavender and pine-like cypress flourish with a pinch of thyme and woody rosemary.\nA wild bouquet rooted in resinous, comforting labdanum.\nFeel naturally refreshed; breathe in the restorative maquis shrubland.", "55": "Collection: Re-charge Black Pepper; Description: Re-charge Black Pepper is a true Molton Brown Icon.\n\nAdventurous. Confident. Iconic.\nOur bestselling spicy blend will keep you refreshed and fragrant with notes of black pepper, coriander and vetiver. \nFeaturing a Bath & Shower Gel, Body Lotion, Fragrance, Anti-Perspirant Stick, Bodyscrub Bar, Aroma \nReeds and Scented Candles, Re-charge Black Pepper is a true masculine icon.\n\nGet inspired and discover more about this collection by watching the video below...\n\nVIDEO TRANSCRIPT\n\nInspired by the bold spirit of adventure in the depths of the Madagascan Forests’ perilous mountain tracks.\n The result of one of our early and most iconic partnerships with the master perfumer Jacques Chabert, \nour Re-charge Black Pepper collection is adventurous, energising and confident.\nGrown in Madagascar, black peppercorns unveil powerful, spicy and fruity flavours. It is a pepper\n that provides an outstanding finish, both sharp and refined. The pepper plant is a \nvigorous vine with small green flowers grouped in long clusters, which give way to fleshy fruits of varying colours depending on maturity.\n\n\nBlack pepper, as we recognise it, is the full mature peppercorn, picked when tinged with red. \nSeveral days of sun drying transforms these fleshy berries into shrivelled black kernels with a strong, spicy aroma.\n Re-charge black pepper has come to achieve iconic status because of its distinctive clash between bright citrus and deep woody notes.\n\n\nWhen Jacques revisited our original re-charge black pepper collection in 2019 to begin the creation of our Eau de Parfum,\n it was the characteristic spiciness of the black peppercorns that really drew him to an ingredient that would amplify and enhance this bold warmth. \nThe ingredient Jacques selected was myrtle pepper. Myrtle pepper, otherwise known as all spice or pimento, \ncomes from the unripened berries of the evergreen pimento tree.\n\n\nRobust and complex with hints of cinnamon and nutmeg, it’s a spicy accent that adds a rich dimension to the overall fragrance.", "56": "Collection: Orange & Bergamot; Description: A Sevillian courtyard of sun-dappled citrus trees.\nLively airs of sweet orange, sparkling bergamot and blossoming neroli dance a scented flamenco.\nGreen, vibrant galbanum and opulent ylang-ylang slip into enduring musk.\nAwaken your spirits; uplift with our modern classic, plucked from the naranja grove.\n\nSignature. Radiant. Unmistakable.\nWatch the video below to find out more about the iconic Orange & Bergamot:\n\nVIDEO TRANSCRIPT\n\nInspired by the spirit of Seville, this radiant fragrance uses every element of the city’s famous orange tree. From the bright citrus fruit to the delicate neroli flowers and even the woody petitgrain. More than 14 thousand bitter orange trees decorate the Spanish streets and infuse Seville with the scent of their blossoms every spring. These ornamental bitter orange trees outnumber every other species of tree in the city\n\nOriginally known as Orange Grove, this collection has been at the heart of our portfolio since it was created by Michael Pickthall in 1984. Originally launched as one of the first luxury hand washes, Orange Grove saw instant success in hotels across the world. The launch of our unforgettable citrus fragrance was the true beginning of our hotel partnerships which, until this day, sees our products in five-star hotels across the globe.\n\nIn 2018, we partnered with master perfumer Beverley Bayne, a close friend of Michael Pickthall, to reinvent our Orange and Bergamot Collection. Our aim was to modernise this fragrance with contemporary ingredients whilst remaining true to Michaels original vision. In 2019 we once again sought Beverley’s creative expertise as we launched our very first collection of Eau de Parfum.\n\nBeverley revisited the original inspiration for our iconic collection and staying true to the very heart of the fragrance, she selected a signature note of petitgrain. Petitgrain is steam distilled and extracted from the leaves and bark of the bitter orange tree. It takes around five hundred to six hundred kilograms of leaves to yield just one kilogram of petitgrain. It adds a fresh, green woodiness and entwines beautifully with the other orange tree elements, bringing depth and radiance to a classic collection.\n\nBeverley describes our Orange and Bergamot Collection as a celebration of joy and energy with its enduringly happy aroma and true cult following, we couldn’t agree more.", "57": "Collection: Heavenly Gingerlily; Description: Heavenly Gingerlily is our 6th bestselling Molton Brown Icon.\n\nBlack sands slip into a crystal-clear lagoon. Delicate petals of graceful lily and creamy tuberose softly float along the surface.\nFragrantly spiced, cool cardamom and vibrant ginger layer warm cedarwood in a perfumed breeze.\nDream of idyllic bliss; entice your wanderlust with an escape to island shores.\n\nExotic. Alluring. Escapist.\nGet inspired and discover more about this iconic collection by watching the video below...\n\n\nVIDEO TRANSCRIPT\n\nThe black, sandy shorelines, luscious forests and a spicy perfume breeze, the perfect setting for our beautifully white, floral icon, Heavenly Gingerlily.\n\nHeavenly Gingerlily is a warming, timeless fragrance which epitomises the exotic escapism of Polynesia. Blooming floral notes of tuberose, lily and rose are accompanied by warming ginger. Heavenly Gingerlily captures a sense of the exotic in an exquisite white floral. Tahiti’s warm sands, rich spices and beautiful island flowers being the inspiration.\n\nThe gingerlily flower known as Tahitian Flame, inspired the collections colour whilst the turquoise waters surrounding the heavenly destination are brought to life in the freshwater notes. Our Heavenly Gingerlily Collection is the creation of master perfumer, Jacques Chabert. A master perfumer in every sense, Jacques has an exhaustive and encyclopaedic knowledge of fragrance. His approach is instinctive and wildly creative.\n\nJacques is passionate about the reconstruction of natural ingredients, using a combination of ginger, lily and musk, to name but a few, Jacques began crafting an elegant, yet alluring, fragrance which quickly became an icon.\n\nEighteen years after its initial launch in 2001, Heavenly Gingerlily was revisited by Jacques and this time, the master of perfumery embarked on a new journey of discovery to find a unique signature note which would enrich and magnify the floral heart of our icon. Hyacinth was the perfect addition. Hyacinth is fresh and aquatic, yet opulent, with its sweet, floral notes and green undertones. It wraps around the aquatic, spicy character of the original scent to give it a more sensuous and distinctive signature.\n\nJacques had a desire to strengthen the white bloom of tuberose within the original fragrance and hyacinth allowed him to do just that. Its sensual quality elevates the classic floral threads of lily and rose to reveal a fragrance which is more polarising and intriguing than ever.", "58": "Collection: Fiery Pink Pepper; Description: Fiery Pink Pepper is an classic Molton Brown Icon.\n\nSmouldering. Sultry. Stirring.\nInspired by pink peppercorns, also known as ‘Pink Gold of Reunion’ or ‘Grains of Paradise’, which are sourced from the volcanic terrains of Reunion Island in the Indian Ocean.\n\nThese tiny seeds are prized for their similarity in taste to black pepper, but have their own unique, complex\nfloral facets. The result is an unconventional, sensuous yet enlivening scent.\n\nGet inspired and discover more about this iconic collection by watching the video below:\n\nVIDEO TRANSCRIPT\n\nInspired by the grains of paradise, our Fiery Pink Pepper Collection is a sultry, warming fragrance which embodies the very spirit of the flamboyant pink peppercorn. Pink peppercorns are also known as the pink gold of Reunion Island. These tiny little seeds are prized for their similarity in taste to black pepper, yet they have floral attributes and aromas. Their amazingly complex flavour is that of pepper, coriander, ginger, cardamom, with a hint of citrus. The pink peppercorn is in fact not a peppercorn but a berry, sourced form the Peruvian pepper tree and dried.\n\nOur Fiery Pink Pepper Collection is the creation of senior perfumer Carla Chabert. Carla has experimented with notes and accords since a young age. Using pink peppercorns sourced from the volcanic terrains of Reunion Island, Carla began crafting a spicy, rich fragrance which would soon become the perfect companion to our Re-charge Black Pepper Collection.\n\nNine years on from the launch of our Fiery Pink Pepper Collection in 2010, we once again requested the expertise of Carla as we began the journey to creating our very first Fiery Pink Pepper Eau de Parfum.\n\nThrough experimentation and vibrant pink inspiration, Carla sought an ingredient that was as bold and striking, in its natural form, as pink pepper. Osmanthus… this was the perfect addition. Bright, dramatic, and eccentric, osmanthus shares a rich, natural synergy and gives an apricot sweetness to pink pepper. Carla shares her thoughts on how osmanthus and pink pepper interact as she says, “Osmanthus is a sweet floral with a leathery kick that echoes the spiciness of the pink pepper”.\n\nInspired by the grains of paradise, our Fiery Pink Pepper Collection is a sultry, warming fragrance which embodies the very spirit of the flamboyant pink peppercorn. Pink peppercorns are also known as the pink gold of Reunion Island. These tiny little seeds are prized for their similarity in taste to black pepper, yet they have floral attributes and aromas. Their amazingly complex flavour is that of pepper, coriander, ginger, cardamom, with a hint of citrus. The pink peppercorn is in fact not a peppercorn but a berry, sourced form the Peruvian pepper tree and dried.\n\nOur Fiery Pink Pepper Collection is the creation of senior perfumer Carla Chabert. Carla has experimented with notes and accords since a young age. Using pink peppercorns sourced from the volcanic terrains of Reunion Island, Carla began crafting a spicy, rich fragrance which would soon become the perfect companion to our Re-charge Black Pepper Collection.\n\nNine years on from the launch of our Fiery Pink Pepper Collection in 2010, we once again requested the expertise of Carla as we began the journey to creating our very first Fiery Pink Pepper Eau de Parfum.\n\nThrough experimentation and vibrant pink inspiration, Carla sought an ingredient that was as bold and striking, in its natural form, as pink pepper. Osmanthus… this was the perfect addition. Bright, dramatic, and eccentric, osmanthus shares a rich, natural synergy and gives an apricot sweetness to pink pepper. Carla shares her thoughts on how osmanthus and pink pepper interact as she says, “Osmanthus is a sweet floral with a leathery kick that echoes the spiciness of the pink pepper”.", "59": "Collection: Delicious Rhubarb & Rose; Description: Delicious Rhubarb & Rose\nA Molton Brown Icon\nA just-baked slice of crimson spring tart.\n\nMouth-watering, bright grapefruit trickled over scattered petals of freshly picked, soft rose.\n\nThe tang of tart rhubarb leaf folded into a swirl of creamy vanilla for an utterly moreish touch.\n\nBe irresistibly indulged; treat your senses to a delectably sweet recipe with a citrus twist.\n\n\n\nVivacious. Fizzy. Tempting\n\nVIDEO TRANSCRIPT\n\nInspired by the sweetness of a crisp summer tart, our Delicious Rhubarb and Rose Collection is a fizzy, tempting fragrance which symbolises the very essence of sharp Yorkshire rhubarb. Procured from January to late March, forced rhubarb is grown in the dark in the wonderfully named Rhubarb Triangle in Yorkshire.\n\nRhubarb is so beloved of northern gardens because the cool damp conditions produce the sweetest, most succulent storks. Whether baked into a mouth-watering dessert or simply dipped in sugar, rhubarb has a distinctively cheerful appearance and taste.\n\nOur Delicious Rhubarb and Rose Collection is the creation of senior perfumer Vanessa Prudent. Born in Normandy, Vanessa discovered an early passion for fragrance through nature. She has had the pleasure of travelling across the world and this is where she has found her biggest inspiration. Discovering new places evokes a curiosity, an emotion she uses in her perfumery.\n\nUsing rhubarb sourced from the luscious gardens of the Yorkshire Triangle, Vanessa began crafting an irresistible, floral fruity fragrance which would soon become a favourite of all who experienced it. Our Delicious Rhubarb and Rose Collection is a true floral fruity.\n\nRhubarb spikes a bitter top note as zesty fruits fizz with a citrus twist. These contrast with the sweetness of spun sugar in the base. Our gentle rose extract and vanilla bring to life the buttery pastry of a dessert.", "60": "Collection: Coastal Cypress & Sea Fennel; Description: Coastal Cypress & Sea Fennel is a true Molton Brown Icon.\n\nCoastal. Venturesome. Uncharted.\nA salt-sprayed collision of the ocean swell against rugged outcrops. The shore air fresh with crisp fig leaves mingled with unexpected, punchy cardamom, joyful bergamot and marine notes.\n\nBracing cypress, cedarwood and musks bring natural, earthy appeal.\n\nExplore on the edge; awash your senses with a sea-soaked quest.\n\nGet inspired and discover more about this iconic collection by watching the video below:\n\nVIDEO TRANSCRPT\nA rich interpretation of azure blue, our Coastal Cypress and Sea Fennel Collection is a bracing, marine inspired fragrance which expresses the very essence of the rugged, ever-changing coastline.\n\nMarine notes are accompanied by striking, naturally blue cypress oil. Blue cypress oil, sometimes referred to as blue gold, is similar to sandalwood oil and vetiver oil with long lasting, warm, woody base notes, and earthy tones. It combines well with lavender, lemon mrytle, citrus, and floral oils.\n\nOur Coastal Cypress and Sea Fennel Collection is the creation of senior perfumer Carla Chabert, the daughter of world-renowned master perfumer, Jacques Chabert. Her personal love affair with fragrance began as a child after she attended a client’s house with her mother. This hugely resonated with her, remembering the scents, textures, and perfume bottles of that particular meeting with deep affection.\n\nUsing a combination of blue cypress oil, marine notes, and cardamom, to name a few, Carla began crafting an uplifting, compelling fragrance which would soon gain iconic status. Just two years on from the launch of our Coastal Cypress and Sea Fennel Collection, we once again requested Carla’s expert nose as we began the journey to creating our very first Coastal Cypress and Sea Fennel Eau de Parfum.\n\nFor Carla, the ingredient that was going to truly elevate our Coastal Cypress and Sea Fennel Eau de Parfum was the noble cardamom. Whilst cardamom is not a new addition to this collection, a heavy dose enhances the depth of the fragrance, highlighting the freshness on the top to add strength and vibrancy. For Carla, this overdose of cardamom was an instinctive choice and one which truly elevates our Eau de Parfum to a salt sprayed collision of ingredients.", "61": "Collection: Icons Quiz; Description: The Discovery Guide Icons Quiz\n\n\nCongratulations on completing the Icon section of this training module.\n\n\n\nLet's test your knowledge with one final, fun game!\n\nThere are 3 rounds.\n\nWork through them all to earn your total score.\n\nSome questions will give you a chance to win badges too!\n\n\n\nReady?", "62": "Collection: Heavenly Gingerlily Collection Sheet; Description: Heavenly Gingerlily Exotic. Alluring. Escapist.\nThis bewitching, white-floral fragrance is one of our earliest and most\nbeloved collections. It began as a personal project for Master Perfumer\nJacques Chabert, after he visited a botanical garden and discovered\nan exceptional ginger flower. Captivated by its heady, floral quality,\nhe combined it with aquatic notes and in doing so, put his own twist\non the 1990s marine perfume trend of the time. The result was a sensual\nfragrance veiled with warm, spicy tones and exotic wanderlust.\nJacques initially named it ‘Gingerlily’ and we stayed true\nto his vision, adding ‘Heavenly’ because this is exactly\nthe way this divine fragrance makes you feel.\nLaunched in 2001\n\nFragrance Construction\nEau de Parfum\nFor the pure romantics; Gingerlily blooms at the heart, wrapped within\na bouquet of rose and tuberose. Cedarwood creates a long-lasting fi nish.\n\nSIGNATURE\nHyacinth - Sensual\n\nTOP\nGinger - Vitalising\nCardamom\nOsmanthus\n\nHEART\nLily - Graceful\nRose\nOrange\nOrris\n\nBASE \nTuberose - Creamy\nSolar Notes\nCedarwood\nVanilla\n\nSIGNATURE NOTE Hyacinth\nHyacinth is fresh and aquatic, yet opulent with its sweet fl oral notes and green undertones.\nIt wraps around the aquatic spicy character of the original scent to give it a more sensuous and distinct signature.\n\nFragrance Construction\nEau de Toilette\nFor vivacious dreamers; a timeless blossoming of classic fl orals,\nlaced with gentle cardamom and a soft, woody-musky base.\n\nTOP\nCardamom - Spicy\nGinger\nClove\n\nHEART\nTuberose - Rich\nLily\nTagetes\n\nBASE\nCedarwood - Warm\nSandalwood\nMusk\n\nOVERARCHING NOTE Lily\nThis popular white-fl oral ingredient has been cultivated for thousands of years and has\nendless varieties. Beautiful, powerful and rich, no two lily notes are ever the same.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nCaressing Bathing Oil\nCaressing Body Oi\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Cream\n\nThe Ritual\nCLEANSE\nDream of summery shores in your morning shower\nor relax in a blissful soak with the Bath & Shower Gel\nor Caressing Bathing Oil.\nHYDRATE\nGrace skin with a few drops of Body Lotion or\nCaressing Body Oil to deeply nourish. Smooth\nand luminous until sunset.\nTREAT\nFinish with the Eau de Toilette for a light,\nelegant scent trail or the Eau de Parfum\nfor a captivating evening choice.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - White-floral\nA heady presence of white flowers such as lily,\ntuberose, hyacinth and jasmine.\nPERSONALITY PROFILER - Positive and thoughtful\nHeavenly Gingerlily is best suited to those who are sociable\nand at their happiest when surrounded by loved ones.\nThey show a lot of empathy and believe in being kind\nto themselves and others. Always ready to indulge,\nthey’re enticed by timeless and radiant fragrances.", "63": "Collection: Fiery Pink Pepper Collection Sheet; Description: Fiery Pink Pepper Smouldering. Sultry. Stirring\nSenior Perfumer Carla Chabert created this fresh, woody-spicy\nfragrance to mark 10 years of her father Jacques’ Re-charge Black Pepper.\nIt was inspired by pink peppercorns, also known as ‘Pink Gold of Reunion’\nor ‘Grains of Paradise’, which are sourced from the volcanic terrains of\nReunion Island in the Indian Ocean. These tiny seeds are prized for their\nsimilarity in taste to black pepper, but have their own unique, complex\nfloral facets. The result is an unconventional, sensuous yet enlivening scent.\nLaunched in 2014\n\nFragrance Construction\nEau de Parfum\nFor the unconventional spirit; pink pepper, enlivening tangerine\nand a fl oral symphony settles into a curious, aromatic base.\n\nSIGNATURE\nOsmanthus - Flamboyant\n\nTOP\nPink Pepper - Rousing\nTangerine\nGinger\n\nHEART\nLily of the Valley - Sumptuous\nJasmine\nCiste\n\nBASE\nPatchouli - Rich\nOakmoss\nCedarwood\nMusk\n\nSIGNATURE NOTE Osmanthus\nOsmanthus is a sweet fl oral with a leathery kick that echoes the piquancy of pink pepper.\nHints of orange, intrinsic to osmanthus are reminiscent of sun-ripened apricots, adding impressive warmth.\n\nFragrance Construction\nEau de Toilette\n\nFor the eccentric-minded; unexpectedly fresh and smouldering pink\npepper is followed by lively ginger, elegant fl orals and a rich woody base.\n\nTOP\nPink Pepper - Spicy\nTangerine\nElemi\n\nHEART\nNutmeg - Warm\nGinger\nJasmine\n\nBASE\nPatchouli - Rich\nCedarwood\nOakmoss\n\nOVERARCHING NOTE Pink Peppercorn\nPink Peppercorn has an amazingly complex fl avour. Nuances of\npepper, coriander, ginger and cardamom with a hint of citrus.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nPampering Bathing Oil\nPampering Body Polisher\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Cream\n\nThe Ritual\nCLEANSE\nPour a few drops of our sultry Bath & Shower Gel\nor Pampering Bathing Oil for an enlivening soak,\nleaving skin silky smooth and distinctively perfumed.\nPOLISH\nMove on to our Pampering Body Polisher, made\nwith exfoliating bamboo to refine and smooth\nskin texture. Expect sumptuously soft skin.\nHYDRATE\nAfter a luxurious soak, nourish skin and\nlock in the scent with our Body Lotion.\nTREAT\nComplete with a few spritzes of the\nEau de Toilette or Eau de Parfum for\na fresh, unconventional scent trail.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes in this family\nare sandalwood, cedarwood, patchouli and vetiver.\nSECONDARY FRAGRANCE FAMILY - Spicy\nSpotlights spices such as cardamom, pink or black pepper,\nginger, nutmeg, cumin and clove to enhance the originality\nand character of the fragrance.\nPERSONALITY PROFILER - Energetic and eccentric\nFiery Pink Pepper attracts those with an unconventional streak\nand an adventurous attitude. They appreciate others who display\na sense of individualism, quirkiness and androgyny. Their fragrances\nhave to keep up with their dynamic and complex energy.", "64": "Collection: Fiery Pink Pepper Collection Sheet; Description: Delicious Rhubarb & Rose Vivacious. Fizzy. Tempting.\nCreated by Senior Perfumer Vanessa Prudent, this floral-fruity\nfragrance is an irresistibly sweet recipe with a citrus twist. Having\ngrown up in Normandy, Vanessa discovered an early passion for\nnatural scents during her horseback rides in the countryside. She is\ncontinually inspired by travel and gastronomy, and captures this in all\nher fragrances – especially Delicious Rhubarb & Rose. This instant\nclassic evokes a beautiful spring afternoon all year round.\nCollection Launch – 2014\nEau de Parfum and Toilette Launch – 2022\n\nFragrance Construction\nEau de Parfum\nFreshly picked lychee at the top entwine with tender peony and a spicy\nkick of pink pepper. It draws to a close with a rich, cedarwood-musk trail\n\nSIGNATURE\nRaspberry - Juicy\n\nTOP\nLychee - Sweet\nRhubarb leaf\nGrapefruit\n\nHEART\nPeony - Delicate\nRose\nPink Pepper\n\nBASE\nCedarwood - Rich\nMusk\nVanilla\n\nSIGNATURE NOTE Raspberry\nInspired by the perfumer’s childhood memories of baking, juicy\nraspberry brings out the joyful, sparkling nature of the fragrance.\n\nFragrance Construction\nEau de Toilette\nFor those who love the sweet things in life; fi zzy bursts of rhubarb\nand grapefruit softly fold into a creamy swirl of vanilla and spun sugar.\n\nTOP\nGrapefruit - Bright\nYuzu\nLemongrass\n\nHEART\nRhubarb Leaf - Tart\nRose\nSpearmint\n\nBASE\nVanilla - Creamy\nMusk\nSpun Sugar\n\nOVERARCHING NOTE Rhubarb Extract\nThis fragrance celebrates the quintessential British ingredient of vivid rhubarb.\nIt adds a bitter spike to citrus, contrasting with sweet notes for a gourmand eff ect.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nVibrant Bathing Oil\nVibrant Body Oil\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Sanitiser Gel\nHand Cream\n\nHOME\nSignature Candle\nAroma Reeds\nAroma Reeds Refi ll\n\nThe Ritual\nCLEANSE\nImmerse yourself in the delectable, patisserie-like\nnotes of the Bath & Shower Gel in your morning\nshower. Or pour a few drops of the Vibrant Bathing\nOil into your bath, imbued with radiance-boosting\nrose extract and argan oil.\nHYDRATE\nAfter a delightful soak, stay in your sweet dream,\nmoisturise skin with the nourishing Body Lotion\nor finish with the Vibrant Body Oil for a lively lustre.\nTREAT\nApply a few spritzes of the Eau de Toilette for a\ndelectable scent trail or choose the Eau de Parfum\nfor richer, joyful style.\nHOME\nEnwrap your home in tempting aromas with the\nvivacious Aroma Reeds or Scented Candle.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, flowers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Fruity\nDelicious, fruity notes such as raspberry, peach, lychee,\napple and strawberries.\nPERSONALITY PROFILER - Open and kindhearted\nDelicious Rhubarb & Rose lovers are the definition of\na positive ray of sunshine. They’re endearing, carefree\nand adore fragrances that have a joyful nostalgia.", "65": "Collection: Coastal Cypress & Sea Fennel Collection Sheet; Description: Coastal Cypress & Sea Fennel\nCoastal. Venturesome. Uncharted\nThis invigorating, aromatic fragrance bottles the wild coast\nof Cape York, Australia. Senior Perfumer Carla Chabert was\ninspired by a beautiful azure blue colour and wanted to interpret\nthis through scent. She fuses rare blue cypress oil – native to the north\nAustralian coast – with spices to create a marine scent with a twist.\nBringing the freshness of ‘sea meets land’, this award-winning\nfragrance became an instant icon and continues to appeal\nto masculine and feminine tastes.\nLaunched in 2017\n\nFragrance Construction\nEau de Parfum\nA bracing choice for lovers of the great outdoors; a crisp opening of fi g leaves\nand ginger collides with marine notes for a meeting of land and sea.\n\nSIGNATURE\nCardamom - Punchy\n\nTOP\nBergamot - Joyful\nFig Leaves\nGinger\n\nHEART\nMarine Notes - Exhilarating\nCypress\nJasmine\nFrankincense\n\nBASE\nLeather - Smoky\nCedarwood\nVetiver\nMusk\n\nSIGNATURE NOTE Cardamom\nCardamom enhances the depth of Coastal Cypress & Sea Fennel, highlighting the tonicity\non top to add strength and vibrancy. Plus it amplifi es the ginger and elemi for a noble balance.\n\nFragrance Construction\nEau de Toilette\n\nTOP\nCardamom - Compelling\nBergamot\n\nHEART\nMarine Notes - Invigorating\nJasmine\nViolet leaf\n\nBASE\nSalted Cypress - Bracing\nCedarwood\nMusk\n\nOVERARCHING NOTE Marine notes\nReminiscent of the sea breeze, with fresh, tonic and algae-like accents.\nThis fragrance combines classic aquatic notes with spices for an unexpected edge\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nBath Salts\nDeodorant\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Sanitiser Ge\n\nHOME\nSignature Candle\n\nThe Ritual\nCLEANSE\nStimulate the senses day or night with our\nBath & Shower Gel or soak weary muscles\nwith the Bath Salts after your outdoor adventures.\nHYDRATE\nFollow up with our Body Lotion to hydrate and\ncondition skin, for a truly restorative feeling.\nTREAT\nComplete the bracing scent trail with the\nEau de Toilette or Eau de Parfum; an invigorating\nfinal spritz to complement your active lifestyle.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.\nSECONDARY FRAGRANCE FAMILY - Marine\nA clean, modern scent that’s reminiscent of salt-sprayed ocean waves.\nPERSONALITY PROFILER - Active and self-effacing\nCoastal Cypress & Sea Fennel devotees are conscientious people\nwho feel most at home outside among the elements. They don’t take\nthemselves too seriously and are always drawn to intriguing, tonic\nscents that leave them feeling invigorated and refreshed.\n", "66": "Collection: Re-charge Black Pepper Collection Sheet; Description: Re-charge Black Pepper Adventurous. Confident. Iconic.\nThis charismatic, spicy-woody fragrance has endured as one of our\nmost iconic bestsellers. Part of his keen interest in bringing together\ncitrus and woody scents, it began as a project by Master Perfumer\nJacques Chabert to wear as his own personal scent.\nPassionate about using the finest ingredients, we sourced our black pepper\nfrom Madagascar, one of the world’s leading spice centres. This ingredient has\na striking presence and unexpected freshness. It converges with confident earthy\nnotes to create a warm, bold and strident scent that embodies adventure.\nLaunched in 2002\n\nFragrance Construction\nEau de Parfum\nFragrance Construction\nEau de Parfum\n\nSIGNATURE\nMyrtle Pepper - Striking\n\nTOP\nCardamom - Hypnotic\nBergamot\nCoriander\nLavandin\n\nHEART\nBlack Pepper - Enlivening\nPink Pepper\nAmber\n\nBASE\nCedarwood - Robust\nOakmoss\nLeather\nVetiver\n\nSIGNATURE NOTE Myrtle Pepper\nMyrtle Pepper comes from the unripened berries of the evergreen tree. Robust and complex,\nwith hints of cinnamon and nutmeg, it’s a piquant accent that adds a rich dimension.\n\nFragrance Construction\nEau de Toilette\nFor the bold and charismatic; a warm medley of spicy black\npepper and ginger is fuelled by confi dent, earthy tones.\n\nTOP\nBlack Pepper - Piquant\nLemon\nGinger\n\nHEART\nCoriander - Herby\nBasil\nViolet leaf\n\nBASE\nVetiver - Earthy\nOakmoss\nAmbergris\n\nOVERARCHING NOTE Black Pepper\nBlack Pepper is the full, mature peppercorn, picked when tinged with red. Several days\nof sun-drying transforms these fl eshy berries into shrivelled, black kernels with a strong, spicy aroma.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nDeodorant\nDeodorant Stick\nBodyscrub Bar\n\nHOME\nSignature Candle\nLuxury Candle\nAroma Reeds\nAroma Reeds Refill\n\nThe Ritual\nCLEANSE\nStart your regime with a spice-spiked breeze; an invigorating\nshower using the Bath & Shower Gel perks up all the senses\nor opt for an energy-restoring, heady soak.\nPOLISH\nFar from a traditional soap, our exfoliating Bodyscrub Bar\nis infused with Madagascan black peppercorn oil; rousing\nboth the skin and mind.\nHYDRATE\nMassage a few pumps of our hydrating Body Lotion into\nskin to leave it soft, smooth and stimulated.\nTREAT\nMake a statement with a deep, emboldening scent trail;\nthe finishing touch of our Eau de Parfum will complement\nan exciting, hedonistic attitude\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver\nSECONDARY FRAGRANCE FAMILY - Citrus\nFresh, zesty and sparkling. As one of the oldest fragrance\nfamilies in the world, citrus scents contain essential oils\nextracted from cold expression of fruit zest, such as lemon,\nbergamot, orange and grapefruit.\nPERSONALITY PROFILER - Confident and risqué\nRe-charge Black Pepper admirers are very comfortable\nin their own skin, with a lovable rogue appeal. Always ready\nto make the right impression, their choice of fragrance\nconveys their confidence and strength as individuals.", "67": "Collection: Orange & Bergamot Collection Sheet; Description: Orange & Bergamot Signature. Radiant. Unmistakable.\nThis radiant citrus and white-floral fragrance has been with us since our early\ndays and remains a bestselling, award-winning icon. Formerly known\nas Orange Grove, the collection included what was regarded as one of Britain’s\nfirst luxury hand washes, which was chosen by the prestigious Grosvenor\nHouse in Mayfair to grace their bathrooms.\nCreated by Master Perfumer Beverley Bayne,\nOrange & Bergamot was inspired by the spirit of Seville\nand its sun-dappled streets lined with orange trees.\nFeaturing all the elements of the orange tree,\nthis fragrance has a contemporary, lively freshness\nand enduring happy essence.\nLaunched in 1984\n\nFragrance Construction\nEau de Parfum\nFor thoughtful idealists; capturing blooming orange fl owers at their most exuberant,\nwith a creamy fl oral heart of ylang-ylang and earthy sensuality of musky-woods\n\nSIGNATURE\nPetitgrain - Bright\n\nTOP\nBitter Orange - Fresh\nSweet Orange\nBergamot\nGalbanum\n\nHEART\nOrange Blossom - Vibrant\nRose Petals\nYlang-ylang\nClove\n\nBASE\nMusk - Deep\nSandalwood\nVetiver\nPeru Balsam\n\nSIGNATURE NOTE Petitgrain\nPetitgrain is steam distilled and extracted from the leaves of the bitter orange tree.\nIt takes around 500-600 kg of leaves to yield just 1kg of petitgrain. It adds a fresh,\ngreen woodiness and blends beautifully with the other orange tree elements in the fragrance.\n\nFragrance Construction\nEau de Toilette\nFor life’s sunny optimists; joyful Sevillian orange and cologne-like bergamot\nare light-fi lled top notes with blossoming neroli oil and a warm, woody base.\n\nTOP\nOrange - Uplifting\nBergamot\nMandarin\n\nHEART\nNeroli - Blossoming\nCardamom\nGalbanum\n\nBASE\nMusk - Enduring\nYlang-ylang\nCedarwood\n\nOVERARCHING NOTE Neroli\nSweet-fl oral Neroli is produced by hand-gathering blossoms from the bitter orange tree in spring time,\nwhich are then steam distilled. It takes one ton of these blossoms to produce just one litre of neroli oil.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Parfum\nEau de Toilette\n\nBODY\nBath & Shower Gel\nBody Lotion\nRadiant Body Polisher\n\nHAND\nFine Liquid Hand Wash\nHand Lotion\nHand Sanitiser Gel\nHand Cream\n\nHOME\nSignature Candle\nLuxury Candle\nAroma Reeds\nAroma Reeds Refill\n\nThe Ritual\nCLEANSE\nStart the day with the vibrant Bath & Shower Gel\nto feel refreshed and delicately perfumed with\nuplifting orange and neroli.\nPOLISH\nOur Radiant Body Polisher is rich with exfoliating bitter\norange peel and apricot kernels giving skin an incandescent\nglow. Gently massage onto skin using circular upward\nmotions and rinse thoroughly with warm water.\nHYDRATE\nLock in the scent with a few\ngenerous pumps of our nourishing Body Lotion,\nkeeping skin feeling moisturised all day long.\nTREAT\nComplete with a few spritzes of the Eau de Toilette\nor Eau de Parfum for an enduringly happy scent trail.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Citrus\nIdentified as fresh, crisp, zesty and sparkling. As one\nof the oldest fragrance families in the world, citrus contains\nessential oils extracted from cold expression of fruit zest,\nsuch as lemon, bergamot, orange and grapefruit.\nSECONDARY FRAGRANCE FAMILY - White-floral\nIndicates a heady presence of white flowers such as lily,\ntuberose, hyacinth and jasmine.\nPERSONALITY PROFILER - Caring and outgoing\nOrange & Bergamot fans are natural optimists who are warm\nas sun-kissed skin. They care about the choices they make in life\nand the impact these make on their world, their wellbeing and\nothers around them. They like to communicate a bright, healthy\nand light-hearted attitude to people with the fragrances they wear.\n\n", "68": "Collection: Molton Brown Heritage; Description: Molton Brown : Our Heritage\nHello Knapper,Jonathan,\n\n\nIn this training course we will look, in detail, at the heritage of our luxury brand, Molton Brown.\n\n\nBorn on South Molton Street, London in 1971, Molton Brown is an icon of uniquely British style. True to our founders’ values, we live by an ‘individual first’ ethos, with uncompromising care at the heart of everything we do.\n\nWe're Passionate about Quality\nWe have been Made in England since 1971 and commit to this for the future.\n\nWe use only the best ingredients in exceptional concentrations.\n\nWe Treasure our World\nWe never have and never will test on animals.\n\nWe pioneer positive luxury with sustainable practices that nurture our people and places.\n\nWe Celebrate Individuality\nWe enable our eclectic set of perfumers to express themselves.\n\nWe are driven by the progressive, diverse and open-minded attitude of our home, London.", "69": "Collection: The FLOW Philosophy; Description: The Molton Brown FLOW Philosophy\nClose Course\tMenu\nAn Overview...\nIn the 1970s, our founders Caroline Burstein & Michael Collis' prime focus was to deliver an exceptional customer experience to every customer that visited the Molton Brown salon. They created 'The FLOW Philosophy' to ensure that every part of the customers journey in their salon was exceptional.\n\nThey soon discovered that providing a unique customer experience would not only encourage customers to return but would also get people talking about the brand; encouraging new customers to visit and enjoy the experience available in our stores.\n\nThis is often referred to as the 'customer lifetime value' and is a key focus of any successful business.\n\nTo this day, The FLOW Philosophy continues to embody every aspect of Molton Brown. It is the red thread that runs through everything we do, especially when we consider delivering a memorable customer experience.\n\n\nThe FLOW Philosophy Pillars\nProviding our customers with an experience that fulfils each of our FLOW pillars is the secret to driving customer lifetime value at Molton Brown.\n\nTo encourage loyalty and new customers into store we need to implement all aspects found within each of the FLOW pillars.\n\nClick on each letter below to identify what is involved within each FLOW Pillar.\n\nLet's discover more about The FLOW Philosophy...\n\nFirst Impressions\nFirst Impressions count when it comes to delivering an exceptional customer experience, and it begins as soon as the customer notices or enters the store!\n\nMaking a positive first impression can help to build a customer connection with the brand which can influence them to purchase and return to shop at Molton Brown.\n\nThere are many aspects involved when creating a positive first impression at Molton Brown. They are :\n\n- Store Standards\n\n- Setting the Stage\n\n- Building rapport\n\n- Acknowledging the customer\n\n- Being blissfully busy\n\n- 360 degree awareness\n\n- Conversation starters\n\n- Universal Profiler Questions\n\n- Understanding customer types\n\n- Customer behaviours & buying signals\n\nAsk your Store Manager to explain each aspect of creating a positive first impression as this will build your confidence to meet your customers service expectations.\n\nLast Impressions\nThe last thing you do for a customer is the first thing that they remember!\n\nWith this in mind it is always important to consider how to make a great last impression with the experience you deliver. An exceptional customer experience doesn't end once a customer has decided to purchase an item, we always want to provide our customers with a warm farewell and a reason to return.\n\nLet's explore some of the ways in which you can deliver a great last impression and encourage a customer to return to shop with Molton Brown:\n\n- The Rewards Club\n\n- Data Capture\n\n- Closing the sale\n\n- Smooth & efficient till point service\n\n- Sampling\n\n- The Customer Satisfaction Survey\n\nAsk your Store Manager to discuss these points with you. Once discussed spend some time identifying what you can do to create a great last impression - how will your customer remember you?\n\nEliminate the Ouches\nAs you begin to deliver the exceptional experience that our customers know and expect from Molton Brown, you may come up against various obstacles. These obstacles are known as 'ouches'.\n\nUnderstanding how to eliminate customer 'ouches' before they occur can build customer confidence, which in turn builds trust. When trust is present it will often lead to conversion and also provides a customer with a reason to return.\n\nHere are some of the skills used to eliminate any ouches that may arise:\n\n- Listening Skills\n\n- Questioning Skills\n\n- Highlighting the Benefits & Features\n\n- Relevant product recommendations\n\n- Handling objections with confidence\n\nAsk your Store Manager to explain how to eliminate any ouches using the skills highlighted.\n\nFocus on the WOW\nHere at Molton Brown we want to provide our customers with an inviting, exciting and seamless shopping experience that exceeds all customer expectations.\n\nTo encourage customer lifetime value and help us stand out from our competitors, it is vital that we continue to focus on 'WOWing' our customers by creating Molton Brown memorable moments.\n\nThis can be accomplished in many ways, such as talking about our heritage or inviting our customers to experience the various service signatures on offer at Molton Brown.\n\nLet's look at the ways in which you can begin to WOW your customer through:\n\n- Storytelling\n\n- Product Expertise\n\n- Hand & Arm Massages\n\n- Fragrance Consolations\n\n- Eventing\n\n- Bespoke Gift Wrapping\n\n- Sampling\n\nAsk your Store Manager how they use these services to WOW customer's in store. Once you have an understanding of how to WOW your customer it's time to become familiar with how to carry them out to enhance the customers experience.", "70": "Collection: Till Training; Description: Let's begin your training by becoming familiar with the till and the equipment needed to complete transactions with your customers successfully.\n\nClick on each hotspot icon to learn more:\n\nThe Till Screen\nThe Till Screen is where we log on to OVC (our till system). It is also where all till transactions are displayed.\nYou can also input customer data capture details using the till screen.\n\nThe Barcode Scanner\nThe Barcode Scanner is used to scan each product through the till. This is done by using the barcode located on the side of the bottle or base of the box.\n\nIt is essential that every product is scanned. Once scanned the product will be displayed on the till screen.\n\nIf you have any issues with your Barcode Scanner please notify a member of management, or Datascan.\n\nTill Roll Printer\nWe need to ensure that there is always enough till roll in the till printer so that customer receipts can be printed.\n\nA supply of additional till rolls should be stored close-by so that you can change the roll quickly when needed.\n\nThe PDQ Machine\nThe PDQ Machine enables you to take card payments from customers.\nIt is also known as the Card Machine or the Chip & Pin Machine.\n\nPDQ is an acronym for \"Process Data Quickly'.\n\nBasic Till Functions\nClose Course\tMenu\nIt's now time to get familiar with the basic till functions that you will carry out on a daily basis when completing a customer transaction on the till.\n\nYour Store Manager will demonstrate how to access the till system and explain the policies & procedures around till security.\n\nClick on each cross symbol below to learn more, before answering the question:\n\nTill Login \t\nAsk Your Store Manager to show you how to log into the OVC Till System.\n\nYour Login will be provided to you by Retail Ops. This will be created for you once you have sent your employee details to HCD. The password you use to login to the till system will need to be updated every six weeks.\n\nIf you have not received your Login please check that you have sent HCD your employee details.\n\n\t\nTill Screen Layout\nOnce you have logged on to the till, ask your Store Manager to explain the till screen layout.\n\nThere are quite a few buttons that you will need to become familiar with!\n\nLogging Off \t\nTo minimise any till security risks you must always log out of the till system once you have completed a customer transaction.\n\nAsk your Store Manager to show you how to log out of the till system.\n\n\n Scanning A Barcode\nAsk your Store Manager to demonstrate how to scan a product using the barcode scanner. Once you feel confident, have a go at scanning a few products under your Store Managers supervision.\n\nMake sure you are informed of any promotional barcodes that you may have to scan.\n\n\n\nInputting A Barcode \t\nSometimes scanning a barcode can be a little tricky and you may need to manually input the barcode using the keyboard.\n\nAsk your Store Manager to demonstrate how to manually input a barcode so that you feel confident if this issue ever arises.\n\nOnce you feel confident to manually input a barcode, give it a go with your Store Manager's supervision.\n\n\nAmending An Error\nAs we know, sometimes errors can occur! Whether you accidently scan an item twice or the price has scanned incorrectly, you need to feel confident to amend this error when serving a customer.\n\nAsk your Store Manager to show you how to amend the following errors:\n\nIf you have scanned the barcode more than once.\nHow to manually correct a price on the till.\n\n\nHow often will you be prompted to change your OVC till password?\nComplete the sentence by entering the correct answer.\n\nI will be prompted to change my OVC till password every ____________________ weeks.", "71": "Collection: Health & Safety; Description: Health & Safety at Molton Brown\nProviding a safe environment in our stores is a priority at Molton Brown. Everyone has a part to play in ensuring the safety and welfare of themselves, their team and our customers. With the support of your Store Manager it is now time to explore the various Health & Safety procedures within Molton Brown.\n\nClick 'Flip' on the cards below to discover more...\n\nOn your first day it is important to be given a tour of the store so that you are informed about what to do if a Health & Safety emergency occurs.\nYour Store Manager must inform you on how to raise the alarm if an emergency arises. This will involve showing you the location of all Fire Exits and the Break Glass Fire points in your store, as you may need to activate the alarm.\n\nIt is a Health & Safety requirement that you are familiar with all Fire & Bomb Evacuation procedures.\nYour Store Manager must demonstrate what to do in case of a fire or bomb evacuation. This includes physically taking you to the evacuation meeting points so that you are confident and safe when evacuating the store.\n\nAlthough a rare occurrence, there may be a time when an accident happens in your store.\nYour Store Manager must inform you of what to do if an accident occurs as you may need to report it. They must also show you the location of the First Aid Box which may be needed in an emergency.\n\nTo prevent accidents happening it is important that you are fully aware of how to use a ladder and kick stool safely.\nAsk your Store Manager to explain the sensible precautions you should take when using a ladder/kick stool in your store.\n\nManual Handling procedures must be followed when a person lifts, pushes, pulls or carries a heavy object.\nAs there is legislation in the UK around Manual Handling it is essential that you adhere to the correct procedures when lifting heavy objects.\nAt Molton Brown there will be a need to support with deliveries and the replenishment of stock. Ask your Store Manager to explain the Manual Handling Policy and demonstrate how to lift heavy objects so that you limit yourself from any risk.", "72": "Collection: Let's Get Started; Description: Let's Get Started...\nTo provide you with the perfect start at Molton Brown, let's discover the 'All You Need To Know' information you require to begin your new role.\n\nClick on the icons below to discover more...Dress Code\nMolton Brown is a luxury retailer and it is important that we dress to impress within the store environment.\n\nFor more information on the Molton Brown dress code please log in to The Hub through a computer at work by clicking here.Rotas\nBeing in the right place at the right time allows you to deliver the ultimate shopping experience to our customers! With this in mind, your rotas are always planned in advance to make you aware of your shifts.\n\nYour rotas are available to view via the Tamigo app which can be accessed on your phone.\nPlease ask your Store Manager to explain how to access the Tamigo app and locate your rota.\nYou will be responsible for checking in at the start and end of each shift so that you are paid correctly - Please ask your Store Manager to show you how to do this.\n\nBreak Entitlement\nAll employees are encouraged to take their break entitlement. Your break entitlement is determined by the number of hours you work in any one day.\n\nYou should always ask a member of the Management team who is in charge of the day to provide you with your break times at the start of your shift.\n\n\nAbsence\nWe know that there may be times when you feel unwell or may arrive late for work due to unforeseen circumstances.\n\nIf you know you are going to be absent or arrive late for work, please follow the Molton Brown procedure for absence:\n\nPlease notify a member of the Management Team to let them know the reason for your absence at least an hour before your shift begins. We would recommend calling someone to notify them of your absence as text messages are not an appropriate way of communicating absence.\nPlease make sure you have the store contact details available, should you need them.\nFor more information ask your Store Manager to explain the current process for absence.\nAs a Molton Brown employee you will accrue annual leave. To discover more about the policies and procedures around annual leave entitlement, including how to book leave of absence, please log in to The Hub by clicking here.\n\n\nPay Dates\nYour pay date is the last working day of each month.\nAsk your Store Manager to show you how to access your pay slip which can be found online.\n\nIf you have any queries regarding your pay please inform your Store Manager who will guide you to the right point of contact.\n\n\nBenefits\nYour new role at Molton Brown also gives you access to lot's of fantastic benefits!\nWhy not take the opportunity to experience our luxurious products with 50% staff discount?\n\nClick here to discover more about the Molton Brown staff discount policy.\n\n\nYour health & wellbeing is important to Molton Brown, so as a business we offer Retail Wellbeing Support from Unum. Whether you require direct medical advice or guidance and support, help is at hand with Unum. This is a free and confidential service.\n\nClick here to access The Hub and find out more about these wellbeing tools.\n\n\nYou can also take advantage of a wide range of benefits & rewards available by visiting One Kao Rewards.\nAsk your Store Manager to show you how to access One Kao Rewards to unlock these amazing benefits.\n\n\nAt Molton Brown we recognise that support is really important during your first few weeks.\n\nIf you have any further questions please reach out to your Store Manager who will be happy to answer any questions you may have.", "73": "Collection: Chrismas quiz game; Description: ", "74": "Collection: Merry Berries Mimosa Collection Sheet; Description: MERRY BERRIES & MIMOSA\nJoyful. Delectable. Embracing\nThe unbridled spirit of cheerful, festive get-togethers filled with\nlaughter, memorable mishaps and joyful chaos. Candied red berries burst\ninto life, dashing into bright, tart mandarin for a jolly hint of mischief.\nSlivers of almond ripple with winter-blooming, snow-soft mimosa and\nribbons of ripe raspberry; a glorious mismatch of freshness and warmth.\nLet loose joy; make merry at the most wonderful time of the year.\n“Bringing new elegance to a fruity-floral fragrance was pure joy for me. Festive\nred berries merrily mingle with precious, winter-blooming mimosa, winter\ncitruses and a comforting musky-woody base.”\nNathalie Koobus – Senior Perfumer\nLaunched in 2022\n\n\nFragrance Construction\nBath & Shower Gel\nTHE FRAGRANCE\nCandied red berries burst into life, dashing into bright, tart mandarin for a jolly hint of mischief. Slivers of\nalmond ripple with winter-blooming, snow-soft mimosa and ribbons of ripe raspberry; a glorious mismatch\nof freshness and warmth. Gentle musk evokes the memory of cosying up in front of the fireplace after a\nlong day of merriment.\n\nRed Berries - Candied\nMandarin\nGrapefruit\nAlmond\n\nMimosa Absolute - Soft\nOrris\nViolet\n\nRaspberry - Ripe\nMusk\nCedarwood\nSandalwood\n\nMIMOSA\nThis winter blooming flower is sure to put a smile on your face with its joyful pom poms and distinctive aroma\nthat can be described as very powdery, dry and even dusty, it is also straw-like and honeyed. This high quality,\nmultifaceted raw material is more typically found in fine fragrance, but we’ve used it in our Bath and Body care\nfor the most luxurious experience.\n\nWhat Products Are Available In This Collection?\nBATH & BODY\nBath & Shower Gel\nBody Lotion\nBauble\n\nHOME\nSignature Candle\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume\nhistory. As its name implies, flowers take centre stage to create\na fragrant bouquet with blossoms such as rose, jasmine, violet,\niris, mimosa, lily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY – Fruity Gourmand\nDelicious, fruity notes such as raspberry, peach, lychee, apple\nand strawberries evoke a feeling of juicy, rich sweetness.\n\n\nThe Ritual\nCLEANSE\nInfuse your winter bathing ritual with glittering decadence,\nbeginning with the Merry Berries & Mimosa Bath & Shower\nGel; its deep, ruby-red shade reminiscent of juicy winter\nberries.\nHYDRATE\nPair with the luxurious Body Lotion to gently scent and\nnurture dry winter skin.\nTREAT\nRecreate an enlivening party feel in your home with the Merry\nBerries & Mimosa Signature Candle whilst adding an\nextra shimmer to your tree with the decorative and Festive\nBauble.\n", "75": "Collection: Understanding KPI's; Description: Understanding KPI's\nKey Performance Indicator's (KPI's) are in place to measure individual and store performance. They help you keep on track to achieve all store goals and targets.\n\nClick on the images below to discover more about the KPI's that need to be achieved at Molton Brown...ATV\nAverage Transaction Value or ATV is the average amount that your customer spends in a single transaction.\n\nCalculating your ATV is simple. You just divide your total sales by the total number of transactions to give you an ATV figure.\n\nAsk your Store Manager to inform you of the stores ATV target and to discuss the various ways that you can increase your ATV target in store.\n\n\nUPT\nUnits Per Transaction or UPT is the amount of items your customer purchases in a single transaction.\n\nCalculating your UPT is simple, you just add up the transaction amount and divide this figure by the amount of products the customer purchases.\n\nThis is also known as 'Basket Building' and Molton Brown have lots of products to support an increase in your UPT target.\n\nAsk your Store Manager to inform you of the stores UPT target. They will explain how to cross sell and upsell our categories and collections to give your UPT a boost!\n\n\n\nFragrance % Mix\nEvery team member has a Fragrance % Mix target to achieve.\n\nIf your Fragrance % Mix target is 16%, it means that 16% of your total sales must include the sales of our Eaux De Parfum & Eaux De Toilette.\n\nTo achieve your Fragrance % Mix you must always think 'Fragrance First' and introduce your customers to our collections by spraying the fragrance onto a customers skin or blotter.\n\nDeveloping your fragrance knowledge by completing modules on the Digital Learning Academy is a great way to help you showcase your expertise and build trust with your customer.\n\n\n\nData Capture\nDuring each customer transaction it is important to capture your customers email address.\n\nThis is known as Data Capture.\n\nThis helps us to look at ways to improve our customer experience and encourage our customers to return to shop at Molton Brown, as we can identify our customers shopping behaviours.\n\nEvery team member has a Data Capture target to achieve. Ask your Store Manager what your individual Data Capture target is and get them to demonstrate how to encourage sign up and how to input a customer's email address using the till system.\n\n\n\n\nConversion\nConversion is the percentage of how many customers have entered the store and made a purchase.\n\nFor example:\n\n100 customers enter your store and 10 people buy something. Your conversion would be 10%.\n\nAchieving high store conversion indicates that the team are confident when talking to customers about our products and services. This level of expertise engages the customer and converts them into a purchasing customer.\n\nAsk your Store Manager to inform you of your conversion target and the best ways to achieve conversion in your store.\n\n\n\nOnce you have started your shift it is important to locate the Daily Target Sheet.\n\nA member of the Store Management Team will complete this sheet daily. It highlight's the targets needed to be achieved in your store along with the individual targets that you need to hit during the day.\n\nAsk your Store Manager where the Daily Target Sheet is located in store.\n\nWhat targets do you and your team need to achieve today?\n\n\n\nRead the definitions below and select which KPI the definition refers to...\nATV\tUPT\t\nThe average amount that your customer spends with you within a single transaction is known as which KPI?\n\n\t\t\nThe amount of items a customer purchases in a single transaction refers to which KPI?\n\n\t\t\nSubmit\nFragrance % Mix\tData Capture\t\nCapturing a customers email address helps Molton Brown to evolve our customers experience and affects which KPI?\n\n\t\t\nThe percentage of sales that should include Eaux De Parfum & Eaux De Toilette supports which KPI?\n\n\t\t\nSubmit\nConversion\tData Capture\t\nMolton Brown can identify customer shopping behaviours once we have inputted our customers email addresses on our database. Which KPI does this relate to? .\n\n\t\t\nThe percentage of how many customers entering our store and making a purchase impacts which KPI?.\n\n", "76": "Collection: Store Standards & Housekeeping; Description: Store Standards & Housekeeping\nClose Course\tMenu\nStore Standards & Housekeeping\nFor over 50 years, Molton Brown has established itself as a luxury brand. Selling products of the highest quality, our customers have come to expect the ultimate shopping experience whenever they visit our stores.\n\n\n\nWith this in mind our store standards must always remain high. Establishing a store environment that exceeds our customers expectations encourages them to return over and over again.\n\n\n\nLet's discover more about these standards...\n\n\n\nAttractive displays can draw the customer's attention and entice them to purchase.\nWith this in mind, we need to ensure our standards of display are always maintained, keeping our categories & collections appealing to everyone who enters our store.\n\nWhether you work in a Stand Alone Store, Outlet Store or a Wholesale Concession, your store must always be clean and the stock fully replenished at all times.\n\nThe images below provide you with an example of how the bays in store should appear to our customers:\n\nStandard Collection Bays\n1971 Collection Library\n\n\nLet's discover the ways in which you can maintain these standards of display in your store.\n\nClick on each image below to learn more:\n\n\nGeneral Cleanliness\nA clean store creates a positive first impression and has a direct impact on sales and the customer's experience.\n\nWe all have a part to play in maintaining the cleanliness of the store. Let's look at the tasks that need to be completed on a regular basis to ensure the store is clean at all times:\n\nProducts must be clean & free from dust.\nTesters must be clean & free from dust.\nTesters must be suitably full for use.\nBays & Shelves must be cleaned and dust free at all times\nThe Sink/Hub must cleaned after every use.\nPaper Towels must be replenished.\nThe store must be hoovered & mopped daily.\n\n\n\nDisplay Guidelines\nTo maintain display standards in store there are a few key ways to keep your displays interesting & inviting :\n\nAll products must face to the front with pumps facing to the left.\nThere should be one tester per product on the bays.\nPosition the tester to the right of each product group.\nSilver 'Try Me' stickers should be used on all tester products.\nDamaged testers will need to be replaced, so notify your manager as soon as you discover one.\nA full list of VM standards is included with every new campaign launch. Your Store Manager will share this with you ahead of any launch.\n\n\n\nStock Replenishment\nWith store targets to achieve, we need to make sure that our customers have all of our categories & collections available to them.\n\nThis help us to maximise sales as it provides us with the opportunity to cross sell and increase our KPI's.\n\nListed below are the tasks we need to complete around stock replenishment:\n\nStock Replenishment should be completed throughout the day.\nAlways fill from the back of the display to maintain good stock management.\nEnsure all drawers & cupboards are full with stock from the stockroom.\nReplenish bays with stock from drawers & cupboards.\nReplenish till point items such as bags & tissue paper.\n", "77": "Collection: Give The Gift Of Fragrance At Christmas; Description: It’s no secret that fragrances are some of the most popular gifts to give at Christmas time.\n\nWe all hope to make it on to the 'Nice' list and find a truly thoughtful, special scented gift under the tree.\n\nIn this module, we take a closer look at how to promote our fragrances in the lead up to Christmas to ensure that our fragrance mix remains tip-top in quarter four and is at the forefront of everyone's minds.The fragrance industry is worth billions of pounds globally.\n\nWearing fragrance is part of our every day routine. We bathe, do our hair, apply makeup, put our clothes on and add a few spritzes of fragrance.\n\nScent has become an integral part of our lives to help us express ourselves.\n\nClick on each image below to discover some astonishing facts about the world of Fragrance:The Global Fragrance Market\nIn 2021, the global fragrance market was worth a phenomenal\n\n£40.7 BILLIONWho Wants Fragrance?\nA recent survey of the UK population revealed that\n\n72%\nof people would like to receive a fragrance as gift from a loved one at Christmas!\n\nThat's nearly three quarters of the population who want a fragrance under the tree.\n\nDo you know the name of their favourite fragrance?\nThe same survey revealed that\n\n56%\nof the UK population know the name of at least one perfume their partner wears.\n\nMaybe it's a Molton Brown Eau de Parfum or Eau de Toilette, or maybe even a favourite Bath & Shower Gel?\n\n\nAs you can see, fragrance is a huge part of people's lives, especially at Christmas and ultimately, people WANT fragrance! Luckily for us, we have plenty of fragrances to offer at Molton Brown.\n\nWhat percentage of UK fragrance sales do you think took place in November & December 2021?\nGuess what the percentage of sales were by selecting one answer below:\n\n\n25%\n\n39%\n\n49%\n\n\n\n", "78": "Collection: The Winter Sale; Description: ", "79": "Collection: Luminous Last Impressions; Description: ", "80": "Collection: OVER come the naughty ouches; Description: ", "81": "Collection: Joyful wow; Description: ", "82": "Collection: Festive First Impressions; Description: ", "83": "Collection: Merry Berries & Mimosa Introduction; Description: Merry Berries & Mimosa - An Introduction\nClose Course        Menu\nNew - Merry Berries & Mimosa\nKnapper,Jonathan, can you ever remember a Christmas that went 100% to plan?\n\nMaybe a present was accidentally ‘lost by St. Nick’,\nthe turkey ever so slightly bordered being burnt - or a tussle broke out over a game of charades?\n\nThis year, we’re inviting you to embrace the joyful chaos of Christmas with us.\n\nForget the fuss and the ‘picture-perfect’ scene; we’re finding happiness in festive mayhem, with all its unexpected, mischievous surprises enjoyed with family and friends.\n\n\n\nLet's discover this years festive limited edition!\n\n\nCampaign Brand Pillars\nClose Course        Menu\nFor the release of this years festive limited edition, Merry Berries & Mimosa, we will be focusing our three important brand pillars that are featured within this campaign.\n\nThese Brand Pillars play an important part in understanding the collection & what our brand values are.\n\nClick FLIP on each image below to learn more about each of these pillars...\n\n\nQuality\nThe new Christmas fragrance is an elegant take on the Fruity-Floral fragrance family, with a Molton Brown twist.\n\nThe ingredients used have a focus on sustainability as well as quality.\n\nSophisticated mimosa – a delicate, winter blooming flower with a global harvest of only 100-300kg per year is used in this collection. We have ensured that it is sustainably grown, harvested and produced.\n\nWe have partnered with Sedex, who are a membership organisation that provides one of the world's leading online platforms for companies to manage and improve working conditions in global supply chains.\n\n\n\nWe Treasure Our World\nTo help reduce waste, we use plastic bottles with at least 50% recycled plastic at our carbon neutral manufacturing facility in Elsenham.\n\nOur reusable gift boxes and crackers are made from 100% recycled materials and can be recycled once the base label is removed.\n\nThe Advent Calendar contains a metal plaque, which would need to be removed before recycling.\n\nOur bespoke Christmas ribbon is made from 70% recycled materials for a conscious\nfinishing flourish for your customers gifts.\n\n\nWe Celebrate Individuality\nThis Christmas we celebrate imperfections and mischievousness!\n\nOur broad selection of limited edition collections and gifts ensure that every individual can find their perfect fragrance match - whether that is a full-size Eau de Parfum, to a Mini Hand Cream.\n\n\n\nCampaign Pillars: Making Mischief Merry\nClose Course        Menu\nFor the launch of Merry Berries & Mimosa we will be focusing on three important pillars to bring this campaign to life.\n\nThese pillars play an important part in understanding this years Christmas collection and how & why it came to be.\n\nClick FLIP on each image below to learn more about each of these pillars...\n\n\nWellbeing\nNostalgia plays a big part in this years Christmas campaign as people are turning to feelings of comfort to enhance a sense of well being after a turbulent period of unease. This will hopefully be the first Christmas in several years uninterrupted by the pandemic.\n\nWith this in mind, Molton Brown have considered nostalgic formulas and fragrances that bring back happy memories and support a feeling of comfort and wellbeing.\n\n\nTogetherness\nDuring the pandemic we saw an elevated trend towards Conscious Consumerism which continues to this day.\n\nCustomers are deliberately making purchasing decisions that they believe have a positive social, economic, and environmental impact. In short, it means shopping with sustainability in mind.\n\n\nThis was a big focus for our 2021 Christmas Campaign, and you will learn more about some of the ESG credentials and how they are clearly communicated to customers this year.\n\n\n\nFinding joy\nLast but not least, Molton Brown have also considered that the Merry Berries & Mimosa campaign should offer a celebratory and mischievous feel to put a smile onto customers faces!\n\nAt a time when the world feels a little precarious, we find comfort and hope in feelings of nostalgia and surrounding ourselves with our nearest and dearest to create new, happy memories together.\n\n\nWhat scents remind you of the festive holiday?\nShare your scent story with us below describing particular aromas or fragrances (they do not have to be Molton Brown!):\n\n\n", "85": "Collection: Hand & Arm Massage Ouches; Description: Hand & Arm Massage Ouches\nThere are several \"Ouches\" that you might encounter when offering a Molton Brown Hand & Arm Massage services to your customers.\n\nHowever, we want to assure you that there are plenty of ways to \"Eliminate those Ouches!\"\n\nClick on each image below for more detailed information:\n\nThe Pandemic\nSome customers may not feel ready to experience a Hand & Arm Massage. That's fine - reassure them that they can book the service in the future once they are feeling more relaxed and comfortable with the idea.\n\nYou can also discuss the Me Time Hand & Arm Massage where you can match and mirror your customer by conducting a Hand & Arm Massage with them at the hub. We will go over how you can offer this service to your customers later in this module.\n\n\nNo Time\nOne of the Ouches we hear often is that it is too busy in store or there isn't enough time to conduct a Hand & Arm Massage. This tends to be the case for Outlets and Wholesale stores. However, we have come up an express, 'no water, no problem' Hand & Arm Massage. This can be conducted in any location to surprise and delight your customers.\n\nSimilarly, the Hand & Arm Massage is broken down into steps and techniques so you can adapt it to the amount of time you and your customer has.\n\n\nTechnique\nOne common Ouch is that we may be reluctant to carry out a Hand & Arm Massage as we are unsure of the correct techniques to use to effectively conduct the massage. This can be unsettling for you and for your customer.\n\nYou will get a full breakdown of the Hand & Arm Massage techniques with videos and additional tools to support you when offering and carrying out these service signatures.\n\n\nGender\nWe understand that at times some customers may feel uncomfortable receiving a Hand & Arm massage from a member of the perceived opposite sex, but there are ways around this. Do not feel offended - it could be because of somebodies religious beliefs or personal experiences.\n\nAsk the customer if they feel comfortable to proceed with you, and if they don’t... You can see if another member of the team is available to conduct the service.\n\nIn addition to the common Ouches in our stores, you may have your own personal reasons for not wanting to conduct a Hand & Arm Massage.\n\nPersonal Ouches\n\nThe Pandemic \nYou may feel that you are not ready to complete a hand & arm massage. That may be the case but we still need to make our customers aware that we have now introduced this service experience and it is available when they feel ready to do so. There are currently no regulations preventing cosmetic or beauty treatments from taking place.\n\nPlease discuss with your line manager if you need additional support.\t\n\n\nGender\nWe understand that at times some customers may feel uncomfortable receiving a Hand & Arm massage from a member of the opposite sex and similarly there may be members of the team who feel uncomfortable too. There are ways around this. If you feel uncomfortable to proceed with a service - then speak to your manager discreetly and maybe partner up with someone to share the role of conducting a Hand & Arm Massage.\nConfidence \t\n\n\nOuches Eliminated\nOne of the most common ouches is that individuals within a team are reluctant to carry out a hand & arm massage as they are unsure if they are doing the service correctly and using the right technique.\n\nBy completing this learning and practicing the techniques regularly in your store with colleagues will ensure that you build your confidence.\n\nThere might be other ouches that you can identify. Discuss these with your line manager so that they can provide you with the tools you need to eliminate them.\n\n\n\n", "86": "Collection: WOW with Technique; Description: Hand & Arm Massages\nMenu\nClick on each arrow below to discover the techniques for each type of Hand & Arm Massage experience:\n\nWalk In Hand & Arm Massage\nWatch the video below to understand step-by-step the techniques used during a Walk In Hand & Arm Massage.\n\nOnce you have watched the video, practice with a fellow team member to develop your skills.\n\nA Walk-In Hand & Arm Massage should last 5-10 minutes.\n\nDuring a Walk-In experience, you will massage and demonstrate our products on only one of the customers arms. This enables the customer to see and smell the benefits of layering products.\n\nIf your customer has loved their experience, they will most likely ask you to do their other arm too! This is a good thing - it means they are happy and are likely to purchase.\n\nIf both you and they have time, conduct the Hand & Arm Massage on their other arm too.\n\nVideo Player\n\n\nAs you would have seen in the video, the 'Up and Over Technique' in the Nourish step can look a little simple unless done correctly.\n\nBelow shows you how to apply pressure with your fingers and thumb when completing this technique to ensure an effective massage is given to the customer.\n\n\n\nWhen you are working your way up the arm, apply pressure to the outside of the arm with your four fingers. Imagine your hand is like a claw. Your entire palm and fingers should be in contact with the customers arm at all times.\n\n\n\nWhen you are working your way down the arm, apply pressure with your thumb down the other side of the arm. This will ensure all aspects of the muscle are massaged.\n\n\n\nThe video below helps demonstrate this...\n\n\n\n\nBookable/Elevated Hand & Arm Massage\nWatch the video below to understand step-by-step the techniques used during a Bookable/Elevated Hand & Arm Massage.\n\nThis technique can also be used during events, layered with Edutainment.\n\nOnce you have watched the video, practice with a fellow team member to develop your skills.\n\nA Bookable/Elevated Hand & Arm Massage should last 10-20 minutes.\n\nEnsure you conduct the experience on only one of your customers arms first to allow them to see and smell the benefits of layering products. Once you have done this, complete the Cleanse, Exfoliate, Nourish and Fragrance on the customers other arm too.\n\nVideo Player\n\n\nTo read the step by step Hand & Arm Massage Guide for an elevated or Bookable experience, click the download button.\n\nWe have also provided you with a glossary for all of the techniques mentioned so you can study and practice these and keep them for future reference in your staff file.\n\n\nNo Water? No Problem!\nWe mentioned previously that not having running water or a hub might be an ouch for conducting a Hand & Arm Massage... however at Molton Brown, all customers should have the chance to receive a luxury service, regardless of which store they enter!\n\nTo help those who do not have a hub or running water, we have created a video to show you how you can still conduct a Hand & Arm massage.\n\nLuckily, the technique is exactly the same for everyone so there is nothing new to learn! Just the products are amended to suit what you have available in your location.\n\nVideo Player\n\nIf you would like to watch each technique individually you can also click the arrows below to take you to the step by step videos.\n\nThis is not mandatory, however you can use these videos if you feel you need to.\n\nOnce you have finished viewing the videos, please click the Edutainment Tools button.\n\nCleanse\nExfoliate\nNourish\nFragrance\nCircular Massage\nCuticles & Webbing\nButterfly Technique\n\n\n\n\n\n\n", "87": "Collection: Hand & Arm Massages Last Impressions; Description: Last Impressions\nMenu\nCreating a fantastic lasting impression is one of the FLOW philosophies you will be familiar with.\n\nDelivering a great lasting impression can be a deciding factor as to whether the customer will shop with you again or not, and isn't necessarily carried out in the final moments spent with your customer. Always be aware of what you say and do throughout the customers journey.\n\nBelow we outline a few examples of how to deliver a positive lasting impression during a Hand & Arm Massage:\n\nPassion\n\nBeing knowledgeable about or products is one thing, but being passionate about them and your role at Molton Brown is what customers will really connect with and remember!\n\n\n\nAlways find the positive in a fragrance collection or product, even if it isn't your personal favourite. Our role as fragrance experts is to encourage customers to express themselves.\n\n\nEngaged\nWe know at times your stores are busy and you might even be short staffed. You may have a delivery to process or an unexpected visit from your Area Manager\n\nBut remember...\nThe Customer Comes First.\n\nIf a customer has booked in for an experience, ensure that everything is done in your control to stay engaged with them, build rapport and continue to stay connected to ensure they get the most from the service you are conducting.\n\nWe do not want our customers to feel like they are getting in the way!\n\n\nTop Tips\nCustomers love to learn something new - whether that is a technique that they can perform themselves at home or learning something fascinating about our heritage.\nThis is the difference between a scripted service and a personal service - share your top tips with your customers during a Hand & Arm massage using the edutainment tools as your reference.\n\n\nNow that you have seen some examples of things to consider to deliver a fantastic lasting impression with your customers...\n\n\nWhat other ways can you create a fantastic Lasting Impression?\nThink about other ways you believe you can create a great lasting impression with your customers:\n\n\n\n", "88": "Collection: Hand & Arm Massages First Impressions; Description: First Impressions\nMenu\nHand & Arm Massage - First Impressions\nWhether your customer is a new or regular Molton Brown shopper, offering them a Hand & Arm Massage is an excellent way to establish rapport and a fantastic first impression.\n\nDid you know?\nTouch creates symbolic connections between people and products, and between buyers and sellers.\n\nPhysically holding products can create a sense of psychological ownership, driving must-have purchase decisions!\n\nThere are various customer types that you will encounter on any given day.\n\nWe have identified four common customer types and how you can offer both a walk in and bookable/elevated Hand & Arm massage to them.\n\nClick on each image below to learn more:\n\n\n\"I know what I want\"\nJust because this customer says they know what they want - doesn't mean they wouldn't be interested in trying a product on their skin, or experiencing other collections they might enjoy.\n\nThis customer type can sometimes come across quite dismissive - Perhaps it could be because of time constraints or because they have been sent in to purchase a product for someone else.\n\nA good way to get around this is to start the conversation with some of the words below:\n\n\"I can see...\"\n\n\"Did you know...\"\n\n\n\nFor example:\n\n\"I can see you are stocking up on our Re-charge Black Pepper B&SG. Did you know, this collection now includes an Eau de Parfum and Eau de Toilette, do you have 5 minutes to try it for yourself?\"\n\n(If your customer is male, keep it simple and introduce the fragrance as an aftershave)\n\n\n\nSimply asking your customer if they have a few minutes to try a product on their skin could result in them actually spending more time with you and increases the chances of them making a purchase!\n\nIf they don't have the time, this is when you can use one of your Bounce Back Invitations to invite them in again when they have more time to indulge.\n\n\"I need some help\"\nThese are fantastic customers!\n\nAs they have expressed that they need some help or advice from you, they are generally more willing to spend time experiencing the products and listening to what you have to tell them.\n\nThis is the perfect time to utilise the Universal Profiling Questions!\n\nOnce you have established their needs using our UPQ's, ask the customer, \"Why not take the opportunity to indulge in a decadent Hand & Arm Massage? It is the perfect way to experience our products\"\n\nListen closely to any exciting event opportunities a customer might drop into conversation such as upcoming birthday's, weddings etc. as you could potentially host a bespoke VIP event for this customer and boost your KPI's!\n\n\"I'm just browsing\"\nBrowsing customers can generally come across as quite abrupt and dismissive towards you.\n\nSometimes a customer is browsing just to pass time whilst they are waiting for somebody or something. Other times they might be browsing to get gift ideas for themselves or others, but one fact remains, they have walked into your store for a reason. Don't miss a potential sales opportunity!\n\nThis is another opportunity to engage with a Universal Profiler Question such as\n\n\"What do you know about Molton Brown?\"\n\nThis opens up the doors of possibility to find out if they have used and experienced our products before. Why not say: \"Just to let you know I am available to deliver a Hand & Arm Massage today and introduce you to our Molton Brown fragrance collections and their benefits\"\n\n\"I'd like a fully immersive experience\"\nFantastic!\n\nThese customers are fanatics about Molton Brown and would probably be part of your team if they could! They have a wealth of knowledge of past and current collections and love nothing more than getting to be amongst the first to experience and buy new collections.\n\nFully immersive customers make themselves known by taking products to the basins to try, using the fragrance testers and usually ask about our services.\n\nInvite these customers to enjoy an elevated Hand & Arm Massage if they have the time - highlighting that they have been significantly elevated.\n\nAs these customers love to feel extra-special, why not handwrite them an invitation to an upcoming store event or an elevated Fragrance Consultation?\n\n\n\nSetting the scene means to create the conditions in which something can happen.\n\nIt is crucial to creating a great First Impression for your customers, whether it is a quick 5-10 minute Hand & Arm Massage or a bookable/elevated fully immersive experience.\n\nEnsuring we are fully prepared for the day will ensure smooth service for the customer and yourself!\n\nFollow the steps below to setting the scene:\n\nTesters\n\n\n\nAre your product testers suitably full for use?\n\nThere is nothing worse than trying to showcase a product that is nearly empty!\n\nMake sure all testers are ready to be used by your team and customers at the start of each day.\n\nIf another tester needs to be created, speak to a member of management.\n\n\n\n\n\nWater & Basins\n\n\n\nAt the start of each day, ensure that there is hot water running to the basin sinks*.\n\nIf not, raise this with a manager to ensure it is fixed.\n\nIf your basins do not have hot water, not to worry - half fill them with cold water and mix with warm water from the taps back of house.\n\nRemember to run taps for 5 minutes each day to eliminate the potential of legionella.\n\n*Only applicable to stores with basins.\n\n\nTowels\n\n\n\nWhether you are using paper napkin towels or premium cotton towels, ensure that you have enough in stock and laundered ready for use each day.\n\nTowels should look and feel luxurious - even paper napkins.\n\nIf you need more paper napkins, please speak to your manager who will be able to order more.\n\n\n\nRefreshments\n\n\n\nIf you are offering your customers a refreshment, ensure that you have the drink available to serve them and that it is chilled - there is nothing worse than warm bubbly!\n\nRemember to ask your customer if they have any dietary requirements so that you can check for them on the ingredients on the side of the bottle.\n\nUsually, most customers are quite content with a glass of still or sparkling water, or even a cup of coffee.\n\nConsider your staff in store - can you leave the shop floor for several minutes to fetch a cup of coffee? Only offer what is feasible for a seamless customer experience.\n\n\n\nTechniques\n\n\n\nFinally, you need to ensure that you have practiced and are confident in the techniques used to differentiate between a walk-in Hand & Arm Massage to those used in a bookable/elevated experience.\n\nWe want you to feel positive about carrying out every Molton Brown Service Signature with your customers.\n\nIf after this module you still feel you require additional support, speak to your manager who will guide you through the techniques.\n\n\nBefore you begin your Hand & Arm Massage, walk your customer through the collections asking them a series of Universal Profiler Questions to identify their needs. Through this you can determine which collections to introduce and use whilst carrying out the Hand & Arm Massage.\n\nClick each button below to learn about other ways to help set the scene:\n\nPrepare the Hub\n\n\n\nOnce you have selected the products with your customer, ensure that they are open and ready to be used throughout the service.\n\nTop tip: Position the products in a line in the order you are going to apply them to your customers skin.\n\nEnsure you have a full supply of paper towels to use. Be prepared and unfold two paper towels before you start the service\n\n\nFragrance Arc\n\n\n\nBefore you begin delivering the Hand & Arm Massage with your customer, Let them know you are going to place a towel over their lap for protection.\n\nSpray an arc of the chosen Eau de Parfum or Eau de Toilette in a halo above the hub. This will gently scent the space and fully immerse yourself and the customer in olfactive bliss.\n\n\nJewellery\n\n\n\nIf you or your customer are wearing jewellery such as rings or bracelets, we do advise that you politely ask them to be removed.\n\nProduct such as the body polisher can get caught in any grooves and you could catch the palm of your hands on any sharp edges.\n\nSuggest to your customer that they place their items on a napkin in front of them to keep a close eye on, or of course, they can put their belongings in their bag for safe-keeping.\n\nIf you are wearing rings, store them safely until after the service is complete.\n\n\n\n\n\n\n", "89": "Collection: Hand & Arm Massages; Description: Hand & Arm Massages\nMenu\nHand & Arm Massages\nAs one of our Signature Services, our luxurious Hand & Arm Massages are a wonderful way for our customers to fully experience the benefits of our products whilst being fully pampered in the olfactive world of Molton Brown.\n\n\n\n\nThe Services\nMenu\nWhat are the Hand & Arm Massage Services?\nWe can offer our customers the opportunity to experience Molton Brown products during an express 5-10 minute Hand & Arm Massage or indulge them further with a fully immersive 15-20 minute experience.\n\nClick on each image below for a brief overview of each service:\n\nWalk In\n\nYou will be most familiar with Walk In customers and engaging with them already.\n\n\n\nNow you can invite them to experience our products and potentially find new favourites as we guide them through an indulgent ritual whilst explaining the benefits behind each one.\n\n\n\nWalk In consultations should last between 5 and 10 minutes and are an opportunity to show a selection of at least 3 products.\n\n\n\nYou will learn more about this service and the techniques very soon!\n\n\nBookable/Elevated\n\n\n\nThrough a Bookable/Elevated Hand & Arm Massage experience, our customers can indulge in a moment of 'Me Time' as they learn about our collections and products. Professionally guide them through the Molton Brown ritual whilst explaining the benefits behind each step.\n\n\n\nBookable/Elevated consultations should last between 15 and 20 minutes and can be conducted whenever you and the customer have time. If your customer has walked into your store and you both have time, you can conduct a Bookable/Elevated Hand & Arm Massage - they do not have to book in to receive this experience.\n\n\n\nYou will learn more about this service and the techniques very soon!\n\n\n\n\n\n\n", "90": "Collection: Service Signatures Introduction; Description: \nMolton Brown Service Signatures\nHello Knapper,Jonathan\n\nWelcome to the Molton Brown Service Signatures training module - A training module here to provide you with all of the information, tools and techniques to delivering a fantastic Molton Brown Experience in store.\n\nThose that have attended the workshops, this training module will help support you with your team training on our service signatures in store, therefore, this is a supporting course only and is non-mandatory.\n\nTake it at your own pace and use the menu in the top right corner to focus on the areas you really need to work on.\nThere is no requirement to complete 100% of this module.\n\nWe look forward to seeing all stores conducting the new Service Signatures and really elevating that Molton Brown Experience.\n\n\n\n\nWhy are we elevating our Service Signatures?\n\n\n\n\nAt Molton Brown we want to elevate and enhance our current service signatures to further establish our credentials as a truly experiential and luxury brand.\n\nAn overview of the elevated Service Signatures\nThe world of retail has changed rapidly in the past couple of years, with customers drawn to a more experiential retail environment. To ensure that we stay relevant amongst our competitors in the market, we have elevated our service signatures. From Hand & Arm massage techniques to fragrance consultations we have ensured these experiences are memorable and encourage Customer Lifetime Value.\n\nClick on each icon below to learn more about some of the elevated changes:\n\n\n\nHand & Arm Massages\nWe have completely revamped our Hand & Arm Massages which have been adapted for both time-conscious walk-in customers and those looking for an indulgent treat via a bookable service.\n\nFor those of you who have been with Molton Brown for a while, you will undoubtedly notice some of the different ways in which we have elevated these experiences.\n\n\n\nFragrance Consultations\nAs part of our mission to be recognised as a fragrance first retailer, we have reviewed our current fragrance consultation proposition and re-worked it to include a blend of education and entertainment to enhance the customers experience. We have also provided YOU with some exciting tools to achieve this.\n\n\n\n\nEdutainment\nWhat is Edutainment?\n\nEdutainment is a method to entertain whilst educating our customers on our products, our brand and provides them with a fully immersive experience that showcases your skills and your knowledge of Molton Brown.\n\nWe have created a set of tools covering everything from our heritage, sustainability credentials, iconic products and even how the sense of smell works. Each tool is broken down into small points to enable bite size learning.\n\nWe know that our customers love to experience our products but also learn about them too - remember, it is the benefits of a product that helps to sell it!\n\n\n\nEvents\nIn-store events and activities are incredibly important to encourage customer interaction, sales growth and customer life time value.\n\nWe have in the past focused on hosting events only when new products are released. To relinquish our dependence on new collections, we have reviewed our eventing proposition so that you are empowered to host an event with any iconic collection, whenever you choose.\n\n\n\nWhy do I need to know about the elevated Service Signatures?\nAs an employee of Molton Brown, it is an essential part of your job to deliver the FLOW philosophy with every customer that walks into your store.\n\nThis includes conducting Hand & Arm Massages and Fragrance Consultations.\n\nThis helps to build brand trust and loyalty and ensures that we are continually recognised as a luxury brand.\n\nClick on each image below to learn more about why you need to actively promote the Molton Brown Service Signatures:\n\nLuxury Experience\n\nOffering your customer the opportunity to enjoy an indulgent hand & arm massage to learn about and experience our products is the pinnacle of luxury service.\n\n\nConsistent Service\n\nWe want to ensure that whether a customer walks into one of our stand alone stores, an outlet or even a wholesale door, the experiences delivered are as consistent in technique as possible.\n\n\nThis will also help you build your confidence in delivering the various techniques required for each of the services.\n\n\nKPIs\n\nOf course, whilst offering luxurious services to our customers to enjoy, our products help to set us apart from some of our competitors - they are also a sales technique to help boost our KPIs.\n\nOnce a customer gets to feel and experience the product on their skin, they have made a physical connection to the product and begin to desire them once they understand the benefits and value of each product used.\n", "91": "Collection: Fragrance Deconstructed; Description: ", "92": "Collection: Rose Dunes Summary; Description: ", "93": "Collection: Do you want to be remembered; Description: ", "94": "Collection: The Rose Dunes Collection; Description: Discover the Ambery Floral Fragrance Family\nLet's identify which primary and secondary fragrance families that Rose Dunes belongs to.\n\nThis will help you to understand its olfactive profile and also give you ideas as to what other fragrances to suggest to your customer.\n\nClick on each cross below to learn more.\n\nPrimary - Ambery\nDefined as warm, opulent and mysterious, ambery fragrances are originally built around raw materials such as ambergris and musk, combined with woody, tobacco, spicy and marine facets. With access to synthetic ingredients, contemporary ambery perfumes are softer, usually featuring vanilla, labdanum, cinnamon, pepper or oudh accord.\n\n\nSecondary - Floral/Rose\nOne of the most popular and ancient families in perfume history. As its name implies, flowers take centre stage to create a fragrant bouquet with blossoms such as rose, jasmine, violet, iris, lily, lily of the valley, narcissus or tuberose.\n\nRose Dunes is classed as more of a Rose fragrance due to the prominence of both romantic rose and rose-like geranium.\n\n\nUsing your knowledge of our fragrances and the families, what other fragrance could you suggest to your customer if they like Rose Dunes?\nPlease select one fragrance below:\n\n\nMesmerising Oudh Accord & Gold\n\n\nCoastal Cypress & Sea Fennel\n\n\nThe Eau de Toilette is a celebration of rose with rich cassis that glistens at the top, softened by intimate saffron and velvety rose.\n\n\nThe earthy-mossy base is deepened by patchouli and pulses of resinous amber.\n\n\n\nThe Eau de Parfum is an addictive fragrance that is hypnotic.\n\nFresh Madagascan pepper and ginger is wrapped by a dark bloom of rose. An addictive oudh accord awaits in the lingering base of sandalwood, musk and vetiver.\n\nFragrance Facts\nConcentrations\nFlip\nThe Eau de Parfum contains 20% fragrance oil meaning that it will last on a persons skin for up to 8 hours. For added longevity, explain the benefits of layering with the matching body lotion.\n\n\n\nThe Eau de Toilette is much lighter by design and is meant to be applied liberally for an instant ambery top-up!\n\n\nNotes\n\nThere are two notes that are important for different reasons in the fragrance collection.\n\n\n\nSignature note - Patchouli Sulawesi\n\nPerfumer Philippe has overdosed the Patchouli note for added depth, sensuality and earthiness in the Eau de Parfum.\n\n\n\nOverarching note - Rose\n\nThe rose note used throughout the entire collection is rich, velvety and romantic.\n\n\nResin Cap\n\nhe unique resin cap design is inspired by the rich colours found in a sunset over the sand dunes of the Arabian desert.\n\n\n\n", "95": "Collection: Test your rose dunes knowlwdge; Description: ", "96": "Collection: Avoid the road blocks; Description: ", "97": "Collection: Meet The Perfumer; Description: \nCompleted\n\n\nPlease close the browser window to continue your Rose Dunes learning journey...\n\n", "98": "Collection: Home knowledge test; Description: ", "99": "Collection: A guide to scenting the home; Description: ", "100": "Collection: Home collecting gifting; Description: ", "101": "Collection: Home accessoriess; Description: ", "102": "Collection: Aroma reeds; Description: ", "103": "Collection: Candles; Description: ", "104": "Collection: Home restage\nThe NEW Home Fragrance Collection; Description: From candles to aroma reeds - our new Home Collection is filled with beautiful, scented objects as elegant as they are expertly created, we’ve thought of every little detail to transform your house into a sanctuary.\n\n\n\nOur Scented Candles and Aroma Reeds have been carefully reformulated with higher fragrance concentrations for an exceptional experience.\n\nThese come in a selection of our best-loved, award-winning Fragrances to set an uplifting, refreshing or relaxing ambience.\n\n\n\nLet's discover why scenting our homes has become more important than ever...\n\nThe Home Sanctuary\n\n\nIn 2020, due to the pandemic, much of the world suddenly had to adapt to a new way of working - with many people working from their homes instead of office environments.\n\nBecause of this, an increasing number of people wanted to make their home a comfortable sanctuary to live and work in.\n\nIn August 2020, The Times newspaper reported that candle sales at Selfridges increased by 54% since March 2020, while candle sales at Diptyque increased by 100% year on year.\n\nWith a new way of working here to stay, we anticipate the demand for beautifully scented spaces to continue to grow...\n\n\n\nBelow are some interesting statistics on fragrance and home scenting that were a direct result of the impact of COVID-19 restrictions.\n\n56% of consumers took comfort in scents more than they did before Covid-19 lockdowns!\n\nThe pandemic resulted in fewer occasions for personal fragrances to be worn, but increased the demand for home fragrances.\n\nThe demand for home scenting increased drastically, with consumers happy to spend considerable sums on candles & aroma reeds to scent their homes with.\n\n\n\n\nWith the increasing popularity to showcase objects of desire on social media, combined with spending more time at home, consumers are drawn to items that are aesthetically pleasing as well as practical for their purpose.\n\nThe need for packaging goes beyond its initial purpose, with customers wanting to repurpose the vessels and display them on shelves or coffee tables.\n\n\n\nRead the three key pillars below that helped guide us with the design of our Home Collection restage.\n\nMore Than A Candle\n\nLuxury home fragrances are required to go beyond their first function with elevated packaging and reinvented formats to keep customers engaged.\n\nWith this in mind, we decided to revamp our Home Collection with a timeless, sleek and minimal design that anyone would be proud to showcase in their home.\n\nRepurpose\n\nAs more of us stayed at home due to lockdown demands, we were suddenly faced with the reality of how much waste we generate.\n\nOur new home collection's outer packaging has been massively reduced and the new design encourages customers to repurpose their vessels and do their part in reducing their environmental impact!\n\nFrom Office to Bedroom\n\nFor the majority, switching off from working at home can be difficult.\n\nFinding ways to create a separation between work and home are limited. It is incredibly important to create a feeling of sanctuary and relaxation - and home scenting plays a huge part in being able to do this and transport us to other places and times!\n\nOur 3 key objectives\nStrengthen our Home Category through a new elevated design and home accessories with improved product & fragrance performance.\n\nIncrease our category productivity by focusing our offer on best selling fragrances and covering key olfactive families for the Home Fragrance Category.\n\nContinue building our ESG (Environmental Social Governance) credentials through sustainable packaging and refillable solutions.\n\n\n\nWe want to know what you think will excite your customers the most about the new home restage!\nWrite below what you think your customers will be drawn to with the new home collection in the box below and press submit.\n\n", "105": "Collection: Hair Care - Recommendations; Description: ", "106": "Collection: Mothers Day 2022 Bespoke Gifting; Description: Creating a fantastic Last Impression\nhe perfect finishing touch to a customers journey at Molton Brown is walking away with fond memories of their in store expereince.\n\nThe are many ways in which you can delight and surprise your customers.\n\n", "107": "Collection: Mothers Day 2022 - Last Impressions; Description: ", "108": "Collection: Mothers Day 2022; Description: ", "109": "Collection: Your learning journey check In - 2; Description: ", "110": "Collection: Your learning journey check In ; Description: ", "111": "Collection: Delicious Rhubarb & Rose - last impression; Description: ", "112": "Collection: Delicious Rhubarb & Rose - fragrance family; Description: ", "113": "Collection: Delicious Rhubarb & Rose - the full collection; Description: ", "114": "Collection: Delicious Rhubarb & Rose -wow facts; Description: ", "115": "Collection: Delicious Rhubarb & Rose -end of module test; Description: ", "116": "Collection: Delicious Rhubarb & Rose - eliminating the...; Description: ", "117": "Collection: Delicious Rhubarb & Rose - EDP and EDT; Description: ", "118": "Collection: Delicious Rhubarb & Rose - An introduction; Description: ", "119": "Collection: Closing video - R & R; Description: ", "120": "Collection: Michael intro video 2 R & R; Description: ", "121": "Collection: Michael intro video; Description: Welcome to the Delicious Rhubarb & Rose Training Module\nTo achieve 100% in each section and move on to the next step, make sure you read, watch, listen and interact with everything included in this training module.\n\n", "122": "Collection: Re-charge Black Pepper Quiz; Description: ", "123": "Collection: Re-charge Black Pepper; Description: ", "124": "Collection: Bespoke Gifting; Description: ", "125": "Collection: Fiery Pink Pepper Quiz; Description: ", "126": "Collection: Fiery Pink Pepper ; Description: ", "127": "Collection: Introduction Video; Description: Welcome to the Delicious Rhubarb & Rose Training Module\nTo achieve 100% in each section and move on to the next step, make sure you read, watch, listen and interact with everything included in this training module.\n\n", "128": "Collection: MB1019_Customer Experience_CX Library_Festive Frankincense & Allspice_01; Description: Festive Frankincense & Allspice\nInviting. Festive. Timeless.\nCreated by Senior Perfumer Nathalie Koobus, this woody-spicy fragrance\nevokes cosy wintertime memories. Nathalie captures a snug cabin lit by the\ngentle crackling of logs. She chose cedarwood for it’s warm and dense character,\nweaving it with resinous frankincense – a scent synonymous with Christmas.\nA rich, earthy base lends an embracing and comforting finish to a scent that\ncontinues to be loved by Molton Brown fans for years to come.\nLaunched in – unknown\n\nFragrance Construction\nFine Liquid Hand Wash & Lotion\nInvigorating cardamom top notes impart fi ne freshness to resinous frankincense and rich woods.\nEarthy vetiver and patchouli reveals a sensual and full-bodied drydown\n\nTOP\nElemi - Balsamic\nCaraway\nPimento\n\nHEART\nFrankincense - Warming\nCedarwood\nGuaiac wood\n\nBASE\nVetiver - Woody\nPatchouli\nSandalwood\n\nOVERARCHING NOTE Frankincense\nFrankincense or olibanum, has been treasured for centuries as the ‘pearl of the desert’.\nIt’s a deeply resinous and aromatic sap extracted from Boswellia sacra trees commonly found in Africa\nand the Middle East. Ritually burned as incense and used in Ayurvedic medicine, its warming,\namber-like qualities feel at home with ambery and woody-spicy fragrances.\n\n\nWhat Products Are Available In This Collection?\nBODY\nFine Liquid Hand Wash\nHand Lotion\n\nThe Ritual\nCLEANSE\nInvite timeless festive spirit to your everyday with\nthe Fine Liquid Hand Wash. Cleanse hands with the\ncomforting, classic aromas of spice and rich woods\n– or present as a thoughtful gift for friends and family.\nHYDRATE\nPair with our matching Hand Lotion to deeply moisturise\nand care for hands throughout the winter season. \n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\nSECONDARY FRAGRANCE FAMILY - Spicy\nSpotlights spices such as cardamom, pink or black pepper,\nginger, ginger, nutmeg, cumin and clove to enhance\nthe originality and character of the fragrance. ", "129": "Collection: Customer Experience_CX Library_Jubilant Pine & a....; Description: Jubilant Pine & Patchouli\nCelebratory. Nostalgic. Seasonal.\n\nThis rich, woody-aromatic scent marks the pinnacle of our 50th year\ncelebrations, capturing decades of festive joy, which all began at\nour South Molton Street salon in London, 1971.\nCreated by Master Perfumer Jacques Chabert, Jubilant Pine & Patchouli\ncaptures the welcoming spirit of our salon, its trendsetting clientele and the\nexciting era of possibility in which we started out. Jacques has worked with us\nsince our early days and crafted one of our most signature collections, Re-charge\nBlack Pepper – we’re proud to still call him a friend. He was inspired by the\nunique, heartwarming energy of London’s festive countdown and reimagined\nthe sophisticated feeling of South Molton Street on Christmas Eve.\nLaunched in 2021\n\nFragrance Construction\nEau de Toilette\nThis joyful fragrance weaves crisp, traditional pine with luscious red fruits.\nA sprinkle of spicy cinnamon over smooth suede and creamy vanilla lend an irresistible touch\n\nTOP\nPine - Crisp\nCinnamon\nJuniper Berries\n\nHEART\nRed fruits - Luscious\nAmber\nSuede\n\nBASE\nPatchouli - Rich\nVanilla\nMusk\n\nOVERARCHING NOTE Pine\nPine lends a forest-fresh and aromatic touch to the woody accord, as well as a classic Christmas tree facet.\nWith its earthy undertones, pine also forms a rich union with patchouli in the base.\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Toilette\nBODY\nBath & Shower Gel\nBody Lotion\nFestive Bauble\nHOME\nLuxury Candle\nPlease note that assortment may vary\n\nThe Ritual\nCLEANSE\nTransform your winter bathing ritual into an uplifting\nexperience with the Bath & Shower Gel, shimmering\nwith festive gold flecks.\nHYDRATE\nNourish dry skin with our body lotion. Slip out of\na warm tub and massage gently into damp skin to seal\nin hydration and seasonal woody notes.\nTREAT\nSpritz the Eau de Toilette at pulse points to prolong\nyour celebratory scent trail through joyous gatherings.\nAdd a heartwarming twinkle to your tree with the\nFestive Bauble or pop into the stocking for a loved one\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Woody\nWarm but fresh, the typical woody notes used in this family\nare usually sandalwood, cedarwood, patchouli and vetiver.\nSECONDARY FRAGRANCE FAMILY - Aromatic\nA gathering of restorative and herbaceous scents, usually mint,\nlavender, rosemary, sage, eucalyptus or thyme.", "130": "Collection: Customer Experience_CX Library_Vintage; Description: Vintage With Elderflower\nRefined. Spirited. Effervescent.\nThis elegant fragrance is inspired by the vineyards and cellars of vintage\ncuvée in Champagne-Ardenne, northern France. Senior Perfumer Karine\nDubreuil Sereni wanted to capture the ‘effervescence of the festive\nmoment, where decadent nuances of champagne pop in the air,\nsparkly, refined and spontaneous.’ Unexpected elderflower\nadds an addictive embellishment to the scent trail.\nLaunched in 2015\n\nFragrance Construction\nEau de Toilette\nA resplendent toast of uplifting grapefruit at the top marries elegant elderfl ower\nand warm, sophisticated vetiver in the base.\n\nTOP\nGrapefruit - Sparkling\n Mandarin\nWhite Currant\n\nHEART\nElderfl ower - Delicate\nCoriander\nPetitgrain\n\nBASE\nVetiver - Balancing\nTonka Bean\nAmbergris\n\nWhat Products Are Available In This Collection?\nFRAGRANCE\nEau de Toilette\nBODY\nBath & Shower Gel\nBody Lotion\nFestive Bauble\nHOME\nSingle Wick Candle\nPlease note that assortment may vary.\n\nThe Ritual\nCLEANSE\nSlip into the festive mood with the spirited\nBath & Shower Gel for a refined soak.\nHYDRATE\nMoisturise and care for winter skin with\nthe complementing Body Lotion.\nTREAT\nComplete your elegant ritual with the Eau de Toilette,\nbrighten your haven with the Single Wick Candle\nand pop the Festive Bauble on your tree for a final glow.\n\nFragrance Family\nPRIMARY FRAGRANCE FAMILY - Floral\nOne of the most popular and ancient families in perfume history.\nAs its name implies, fl owers take centre stage to create a fragrant\nbouquet with blossoms such as rose, jasmine, violet, iris, lily,\nlily of the valley, narcissus or tuberose.\nSECONDARY FRAGRANCE FAMILY - Fruity\nDelicious, fruity notes such as raspberry, peach,\nlychee, apple and strawberries.", "131": "Collection: Opulent Collections Quiz; Description: ", "132": "Collection: Opulent Activation; Description: ", "133": "Collection: Labdanum Dusk - Last impressions; Description: ", "134": "Collection: Labdanum Dusk - Focus on the WOW!; Description: ", "135": "Collection: Labdanum Dusk - Eliminating the Ouches; Description: ", "136": "Collection: Labdanum Dusk -First Impression; Description: ", "137": "Collection: Neon Amber - Last Impression; Description: ", "138": "Collection: Neon Amber - Eliminating the Ouches; Description: ", "139": "Collection: Neon Amber -Focus on the WOW!; Description: ", "140": "Collection: Neon Amber -First Impressions     ; Description: ", "141": "Collection: Mesmerising Oudh - Eliminating the Ouches; Description: ", "142": "Collection: Mesmerising Oudh - First Impressions; Description: ", "143": "Collection: Mesmerising Oudh - Focus on the WOW!; Description: ", "144": "Collection: Mesmerising Oudh - Last impressions; Description: ", "145": "Collection: Hair Care Collection Library; Description: Hair Care\nWe have a proud heritage of creating natural hair care in our\noriginal 1970s Mayfair salon. Our pioneering founders had\na forward-thinking, holistic approach to hair styling with\na conscious care for the environment.\nOur fragrant formulas are targeted to suit all hair types\nand elevate a normal routine.\nOur new Botanical Hair Care (2021) contains sustainably sourced herbs:\nnettle, camomile, fennel and coriander. Paying homage to our home,\nLondon, we chose to grow our ingredients in once-abandoned underground\ntunnels, using remarkable hydroponic systems and LED technology.\nThis means they’re produced year-round in a controlled, pesticide-free\nenvironment, unaffected by weather and seasons. Using 70% less water\nthan a traditional farm, this method keeps all nutrients in a closed loop\nsystem to reduce agricultural runoff. Plus, our packaging is made\nfrom 100% post-consumer recycled plastic.\n\nVolumising Collection With Nettle\nFor Fine Hair\nGreen nettle helps boost hair, leaving it looking fuller with a smooth and shiny fi nish.\nStrands are beautifully perfumed with fresh violet leaf and comforting musk.\n\nTOP\nViolet leaf - Fresh\nEucalyptus\nPeppermin\n\nHEART\nNettle - Green\nGeranium\nJasmine\n\nBASE\nMusk - Comforting\nPatchouli\nSandalwood\n\nOVERARCHING NOTE Nettle\nNettle has a distinctively green character, like a blend of violet leaf and mint. It lends a natural green top note to the fragrance.\n\nHydrating Collection With Camomile\nFor Normal Hair\n\nSoothing camomile helps restore hair’s moisture balance, lending eff ortless shine and a smooth touch.\nFinished with a revitalising scent trail of fresh lemon zest and woody vetiver.\n\nTOP\nLemon zest - Fresh\nMandarin\n\nHEART\nCamomile - Soothing\nLavender\nSage\n\nBASE\nVetiver - Woody\nPatchouli\nBlack pepper\n\nOVERARCHING NOTE Camomile\nWith herbaceous and fruity facets, camomile oil enhances the powdery, comforting aspect of the fragrance.\n\nRepairing Collection With Fennel\nFor Damaged Hair\n\nAromatic fennel leaves hair feeling deeply nourished and beautifully lustrous.\nComforting lavender and musk lend a soothing fragrant fi nish.\n\nTOP\nFennel – Aromatic\nMandarin\nCarrot seed\n\nHEART\nLavender – Soothing\nRose\nJasmine\n\nBASE\nMusk – Comforting\nSandalwood\nTonka bean\n\nOVERARCHING NOTE Fennel\nFeaturing earthy, floral and aniseed-like facets, fennel energises the fragrance with a cool freshness.\n\nBalancing Shampoo With Coriander\nFor Oily Hair\nCitrusy coriander leaves hair feeling thoroughly refreshed, rebalanced and serenely nurtured.\nUplifting bergamot and woody vetiver create an enlivening scent\n\nTOP\nBergamot – Uplifting\nGrapefruit\nMandarin\n\nHEART\nCoriander leaf –\nCitrusy\nLavender\nRosemary\n\nBASE\nVetiver – Woody\nMusk\nSandalwood\n\nOVERARCHING NOTE Coriander\nGreen with a citrusy mandarin-like note, coriander helps bring a freshly clean note to the fragrance.\n\nWhat Products Are Available In This Collection?\nSHAMPOO\nNettle, Camomile, Fennel, Coriander, Ginger\nIndian Cress, Kumudu, Cloudberry, Papyrus Reed, Plum-kadu\nHAIR MASK\nFennel, Red Dulse Seaweed\nHAIR MIST\nSuede Orris, Labdanum Dusk\nCONDITIONER\nNettle, Camomile, Fennel\nIndian Cress, Kumudu, Cloudberry, Papyrus Reed, Plum-kadu\n*Ginger, Kumudu, Cloudberry, Papyrus Reed and Plum-kadu are being discontinued\n\nThe Ritual\nOur Botanical Hair Care formulas target normal, fine, damaged and oily hair types.\nEach fragrance complements each other.\n\nCLEANSE\nFeaturing amino acids, all our\nshampoos thoroughly cleanse and\npurify the scalp, roots and strands.\nIndian Cress and Coriander helps\nrefresh greasy hair while Nettle\nleave it feeling volumised.\nCONDITION\nAll our conditioners richly replenish,\ndetangle and nourish locks. Camomile\nhelps deeply moisturise for an enviably\nsilky-soft touch.\nApply to the mid-lengths and ends\nto avoid build-up or switch-up your\nregime and try co-washing: using\nconditioner before shampoo.\nTREAT\nFor an extra level of conditioning,\napply our Hair Masks on clean,\ntowel-dried hair. Comb through and\nleave on for at least 15 minutes, then\nrinse. Our Intense Repairing Hair\nMask With Fennel works to revive hair\nto feel ultra-soft and healthy-looking.\nFRAGRANCE\nContinue the ritual with Suede\nOrris or Labdanum Dusk Hair\nMist, formulated to be kinder to hair\nwithout drying it out. Veil tresses in\nTuscan orris or resinous labdanum\nfor a long-lasting impression.\n", "146": "Collection: Hair Care - Heritage; Description: ", "147": "Collection: Hair Care Profiling - Quiz; Description: ", "148": "Collection: Hair Care  - Quiz; Description: ", "149": "Collection: Hair Care - Bringing it to Life; Description: ", "150": "Collection: Volumising Collection with Nettle; Description: ", "151": "Collection: Repairing Collection With Fennel; Description: ", "152": "Collection: Hydrating Collection With Camomile; Description: ", "153": "Collection: Balancing Shampoo with Coriander; Description: ", "154": "Collection: The Science of Hair; Description: ", "155": "Collection: The Types of Hair; Description: ", "156": "Collection: Purifying collection with Indian Cress; Description: ", "157": "Collection: Thickening Shampoo with Ginger Extract; Description: ", "158": "Collection: Haircare Profiling & Demonstration; Description: ", "159": "Collection: Hair Hacks; Description: ", "160": "Collection: Category Usage; Description: ", "161": "Collection: The Growth Cycle; Description: ", "162": "Collection: Chamomile; Description: ", "163": "Collection: Coriander; Description: ", "164": "Collection: Fine Liquid Hand Wash; Description: ", "165": "Collection: Hand Cream ; Description: ", "166": "Collection: Hand Lotion; Description: ", "167": "Collection: Hand Sanitisers; Description: ", "168": "Collection: Re-charge Black Pepper - Focus on the WOW; Description: ", "169": "Collection: Re-charge Black Pepper - Eliminating the Ouches; Description: ", "170": "Collection: Re-charge Black Pepper- Last Impressions; Description: ", "171": "Collection: Re-charge Black Pepper - First Impressions; Description: ", "172": "Collection: Flora Luminare - Quiz; Description: ", "173": "Collection: Carla Chabert - Coastal Cypress & Sea Fennel; Description: Carla Chabert discusses her creation - Coastal Cypress & Sea Fennel", "174": "Collection: Carla Chabert - Fiery Pink Pepper; Description: Carla Chabert discusses her creation - Fiery Pink Pepper", "175": "Collection: Jacques Chabert - Re-charge Black Pepper; Description: Jacques Chabert discusses his creation - Re-charge Black Pepper", "176": "Collection: Orange & Bergamot - Focus on the WOW; Description: ", "177": "Collection: Orange & Bergamot - Eliminating the Ouches; Description: ", "178": "Collection: Orange & Bergamot - Last Impressions; Description: ", "179": "Collection: Orange & Bergamot - First Impressions; Description: ", "180": "Collection: Lily & Magnolia Blossom - Focus on the WOW; Description: ", "181": "Collection: Lily & Magnolia Blossom - Last Impressions; Description: ", "182": "Collection: Lily & Magnolia Blossom - First Impressions; Description: ", "183": "Collection: Hand Sanitisers - Focus on the WOW!; Description: ", "184": "Collection: Hand Sanitisers - Eliminating the Ouches; Description: ", "185": "Collection: Hand Sanitisers - First Impressions; Description: ", "186": "Collection: Hand Sanitisers - Last Impressions; Description: ", "187": "Collection: ESG House; Description: ", "188": "Collection: Introducing Sustainability; Description: ", "189": "Collection: Product; Description: ", "190": "Collection: People; Description: ", "191": "Collection: Places; Description: ", "192": "Collection: ESG; Description: ", "194": "Collection: Your Questions Answered - Places; Description: MOLTON BROWN Environmental • Social • Governance\nPLACES\nRespect Planet Boundaries\n\nRespect Planet Boundaries\nEnsuring that our own operations are climate friendly and fully\ncircular.\nOUR OFFICES AND MANUFATURING FACILITY\nSAVING ENERGY\n\nSAVING ENERGY\nWe use light motion detection sensors in all of our\noffice spaces and meeting rooms, which\nautomatically switch off lights after 15 minutes of\nnon-activity. The majority of our lightbulbs are now\nenergy saving LED, although there are some areas\nwithin our manufacturing plant which we are in the\nprocess of converting.\n• We optimise our manufacturing schedules to provide\ngreater continuity in the production runs; to reduce\nthe need to start/ stop the manufacturing or filling\nlines. This helps to save energy and water used in the\nsanitisation process required between each new run. \n\nPRINTING\n• We have designated printers on each of our\noffice floors that centralises all printing\nneeds. Employees are reminded only to\nprint documents that are absolutely\nessential to have in a hard copy. All printers\nhave a default setting of printing on both\nsides to reduce paper waste.\n\nOFFICES & STORES\nOFFICES & STORES\nPRINTING\n• We purchase electricity for our Manufacturing\nFacility, Green Street offices and our Stores from\nrenewable sources only (wind, solar and tidal). This\nmeans that with the exception of our heating\n(currently diesel and gasoline) all our energy is\ngreen. At this time the electricity supplied to our\nShaftesbury Avenue office is sourced via the Service\nCharge for the building. Therefore we cannot\nconfirm if this is from a Green Energy source at this\ntime.\n• We have Zip Hydrotapsin our kitchen facilities,\nproviding our employees with instant boiling and\nchilled water. This replaces the need to re-boiling\nkettles and reduces plastic waste from the previous\nwater cooler unit refills.\n\nRespect Planet Boundaries\nOUR OFFICES\nRECYCLING & WASTE\nKITCHEN\nOur employees are provided with crockery and\ncutlery, as well as dishwashers in the kitchen\nareas to prevent the use of single use plastics.\nMany of our employees opt to bring in their\nown lunch using reusable pots from home\n\nWASTE\nWe are expected to actively separate waste in\nclearly labelled rubbish bins, including paper,\nfood, plastics and cardboard, collected and\nrecycled by a third party waste management\ncompany. Obsolete electronic waste including\ncomputer equipment, TVs, printers etc. are all\nrecycled, although we are investigating\ndonation programs as an alternative.\n\nPRINTING\nWe use recycled paper for our offices, however\nwe are looking at alternative options for our\ncurrent premium grade paper used for\ncompliments slips and letterheads - currently\nnot from recycled sources. Used printer toners\nand ink cartridges are recycled post use.\n\nCLEANING\nWe use non harmful and specialised\ncleaning products to sanitise equipment\nbetween each production run and at the\nend of the shift, which reduces the amount\nof water required.\n\nRespect Planet Boundaries\nOUR MANUFATURING FACILITY\nRECYCLING & WASTE\nWe set annual targets to\nreduce manufacturing waste\nthrough efficiencies in\nplanning and processes, with\nthe overall objective of\nreaching zero. We have an inhouse team who are working\non a proposal to have the\nseparation process on site\nalthough at moment we are\nlimited on the space that we\nhave and where we would\nstore the recycled wate\n\nIt is impossible to eradicate\nwaste bulk product and\nalthough this is a very low\nvolume for us we do\nrecycle our liquid waste\nusing a third party. They\nseparate the water from\nany solids (from our lotions\nfor example), generating\nelectricity in the process\n\nCardboard waste from the\nManufacturing Facility\nsuch as corrugates/\npackaging is compressed\nin-house prior to sending it\nto a 3rd party recycling\nplant\n\nWe use non harmful\nand specialised\ncleaning products to\nsanitise equipment\nbetween each\nproduction run and at\nthe end of the shift,\nwhich reduces the\namount of water\nrequired\n\n0ur “Return,\nRecycle, Reward”\nProject will be\npiloted across\nsome of our\nStores and within\nselected Hotel\npartners\n\nRespect Planet Boundaries\nOUR OFFICES AND MANUFATURING FACILITY\nREDUCING OUR CARBON FOOTPRINT\n\nWe have targets every year\nto continuously reduce our\ngreen house gas\ngeneration. There have\nbeen vast improvements\nrelated to optimisation of\nmanufacturing schedules\nand improved cleaning\nprocesses which are\nhelping us on that journey\nAlthough all of our\nenergy is from carbon\nfree sources, we have to\nuse fuel to generate heat\nfor the production of\nsome of our products\nand heating of our\noffices. We are working\non proposals to eliminate\nthis requirement\nOur transportation is\nhandled by third party\ncourier companies who are\nworking on their own\ninitiatives to reduce our\ncarbon footprint. It is\ndifficult to overcome the\nneed to fuel the vehicles.\nThat said, we look at\ncombining journeys all the\ntime, to make every\njourney count\nWe opt for sea\nfreight to supply\nour global\nbusiness, in\npreference to air\nfreight wherever\npossible\nOur manufacturing plant is\nlocated in a rural area on a\nsmall industrial estate which\ndoes not have catering\nfacilities on site. To prevent\nemployees having to travel\nindividually to get food, we\nhave a family run local\nbakery which visits all the\nbusinesses on the Green\nStreet (Elsenham) site\n\nWe now manufacture Street (Elsenham) site two\nof our shampoos using\ncold mix processes,\nreplacing hot mix which\neliminates the need to\nheat the mixing vessels.\nWe are looking at moving\nto this way of\nmanufacturing across\nother product formats\n\nOUR OFFICES AND MANUFATURING FACILITY\nREDUCING OUR CARBON FOOTPRINT\nONLINE COMMUNICATION\nWe provide conference calls with screen share\nfacilities across all employee PCs/ Laptops to\nprevent unnecessary physical travel – this also\nallows us to keep in touch with our global\ncolleagues on a regular basis.\n\nCAR SHARE\nWe encourage our employees to car share\nwhere feasible – this works well at our\nmanufacturing plant where many of our\nemployees live in the same local areas.\n\nCYCLE TO WORK\nWe offer a ride to work scheme available to all\nemployees, providing them with discount for\npurchasing of a bike.\n\nRespect Planet Boundaries\nOUR STORES\nREDUCING OUR CARBON FOOTPRINT\nWe promote sustainability across our retail estate wherever possible.\nAll new\nstore refits\nhave LED\nlighting\nWe are looking at closing\nthe store doors in\nwinter/ summer months\nto maintain heat and air\nconditioning efficiencies,\nwithout impacting the\nwelcoming feel we wish\nto offer our customers\nand our footfall KPI’s\nLighting is switched off\nat night with minimal\nwindow display lighting\nleft on. These windows\nlights are on a timer to\nautomatically switch off\nat the same time as\nlocal street lights\nWe re-use fixtures and\nfittings where possible\nin new store fits and\npop up locations.\nShop fit waste that can\nbe recycled (and are\nnot fit for repurposing)\nare sent to recycling\ncentres\nAll power (apart from the\ntilling systems, so as not to\naffect business reporting\nand continuity) is switched\noff at store closing time.\nIn areas not consistently in\nuse, lights are switched off\nstraight after use e.g.\nstockroom, staff room,\noffices \n\nRespect Planet Boundaries\nPLACES\nOUR STORES\nREDUCING OUR WASTE\nWe promote sustainability across our retail estate wherever possible\n\nOne of our\neducational platforms,\nThe Digital Learning\nAcademy, supports\nsustainability as all\nmodules and activities\npromote paperless\nlearning\nWe offer our customers\nthe choice of a printed or\nelectronic receipt sent to\ntheir email address.\nWe have elevated our\nmanagement processes\nto paperless options\nusing digital applications\nfor planning and rotas \n\nOur till cash\nmanagement processes\nnow only require 3\nreceipts to be printed\noff (instead of the\nprevious 3 x A4 pieces\nof paper. 3 receipts = 1\nA4 paper) \n\nComplying to local\ncouncil and\nshopping centre\nrecycling policies &\ncollections –\nincluding separating\ncardboard/plastic &\ngeneral waste etc.\n", "195": "Collection: Your Questions Answered - People; Description: MOLTON BROWN Environmental • Social • Governance\nPEOPLE\nCaring for People & Partners\n\nPEOPLE\nCaring for People & Partners\nWe put people first because when the people we rely upon prosper, so\ndo we\nINCLUSION POLICY\nHere at Kao Corporation we are committed to promoting equal opportunities for all\nemployees and job applicants. The aim is to create a working environment in which all\nindividuals are able to make best use of their skills; providing opportunities to develop\nand explore new skills or qualifications, free from discrimination or harassment, and in\nwhich all decisions are based on merit. \n\nThe principles of nondiscrimination and\nequality of opportunity\nalso apply to the way in\nwhich employees treat\nvisitors, clients, customers,\nsuppliers and former\nemployees. (reference to\nEqual Opportunities Policy\n2012)\n\nKao Corporation do not\ndiscriminate against\nemployees on the basis of\nage, disability, gender,\ngender reassignment,\nmarital or civil partner\nstatus, pregnancy or\nmaternity, race, colour,\nnationality, ethnic or\nnational origin, religion or\nbelief or sexual orientation\n\nBusiness Conduct\nGuidelines are\nincluded as part of a\nnew starters\ninduction, and\nrefresher training is\nprovided every 2 years\n\nAn overview of\nKao Corporation\nSustainability is\nprovided during\nthe Head Office\nCompany\nInduction \n\nKao Corporation Business\nConduct Guidelines\noutline Kao’s principles\non Individual Human\nRights and Diversity,\nEqual Partnership,\nCorporate Culture &\nHuman Resource\nMeasures\n\nCaring for People & Partners\nEMPLOYMENT\nWe employ people based on their skill set and experience. All Kao Corporation roles within\nthe UK are advertised on the Kao Corporation careers portal, LinkedIn and via Indeed\n(Recruitment Agency) as a minimum, when advertising roles externally. We encourage\nemployee referrals from family and friends, to allow us to get to know the applicants. In\naddition our retail roles are advertised in store, on local shopping centre sites and in local\njob centres where appropriate.\n\nHealth, Wealth and\nWellbeing is critical\nfor ensuring that we\nhave an engaged\nworkforce and we\nsupport this in a\nvariety of ways\n\nWEALTH BENEFITS\n- Internal Social Committee\n- Competitive pension contributions\nfor long-term saving and / or\nInvestment Saving Account (ISA) as\nshort-term saving\n- Childcare discount vouchers\n- Generous product allocation\nand staff discount schemes\n- Earn as you shop across a\nvariety of other brands and\nretailers\n\nHEALTH BENEFITS\n- Employee Assistance Programme\n- Flu Jabs\n- Discounted gym membership\n- Cycle to work scheme\n- Eye care vouchers and free eye tests\n- Offer of health related benefits – Health\nGateway\n- Private medical health and dental health\n- Critical Health Insurance\n\nWELLBEING BENEFITS\n- Training for Mental Health\nAwareness\n- Promoting work life balance\n- Flexible Working Policy\n- Additional holiday purchase\nscheme\n\nCaring for People & Partners\nBLENDED LEARNING EXPERIENCES\nWe strongly believe in the value of continuous development of our people, so they can\nunleash their individual \"WOW!\" factor.\n2019 saw the introduction of our Digital Learning Universe, enabling a new way of\nlearning ‘IN THE MOMENT’, catering to all learning styles, environments and needs. \n\nWe blend the ever expanding digital learning universe\nwith more traditional classroom methods. This\nprovides a truly enriched way for our people to\nengage with our brand, whilst learning the\nimportance of our unique heritage, our products, our\npeople and the experiences that we offer to our\ncustomers.\nOur intuitive digital content is available\nboth on and offline, via desktop and\nmobile devices so our people can choose\nwhen & where they learn; across the\nglobe. Eliminating the need to print\ntraining documents and resources onto\npaper.\nThis digital way of learning enables global\nreach with a personalised tone of voice,\nempowering our internal workforce and\nmaking them feel invested in; as Molton\nBrown’s most valuable asset.\nIn quieter periods, it’s not unusual for you to see\nour people brushing up on their knowledge via a\nmobile device / digital hardware. This can take place\non the shop floor and will support our people in\nenhancing our customer experience when\ninteracting with our brand.\n\nCaring for People & Partners\nTHE KAO WAY\nWe offer integrity training to all office staff which will include guidelines around working\nwith suppliers, third parties and customers.\nThis training is available to all employees by visiting\nhttps://www.kao.com/global/en/about/policies/kaoway/\nINTEGRITY\nEmbodying the quality of being\nhonest and having strong moral\nprinciples.\nBEHAVING LAWFULLY\n& ETHICALLY\nWe behave lawfully and ethically, and\nearn the respect and trust of all\nstakeholders through sound and\nhonest business activities.\nRESPECT, FAIRNESS,\nSINCERITY & DILIGENCE\nWe treat others with respect and\nfairness, and pursue our work with\nsincerity and diligence in an effort to\noptimise the performance of\nindividuals and the corporation as a\nwhole\nRESPONSIBLE CORPORATE\nCITIZEN\nAs a responsible corporate citizen, we\nseek to ensure the safety of our\nproducts and operations, and\nproactively engage in solving social\nand environmental issues.\n\nCaring for People & Partners\nOUR COMMUNITY\nSustainability is one of the key values and principles of Kao Corporation globally. We\nnot only strive to create products that are sustainable and reduce our environmental\nimpact in our supply chain, Kao Corporation is also committed to make a positive\ndifference in the communities that we operate in. \n\nKao Corporation UK has\nimplemented the Kao Corporation\nUK Charity Committee.\nThe role of the Committee is to\ndevelop a charity program and\nmanage our charity activities\nacross the UK. Our employees\nhave voted and chosen to support\none charity in the UK: MacMillan\nCancer Support\n\nMacMillan Cancer\nSupport covers the\nwhole of the UK and\nwe have had events to\nraise funds – product\nsales, coffee & cake\nmornings etc. We are\nunable to donate\noutside of this charity\n\nWe are committed to\n‘Contribute to the\nEnrichment of Society\nthrough activities\nthat make a Social\nContribution’\n(Kao Corporation\nBusiness Conduct\nGuidelines)\n\nCaring for People & Partners\nOUR COMMUNITY\nWe empower our employees to engage with their communities and play an active role in\nthe Kao Corporate Social Responsibility activities.\n\nWe make donations and\nprovide support by\nconsidering social\nstandards, public interest\nand usefulness\n\nWe contribute to community\ndevelopment by enhancing\nactivities that make a social\ncontribution through\ncollaboration and cooperation\nwith diverse stakeholders\n\nIn order to contribute to\nlocal communities, we direct\nthe company’s monetary and\nproduct donations to where\nthey will be of use and\naccording to appropriate\npriorities\n\nWe shall respect and support\nemployees who proactively\ncontribute to society in the\nspirit of good citizenship, by\nparticipating in volunteering\nactivities\n\nWe conduct activities with the\ntheme, “Create an environment\ncultivating human resources and\npromote development of future\ngenerations” in order to contribute\nto and earn the trust and support of\nsociety. \n\nWe contribute to society by\nconducting activities to resolve\nsocial issues. We will also\ncontribute to the development\nof local communities. \n", "196": "Collection: ESG Trailer; Description: ", "197": "Collection: Invent Luxury Refill Solutions; Description: ", "198": "Collection: Gift Boxes; Description: ", "199": "Collection: Me Time - Self Indulgent Hand & Arm Massage; Description: ", "200": "Collection: Hand Refill - Focus on the WOW!; Description: ", "201": "Collection: Hand Refill - Last Impressions; Description: ", "202": "Collection: Hand Refill - Last Impressions; Description: ", "203": "Collection: Hand Refill - Eliminating the Ouches; Description: ", "204": "Collection: Hand Refill - First Impressions; Description: ", "205": "Collection: Seabourn - Focus on the WOW; Description: ", "206": "Collection: Seabourn - Eliminating the Ouches; Description: ", "207": "Collection: Seabourn - Last Impressions; Description: ", "208": "Collection: Seabourn - First Impressions; Description: ", "209": "Collection: FLOW AOP ELIMIN - Testing Products; Description: ", "210": "Collection: FLOW AOP ELIMIN - Universal Questions; Description: ", "211": "Collection: FLOW AOP ELIMIN - Body Language; Description: ", "212": "Collection: FLOW AOP WOW -Donations; Description: ", "213": "Collection: FLOW AOP WOW - Intro Collections; Description: ", "214": "Collection: FLOW AOP WOW - Fragrance Finder; Description: ", "215": "Collection: FLOW AOP WOW - Curated Experience; Description: ", "216": "Collection: FLOW AOP FIRST - Customer Behaviours; Description: ", "217": "Collection: FLOW AOP FIRST - The Consultant; Description: ", "218": "Collection: FLOW AOP FIRST - The Host; Description: ", "219": "Collection: FLOW AOP FIRST - Conversation Starters; Description: ", "220": "Collection: FLOW AOP FIRST - Creating a great impression; Description: ", "221": "Collection: FLOW - AOP - Last Impression; Description: ", "222": "Collection: Data Capture - Last Impressions; Description: ", "223": "Collection: Data Capture - What Have You Learnt?; Description: ", "224": "Collection: Data Capture - Eliminating The Ouches; Description: ", "225": "Collection: Data Capture - Focus On The WOW!; Description: ", "226": "Collection: Data Capture - First Impressions; Description: ", "227": "Collection: Data Capture - Target; Description: ", "228": "Collection: Flora Luminare - Focus on the WOW; Description: ", "229": "Collection: Flora Luminare - Eliminating the Ouches; Description: ", "230": "Collection: Flora Luminare - Last Impressions; Description: ", "231": "Collection: Flora Luminare - First Impressions; Description: ", "232": "Collection: Personas Video; Description: ", "233": "Collection: Empower Our People; Description: ", "234": "Collection: Net Carbon Neutral Manufacturing Facility; Description: ", "235": "Collection: Operate a Zero Landfill Waste Manufacturing Fac...; Description: ", "236": "Collection: Pioneer Packaging Reduction; Description: ", "237": "Collection: Committed to Cruelty Free Values; Description: ", "238": "Collection: Promote Sustainable Sourcing; Description: ", "239": "Collection: Champion Sustainable Natural Ingredients; Description: ", "240": "Collection: Reduce, Reuse, Recycle; Description: ", "241": "Collection: Make Logistics Green; Description: ", "242": "Collection: Linear vs. Circular Economy; Description: ", "243": "Collection: Forge Great Partnerships; Description: ", "244": "Collection: Enrich our Manufacturing Facility Community; Description: ", "245": "Collection: Create Sustainable Stores, Manufacturing Facili...; Description: ", "246": "Collection: Milk Musk - Quiz; Description: ", "247": "Collection: Milk Musk - Eliminating The Ouches; Description: ", "248": "Collection: Milk Musk - Focus On The WOW!; Description: ", "249": "Collection: Milk Musk - Last Impressions; Description: ", "250": "Collection: Milk Musk - First Impressions; Description: ", "251": "Collection: Maia Individuality_16x9; Description: ", "252": "Collection: Suede Orris - Last Impressions; Description: ", "253": "Collection: Jasmine and Sun Rose - Last Impressions; Description: ", "254": "Collection: Jasmine and Sun Rose - Focus on the WOW; Description: ", "255": "Collection: Jasmine and Sun Rose - First Impressions; Description: ", "256": "Collection: Jasmine and Sun Rose - Eliminating the Ouches; Description: ", "257": "Collection: Suede Orris - Eliminating the Ouches; Description: ", "258": "Collection: Suede Orris - Focus on the WOW!; Description: ", "259": "Collection: Suede Orris - First Impressions; Description: ", "260": "Collection: Christmas Discovery - Store Manager Guide; Description: Christmas Discovery\nGuide 2019\nManagers Guide\nWhy do we have a\nChristmas Discovery Guide?\nEveryone deserves the best start at Molton Brown\nand our Christmas Sales Consultants are no\nexception. They begin their journey with Molton\nBrown at our busiest time of year and they often\nfeel overwhelmed as they have a lot to learn in a\nshort space of time.\nThe Christmas Discovery Guide which is found on\nthe Digital Learning Academy is a tool designed to\nprovide our Christmas Sales Consultants with all\nthe information they need to understand their role,\nour products and our service expectations. \n\nShaping the Future\n2020 is going to be a big year for the Digital\nLearning Academy with new and exciting modules\nbeing created to support your learning at Molton\nBrown.\nPutting The Christmas Discovery Guide into practice\nwill help you become familiar with the learning\ninvolved in the ”New” Discovery Guide, which is\nbeing launched on the DLA in 2020.\nYour feedback is important to us so please get in\ntouch with the Customer Experience Team to let us\nknow how you used The Christmas Discovery Guide\nin your store. Was it useful? Is there anything that\nneeds to be included? Is there anything you would\nchange?\n\nYour Role\nOur Christmas Sales Consultants also\nneed YOUR support and guidance to\nmake their experience at Molton\nBrown a memorable one. The more\ntime you invest in your Christmas\nSales Consultants by going through\nthe Christmas Discovery Guide , the\nmore beneficial they will become to\nyour store! Developing their\nknowledge will build customer\nrapport and will support every sale\nopportunity that arises, which will\nhelp to deliver the store’s KPI’s.\n\nWhat Part Do You Play?\nTake your mind back to your first day at\nMolton Brown, how did you feel? You were\nprobably supported every step of the way\nin your new role.\nYour support is essential when using The\nChristmas Discovery Guide with your\nChristmas Sales Consultants. Some\ncontent within the guide is activity based\nand they will be unable to complete their\nlearning without your help and guidance.\n\nHow long will it take?\nAs soon as your Christmas Sales Consultant begins their\nMolton Brown festive journey they have THREE WEEKS to\ncomplete the Christmas Discovery Guide. They are also\nrequired to complete the Christmas Campaign Course which\nwill give them all the knowledge they need to provide the\nbest customer experience this Christmas.\nEvery Christmas Sales Consultant will require 1 hour\n32minutes per week to complete both courses.\nRemember…the more time you invest in training your\nChristmas Sales Consultants the greater your achievements\nwill be!\n\nSo what do you need to do?\nPreparation is key so take a look at the points below:-\n• Complete the Christmas Discovery Guide. This will get you up to speed with what\nis required when using the guide with your new starter\n• Once you are familiar with what is involved you can plan to spend time with your\nChristmas Sales Consultant. Remember there are modules that require your\nsupport especially around Till Training and Product Knowledge!\n• Use your team to support the new starter. There may be some modules that your\nteam can be involved with. This can also help your new starter to get to know\npeople in the team\n• Once your Christmas Sales Consultant has completed a module it is important\nthat you ask questions on what they have learned. Ask them what they have\ndiscovered or test them on their knowledge.\n• Remember to always check their progress! This is important as the guide will\nbuild confidence and benefit your sales. \n\nThe Christmas Discovery Guide is key to developing successful\nChristmas Sales Consultants, remember, they could be the stars of the\nfuture.\nPlease ensure the guide is completed fully on the Digital Learning\nAcademy with EVERY Christmas Sales Consultant.\nHappy Christmas\nThe Customer Experience Team", "261": "Collection: DLA Progress Report - Store Managers Guide; Description: Store Manager Guide\n“MY TEAM”\nHow to access “Your Teams” progress on the\nDigital Learning Academy\nT H E C U S T O M E R E X P E R I E N C E T E A M\n\nStore Manager Guide\n\nPlease follow the steps in this guide to have visibility\nof your teams progress on the\nDigital Learning Academy\n\nT H E C U S T O M E R E X P E R I E N C E T E A M\n\n1. On the Home page\nclick on the plus +\nbutton at the bottom\nof the screen\n2. Click on the\nsquiggle arrow to\nopen the next page\n3. Click on 3 lines in\nthe top left of the\nscreen\n4. Click on “My\nTeam” option at the\nbottom of the screen\n5. Here you can see your\nindividual team\nmembers progress,\nincluding, last log in,\ntime spent studying and\nactive registrations.\nClick on a team member\nto see more…\n6. You can see here if\nyour team member\nhas completed the\nmandatory courses.\n7. If you want to see a\nreport containing all\nteam members, click on\nthe “All Registrations”\nlink.\n8. Once clicked a\nmessage will appear\ntelling you that a report\nis being generated and\nwill be emailed to you.\n9. You will receive an\nemail from\n@crossknowledge.\n10. Open the email and\nclick on the “Download”\noption. The report will\ntake a few minutes to\ndownload.\nThe “My Team” report shows all your Team Members details including,\nscores, points earned and courses that are active or complete.\n", "262": "Collection: Universal Profiler - \"I know what I want\"; Description: ", "263": "Collection: Fragrance Profiler - \"I need some help\"; Description: ", "264": "Collection: Fragrance Profiler - Sampling; Description: ", "265": "Collection: Universal Profiler - Gifting; Description: ", "266": "Collection: Fragrance Profiler - Fully Immersive; Description: ", "267": "Collection: Fragrance Profiler - Just Browsing - Russian Le...; Description: ", "268": "Collection: Universal Profiler Questions - Understood; Description: Who are you buying for today?\n• Here you want to establish who the\ncustomer is buying for. This will allow you\nto assess whether you’ll need to offer our\nbespoke gift wrap service.\n• If the customer is buying a gift, you can\nconsider offering them the opportunity to\nalso try for themselves.\nThink…WHO, WHO & YOU\nWhat is the most important thing to you\nwhen buying a fragrance?\n• This will guide you to the information you can\nprovide the customer.\ne.g The Customer is a heritage buff, therefore you can\nshare the Molton Brown story\n• You will gain an understanding regarding the\ncustomers fragrance knowledge.\n• This could also give you an insight into the brands\nor ingredients the customer prefers.\nDescribe to me their/his/her/your/others\npersonality in three words?\n• This will potentially guide you into the fragrance\nfamilies the customer prefers.\ne.g. If they use words such as romantic, sensual,\ngraceful, caring or loving, what fragrance family\nwould you suggest?\n• This could also guide you in their approach to why\nthey wear a fragrance.\ne.g If they use words such as traditional, classic or\nindulgent they are considered to love the finer things\nin life. Which fragrance would you recommend?\nWhat is you favourite Aroma?\n• This will also potentially guide you into the\nfragrance families the customer prefers.\ne.g. Should the customer mention they love the aroma\nof fresh coffee it could indicate that a “Woody”\nfragrance would appeal to them.\n• Should the customer love the smell of baked bread\nit could indicate that a “Gourmand” fragrance\nwould appeal to them.\nWhat do you already know about\nour Molton Brown Fragrances?\n• This will help you understand any\ncollections or categories they already\nlove.\n• Based on this you may be able to\ncross/upsell to different collection and\ncategories.\n• If they love a particular collections you\ncan introduce them to the new Eau de\nParfum and showcase your expertise.\n• This could indicate a Data Capture\nopportunity.\nIntroduce the customer the\nfragrance collections\nEaux de Parfum & Eaux de Toilettes\nPresent 3 fragrances that represent 3 different fragrance families\nand lead with the EDP ‘unless’ the customer has volunteered that\nthey want a lighter more frequently spritzed fragrance.\nUse your expert knowledge to Surprise & Delight your customer.\nWhat can you tell them?\nSampling\nBasket\nBuilding\nGift with Purchase\nThe perfect way to enhance your customers experience is to introduce\nthe GWP, but when is the right time to do this……..?\n• Once you have agreed on a single unit sale, e.g. Orange & Bergamot\nEau de Pafrum, offer your customer the opportunity to experience\nthe rest of the collection.\n• If the customer is happy with just their single purchase, surprise\nthem with the choice of their gift with purchase.\n• Add value to the GWP by complimenting their choice, guiding and\nsupporting their decisions with your fabulous product knowledge.\n• Invite the customer back to let you know how they got on with the\nproducts in their gift.\nStatistics tell us that once a customer reaches a point of payment they\ngenerally have made up their mind on what they intend to spend and are\noften thinking of where they are going next.\nSo, what do we do at the till point…?\nClosing the sale\n• Provide your customers with a seamless, professional and efficient till point\nexperience.\n• Any messages, offers and unique personalisation opportunities should have\nbeen discussed earlier. Think about your journey with the customer so far,\nwhere were the opportunities to offer:\nBespoke Gift Wrap?\nData Capture?\nGWP?\nPersonalisation?", "269": "Collection: FAQ's; Description: ELIMINATING THE OUCHES\nFAQ’S\nWhy are you no longer\nproviding the duo boxes in store\nand only online as a carton?\nHaving reviewed our Gifting\nProposition we still want to\nprovide customers with an\nelevated Gifting offer. However,\nwe do not want to over package\nour products, which is why we\nhave removed the duo box from\nour Gifting Offer.\n\nIs it necessary to have so much tissue paper?\nWe have worked to use the minimum amount of\ntissue paper, only a couple of sheets per box or bag.\nOur tissue paper is recyclable, biodegradable and\ncompostable. You can dispose of the tissue in your\nfood or green waste.\n\nWhat dyes are used on the boxes and bag – are\nthese environmentally friendly?\nThe dyes used on our boxes and bag are\nenvironmentally friendly.\n\nAre you not worried about sustainability?\nLight years ahead of our time, sustainability has\nbeen always been at the heart of Molton Brown.\nOur founders always used packaging which could be\nrecycled easily and were among the first to be\nagainst animal testing.\nToday, we strongly believe Luxury and Sustainability\ngo hand in hand, which is why this new Gifting Offer\nuses 15 tons less material than our previous\npackaging. In addition, our teams are working very\nhard to make this packaging even more sustainable\nfor the future. \n\nDo you need to use plastic bags to\nwrap you candles/ aroma reeds/\nChristmas gift boxes? Is the wrapper\nrecyclable?\nTo ensure your products arrive to you in\npristine condition, we aim to package\nproducts carefully and securely to\nprevent marking or scuffing on your\nproducts. The plastic wrapping is not\nrecyclable. The use of the plastic\nwrapping is currently under review\n\nAre the new boxes and bags recyclable?\nOur boxes are recyclable but you need to remove\nthe magnet from the front of the box first. All of\nour bags are recyclable except the handles, which\ncan be removed. We would advise you to re-use\nour boxes and bags as a beautiful storage solution\nrather than recycling.\n\nAre the ribbons recyclable?\nUnfortunately, at this stage our\nribbons are not recyclable. We\nwould advise you to re-use our\nbeautiful ribbons as an adornment\nto any gift. We are looking at an\nalternative for the future. \n\nWhy has the print on the\nboxes/tissue paper changed?\nAs we aim to refine our Brand\nExperience to its very best, we\nhave reworked our Gifting Boxes\nto align them with the look and\nfeel of our new Fragrance\nPackaging. This still incorporates\nour signature Molton Brown\nCompass pattern.\n\nWhy have you changed the duo box? You are a luxury\nbrand; I expect the old style.\nHaving reviewed our Gifting Proposition we still want to\nprovide customers with elevated Gifting offer. However,\nwe do not want to over package our products, which is\nwhy we have removed the duo box from our Gifting Offer\n\nWhat elements of Molton Brown’s gift wrap\nmaterials are recyclable?\n- Boxes (please remove the magnet before recycling)\n- Bags (please remove handles before recycling)\n- Tissue Paper\n- Tissue paper stickers\n- The adhesive tape on gift boxes\n\nWhy have you changed for a\nbox and lid to a magnet lock\nbox?\nIn line with current trends we\nhave updated the design of our\ngift boxes to a magnet close.\n\nI want to add\nsomething else into my\nbag, but the sticker is\nalready closed?\nNo problem! Please just\nask for a replacement\nbag and sticker. \n\nWhy have you changed the\nhandles of the bag from\nribbons to acrylic handles?\nIn line with current trends we\nhave updated the design of\nour gift bags to acrylic\nhandles", "271": "Collection: Fragrance Profiler - \"Booking a Consultation\"; Description: ", "272": "Collection: Fragrance Refill Machine; Description: ", "273": "Collection: Body Oils; Description: BEHIND BATH & BODY\nBODY OILS\nSENSUAL • NOURISHING • MOISTURISING\nEach of our body oils are\nan indulgent sensorial\nexperience and offer the\nopportunity to engage\nthe senses through touch\nand scent.\n\nKEY INGREDIENT\nWe use Argan Oil in each of our Body\nOils. Argan Oil is high in vitamin E,\nOmega 6 and 9 that are known to\nprovide multiple conditioning and\nmoisturising benefits for the skin.\n\nWHY IS IT SPECIAL?\nSENSORIAL EXPERIENCE\nApplying a few drops of body oil to the skin\nallows for a sensuous, olfactory experience.\nUNIQUE FINISH\nOur body oils deliver deeper moisturisation, yet\nlightweight wearibility to enhance a natural tan\nleaving the skin feeling smooth satin-soft and\ntouchably soft.\nNOURISHING\nAn alternative to body lotions, body oils offer\nthe perfect way to keep your skin moisturized\nwhile relaxing your mind. They enhance the\nquality of your skin because they soak quickly\nand deeply to leave it moisturised all day long.\n\nBODY OIL COLLECTION\n\nBEHIND BATH & BODY\nBODY OILS\nSENSUAL • NOURISHING • MOISTURISING\n\n“This has become my favourite\nBody Oil! It’s a true dry oil, as it\ngoes on and sinks in, it does not\nleave the skin oily at all. My skin\ndoes look luminous all day and\nfeels supple”\nMOLTON BROWN CUSTOMER\nMesmerising Oudh Accord and Gold\n\nPERFECT FOR\nWHEN...\nSTEPPING OUT OF A RELAXING BATH\nOR MORNING SHOWER\nTO FEEL...\nENVELOPED IN A LUMIONOUS ELIXIR\nFOR THE BODY\nIF...\nYOU ARE SEEKING SOFT, SMOOTH\nAND NOURISHED SKIN\nFEELS LIKE\nSILK\nGLIDING OVER YOUR SKIN\nA RITUAL\nTHE PERFECT ADDITION TO YOUR\nBEAUTY ROUTINE\nRADIANCE\nGLOW, GLOW, GLOW!\n\nENRICHED WITH\nARGAN OIL\nALL OF OUR BODY OILS\nNEROLI ESSENTIAL OIL\nORANGE AND BERGAMOT\nINDIAN MORINGA OIL\nMESMERISING OUDH ACCORD AND GOLD\nNIGELLA SATIVA SEED OIL\nJASMINE AND SUN ROSE\nTAMANU OIL\nHEAVENLY GINGERLILY\n\nBEHIND BATH & BODY\nBODY OILS\nSENSUAL • NOURISHING • MOISTURISING\nIN THE KNOW\nTOP TIP: Massage\nthe Body Oil in\nsweeping strokes\ntowards the heart, to\nincrease circulation\nand enhance\nluminosity\n\nTARGETED MOISTURISATION\nEnriched with Argan Oil, our Body Oils can be used\nto target particularly dry areas for glowing summer\nskin.\nSTEP 1: Using circular motions, exfoliate wet skin\nusing your chosen Body Polisher, focusing on\nparticularly dry areas such as elbows, ankles and\nknees.\nSTEP 2: Gently cleanse using your chosen Bath and\nShower Gel, and pat the skin dry.\nSTEP 3: Using a few drops of Body Oil, warmed in\nyour hands, apply to skin with sweeping motions,\nfocusing on the elbows and knees\n\nSCENTING SUMMER SKIN\nFor the ultimate indulgence, complete your bathing\nritual with the full fragrance collection.\nSTEP 1: Pour a couple of drops of your chosen\nBathing Oil into warm running water to create a\nbeautifully fragranced Bath.\nSTEP 2: Indulge your senses as you soak from head\nto toe. Gently pat your skin almost dry, leaving it\nslightly damp.\nSTEP 3: Decant a couple of drops of Body Oil into\nthe palm of your hand, and apply all over your body\nin circular motions for summer ready skin. You can\ndress immediately.", "274": "Collection: Gift Bags; Description: ", "275": "Collection: Hot Press; Description: ", "276": "Collection: Bespoke Gifting Creation; Description: Discover how our Eau de Toilette ad Eau de Parfum boxes are created", "277": "Collection: Jerome Individuality_9x16; Description: ", "278": "Collection: MAIA LERNOUT; Description: ", "279": "Collection: CARLA CHABERT; Description: Discover Carla's unique individuality", "280": "Collection: Jacques Individuality; Description: ", "281": "Collection: Body Oil \nSian Atkins; Description: BEHIND BATH & BODY\nBODY OILS\n\nEach of our body oils\nare designed to replenish skin and help\nde-stress body and\nmind.\n\nKEY INGREDIENT\nWe use Argan Oil in each of our Body\nOils. Argan Oil is high in vitamin E and\nessential fatty acids that are known to\nprovide multiple conditioning and\nmoisturising benefits for the body\n\nWHY IS IT SPECIAL?\nSENSORIAL EXPERIENCE\nOur body oils allow for sensuous application and\nmassage whereas our lotions deliver a quicker\ncomforting technique of application as well as a\nfaster absorption into the skin.\nUNIQUE FINISH\nOur body oils leave skin satiny and luminous\nwhereas our lotion delivers a more matte\nmoisturized look.\nNOURISHING\nBody Oils are unique in their ability to provide\neffective moisturisation and nourishing benefits.\nOur body oils nourish skin in a very pure and\nconcentrated way giving a satin soft skin feel.\n\nTO ENHANCE YOUR EXPERIENCE, USE ALONGSIDE:\n", "282": "Collection: Bathing Oil; Description: BEHIND BATH & BODY\nBATH OILS\nEach of our bath oils\nare designed to replenish skin and help\nde-stress body and\nmind.\n\nKEY INGREDIENT\nEach of our bath oils contain a\nsignature essential oil to leave skin\nfeeling silky-soft and delicately\nperfumed. Jasmine & Sun Rose uses\nnigella seed oil, Oudh Accord & Gold\nuses moringa oil, Rosa Absolute uses\nrose and argan oil while Orange &\nBergamot uses uses neroli oil. \n\nWHY IS IT SPECIAL?\nREJUVINATION\nA bath oil mixed with water has the ability to\npenetrate deep into the skin tissue and provide\nrejuvenation.\nMULTI-SENSORY\nThe warmth of bath water helps the skin to\nabsorb the essential oils while their fragrance is\ninhaled.\nPAMPERING\nOur voluptuously scented bath oils transforms\nyour bath into a milky elixir for an intensely\npampered experience..\n\nTO ENHANCE YOUR EXPERIENCE, USE ALONGSIDE:", "283": "Collection: Fragrance is Family; Description: ", "284": "Collection: Johnathan & Julie 2.0; Description: ", "285": "Collection: Molton Brown Factory; Description: ", "286": "Collection: Digital Learning Academy Teaser; Description: Teaser video of the Digital Learning Academy (july 2019)", "287": "Collection: Ingredientology; Description: ", "288": "Collection: The Perfume Salon\nSian Atkins; Description: ", "289": "Collection: Fragrance Deconstructed; Description: ", "290": "Collection: Scents Of Smell; Description: ", "291": "Collection: Coming soon; Description: ", "292": "Collection: Coming soon; Description: ", "293": "Collection: Coming soon; Description: "}